nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
//------- 多媒体信息类型---------------
u8  Multimedia_Flag=1;//需要上传的多媒体信息类型   1:视频   2:音频   3:图像
u8  SpxBuf[SpxBuf_Size];  
u16 Spx_Wr=0,Spx_Rd=0;
u8  Duomeiti_sdFlag=0; 

//------- 录音开始或者结束---------------
u8  Recor_Flag=1; //  1:录音开始   2:录音结束


//----------808协议 -------------------------------------------------------------------------------------	
u8		SIM_code[6];							   // 要发送的IMSI	号码
u8		IMSI_CODE[15]="000000000000000";							//SIM 卡的IMSI 号码
u8		Warn_Status[4]		=
{
		0x00, 0x00,0x00,0x00
}; //  报警标志位状态信息
u8  Warn_MaskWord[4]		=
{
		0x00, 0x00,0x00,0x00
};   //  报警屏蔽字    
u8  Text_MaskWord[4]=
	{
			0x00, 0x00,0x00,0x00
	};	 //  文本屏蔽字    
u8  Key_MaskWord[4]=
	{
			0x00, 0x00,0x00,0x00
	};	 //   关键字屏蔽字    
	


u8		Car_Status[4]		=
{
		0x00, 0x0c,0x00,0x00 
}; //  车辆状态信息	
T_GPS_Info_GPRS 	Gps_Gprs,Bak_GPS_gprs;	 
T_GPS_Info_GPRS	Temp_Gps_Gprs; 
u8   A_time[6]; // 定位时刻的时间

u8      ReadPhotoPageTotal=0;
u8      SendPHPacketFlag=0; ////收到中心启动接收下一个block时置位


//-------- 紧急报警 -------- 
u8		warn_flag= 0;		  
u8		f_Exigent_warning= 0;//0;     //脚动 紧急报警装置 (INT0 PD0)
u8		Send_warn_times= 0;     //   设备向中心上报报警次数，最大3 次
u32  	fTimer3s_warncount=0;

// ------  车辆信息单独了 ---------------
VechINFO     Vechicle_Info;     //  车辆信息  
VechINFO     Vechicle_Info_BAK;  //  车辆信息 BAK
VechINFO     Vechicle_info_BAK2; //  车辆信息BAK2     
u8           Login_Menu_Flag=0;       //   登陆界面 标志位


//------  车门开关拍照 -------
DOORCamera   DoorOpen;    //  开关车门拍照

//------- 北斗扩展协议  ------------
BD_EXTEND     BD_EXT;     //  北斗扩展协议  
DETACH_PKG   Detach_PKG; // 分包重传相关
SET_QRY         Setting_Qry; //  终端参数查询
u32     CMD_U32ID=0; 
PRODUCT_ATTRIBUTE   ProductAttribute;// 终端属性
HUMAN_CONFIRM_WARN   HumanConfirmWarn;// 人工确认报警

//-----  ISP    远程下载相关 -------
ISP_BD  BD_ISP; //  BD   升级包    



// ---- 拐点 -----
u16  Inflexion_Current=0;
u16  Inflexion_Bak=0;      
u16  Inflexion_chgcnter=0; //变化计数器
u16  InflexLarge_or_Small=0;     // 判断curent 和 Bak 大小    0 equql  1 large  2 small  
u16  InflexDelta_Accumulate=0;  //  差值累计 

// ----休眠状态  ------------
u8  SleepState=0;  //   0  不休眠ACC on            1  休眠Acc Off 
u8  SleepConfigFlag=0; //  休眠时发送鉴权标志位

//---- 固定文件大小 --- 
u32 mp3_fsize=5616;
u8  mp3_sendstate=0;
u32 wmv_fsize=25964;
u8  wmv_sendstate=0;

//-------------------   公共 ---------------------------------------		
static u8 GPSsaveBuf[40];     // 存储GPS buffer
static u8	ISP_buffer[1024];
static u16 GPSsaveBuf_Wr=0;


POSIT Posit[60];           // 每分钟位置信息存储
u8    PosSaveFlag=0;      // 存储Pos 状态位 

NANDSVFlag   NandsaveFlg;
A_AckFlag    Adata_ACKflag;  // 无线GPRS协议 接收相关 RS232 协议返回状态寄存器
TCP_ACKFlag  SD_ACKflag;     // 无线GPRS协议返回状态标志 
u32  SubCMD_8103H=0;            //  02 H命令 设置记录仪安装参数回复 子命令
u32  SubCMD_FF01H=0;            //  FF02 北斗信息扩展
u32  SubCMD_FF03H=0;     //  FF03  设置扩展终端参数设置1
u8   Fail_Flag=0;


u8  SubCMD_10H=0;            //  10H   设置记录仪定位告警参数
u8  OutGPS_Flag=0;     //  0  默认  1  接外部有源天线
u8   Spd_senor_Null=0;  // 手动传感器速度为0
u32  Centre_DoubtRead=0;     //  中心读取事故疑点数据的读字段 
u32  Centre_DoubtTotal=0;    //  中心读取事故疑点的总字段
u8   Vehicle_RunStatus=0;    //  bit 0: ACC 开 关             1 开  0关
                             //  bit 1: 通过速度传感器感知    1 表示行驶  0 表示停止   
                             //  bit 2: 通过gps速度感知       1 表示行驶  0 表示停止  
u8   Status_TiredwhRst=0;    //  当复位时 疲劳驾驶的状态   0 :停车  1:停车但没触发 2:触发了还没结束                              



u32   SrcFileSize=0,DestFilesize=0,SrcFile_read=0;
u8    SleepCounter=0; 

u16   DebugSpd=0;   //调试用GPS速度  
u8    MMedia2_Flag=0;  // 上传固有音频 和实时视频  的标志位    0 传固有 1 传实时






unsigned short int FileTCB_CRC16=0;
unsigned short int Last_crc=0,crc_fcs=0; 



//---------  中心应答  -----------
u8		 fCentre_ACK=0; 			  // ---------判断中心应答标志位－－
u8		 ACK_timer=0;				   //---------	ACK timer 定时器--------------------- 
u16         ACKFromCenterCounter=0;//十包无应答重新拨号  
u8           Send_Rdy4ok=0;
unsigned char	Rstart_time = 0; 


//---------------  速度脉冲相关--------------
u16  Delta_1s_Plus=0;
u16  Delta_1s_Plus2=0; 
u16  Sec_counter=0;

void  K_AdjustUseGPS(u32  sp_DISP);  // 通过GPS 校准  K 值  (车辆行驶1KM 的脉冲数目) 
void  Delta_Speed_judge(void);   

u16  Protocol_808_Encode(u8 *Dest,u8 *Src, u16 srclen);
void Protocol_808_Decode(void);  // 解析指定buffer :  UDP_HEX_Rx  
void Photo_send_end(void);
#ifdef REC_VOICE_ENABLE
void Sound_send_end(void);
#endif
//void Video_send_end(void);  
unsigned short int  File_CRC_Get(void);  
void Spd_ExpInit(void);
void AvrgSpd_MintProcess(u8 hour,u8 min, u8 sec) ; 
u32   Distance_Point2Line(u32 Cur_Lat, u32  Cur_Longi,u32 P1_Lat,u32 P1_Longi,u32 P2_Lat,u32 P2_Longi);
void  RouteRail_Judge(u8* LatiStr,u8* LongiStr);  

//  A.  Total  

void delay_us(u16 j)
{
	u8 i;
	  while(j--)
	  	{
	  	i=3;
	  	while(i--);
	  	}  
}

void delay_ms(u16 j )
{
  while(j--)
  	{
           DF_delay_us(2000); // 1000
  	} 
}

 u8  Do_SendGPSReport_GPRS(void)   
{  	
  //unsigned short int crc_file=0;  
  u8  packet_type = 0;
  
// 	  u8 i=0;
            if(DEV_Login.Operate_enable==1)   // !=2   
			 	{                  
				  if((1==DEV_Login.Enable_sd)&&(0==DEV_regist.Enable_sd))
					  {
						Stuff_DevLogin_0102H();   //  鉴权   ==2 时鉴权完毕
						DEV_Login.Enable_sd=0;
						//------ 发送鉴权不判断 ------------------
						//DEV_Login.Operate_enable=2;  //  不用判断鉴权了   
						return true; 
					  }
			 	}
            //------------------------ MultiMedia Send--------------------------
		    if((MediaObj.Media_transmittingFlag==2)&&(DEV_Login.Operate_enable==2))	
            {
			    if(1==MediaObj.SD_Data_Flag) 
			 	{
	                  Stuff_MultiMedia_Data_0801H();     
					  MediaObj.SD_Data_Flag=0; 
                  return true;
			 	}
			   return true; // 按照808 协议要求 ，传输多媒体过程中不允许发送别的信息包
            } 
            if(1==DEV_regist.Enable_sd)
               {									
                  Stuff_RegisterPacket_0100H(0);   // 注册
                   JT808Conf_struct.Msg_Float_ID=0;
                  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
				  DEV_Login.Sd_counter=0;
				  DEV_Login.Operate_enable=0;
		          DEV_regist.Enable_sd=0;
		          //  JT808Conf_struct.Regsiter_Status=1; //标注注册，但不存储		  
                return true;
               }
            if(1==DEV_regist.DeRegst_sd)
            	{
            	  Stuff_DeviceDeregister_0101H(); 
                  DEV_regist.DeRegst_sd=0;		     		  
				  return true;
            	}
            if((1==JT808Conf_struct.DURATION.Heart_SDFlag)&&(DataLink_Status())&&(SleepState==0)&&(DEV_Login.Operate_enable==2)) //  心跳
            	{
                  Stuff_DeviceHeartPacket_0002H();
                  JT808Conf_struct.DURATION.Heart_SDFlag=0;
				  JT808Conf_struct.DURATION.TCP_SD_state=1;  //发送完后置 1   
				  return true;  
            	} 			
            if((1==SleepConfigFlag)&&(DataLink_Status())&&(SleepState==1)) //  休眠时心跳
            	{
                 // Stuff_DevLogin_0102H();   //  鉴权   ==2 时鉴权完毕
                 // rt_kprintf("\r\n	 休眠时用鉴权做心跳包 ! \r\n");  
                  SleepConfigFlag=0;  
				  return true;   
            	} 
			
            if(1==SD_ACKflag.f_CurrentPosition_0201H)    // 位置信息查询
            	{
                  Stuff_Current_Data_0201H();
				  SD_ACKflag.f_CurrentPosition_0201H=0;
				  return true;
            	} 
            if(1==SD_ACKflag.f_CurrentEventACK_0301H)   //  事件报告
            	{
                  Stuff_EventACK_0301H();
				  SD_ACKflag.f_CurrentEventACK_0301H=0;
				  return true;                  
            	}
				            
	         if(2==ASK_Centre.ASK_SdFlag)      //  提问应答 
	             	{
	                  Stuff_ASKACK_0302H();
	                  ASK_Centre.ASK_SdFlag=0; 
	                  return true;  
	             	}             	
			             	// 9.  中心拍照命令应答
				if( 1 == SD_ACKflag.f_BD_CentreTakeAck_0805H )                                                                           // 中心拍照命令应答
				{
					Stuff_CentreTakeACK_BD_0805H( );
					SD_ACKflag.f_BD_CentreTakeAck_0805H = 0;
					return true;
				} 	
             if(1==Vech_Control.ACK_SD_Flag)   //  车辆应答控制
             	{
                  Stuff_ControlACK_0500H(); 
				  Vech_Control.ACK_SD_Flag=0;
				  return true;                  
             	}
			 
			 if(SD_ACKflag.f_MsgBroadCast_0303H==1)
			 	{
                   Stuff_MSGACK_0303H(); 
                   SD_ACKflag.f_MsgBroadCast_0303H=0;
                   return true;
			 	}
			 	 if((1==MediaObj.SD_media_Flag)&&(DEV_Login.Operate_enable==2))
			 	{
				   Stuff_MultiMedia_InfoSD_0800H();
				   MediaObj.SD_media_Flag=2;  // original clear  0 ,,HBTDT =2  ,timeout ACK 
                   return true;    
			 	}	
             if(DataTrans.Data_TxLen)
             	{ 
                  Stuff_DataTransTx_0900H();  // 数据透传 做远程下载
                  DataTrans_Init();     //clear 
                  return true;
             	} 		
             if(SD_ACKflag.f_MediaIndexACK_0802H)
             	{
                   Stuff_MultiMedia_IndexAck_0802H();   // 多媒体索引上报 
                   SD_ACKflag.f_MediaIndexACK_0802H=0;
				   return true;
             	}			 
			 if(SD_ACKflag.f_DriverInfoSD_0702H)
			 	{
			 	   Stuff_DriverInfoSD_0702H();  //  驾驶员信息上报
                   SD_ACKflag.f_DriverInfoSD_0702H=0;
                   return true;
			 	}
			 	//  18.数据透传 做远程下载	 
             if(CAN_trans.canid_0705_sdFlag)
             	{ 
                  Stuff_CANDataTrans_BD_0705H();
		          CAN_trans.canid_0705_sdFlag=0; // clear 		   
               //   DataTrans_Init();     //clear 
                  return true;
             	} 	
			  if(SD_ACKflag.f_Worklist_SD_0701H)
			 	{
			 	   Stuff_Worklist_0701H();  //   电子运单 
                   SD_ACKflag.f_Worklist_SD_0701H=0;
                   return true;
			 	}
			  		//  23.   查询终端参数	
	         if(SD_ACKflag.f_SettingPram_0104H)
	        	{
	        	  if(SD_ACKflag.f_SettingPram_0104H==1)
	        	      Stuff_SettingPram_0104H(); 
				  else
				  if(SD_ACKflag.f_SettingPram_0104H==2)
				  	  Sub_stuff_AppointedPram_0106();     
				  
                   SD_ACKflag.f_SettingPram_0104H=0;    
				   return true;
	        	}	
			    //  24 .  终端升级结果上报
              if(SD_ACKflag.f_BD_ISPResualt_0108H)
              	{
                                
				     Stuff_ISP_Resualt_BD_0108H();
                     
                    if(1==SD_ACKflag.f_BD_ISPResualt_0108H)
                    {
                      if( File_CRC_Get()==true)
					       ISP_file_Check();  // update 
                    }
					else
					   BD_ISP.ISP_running=0; // recover normal  	 
					SD_ACKflag.f_BD_ISPResualt_0108H=0;
				     return true;		   
              	}
	        if(SD_ACKflag.f_CentreCMDack_0001H)
	         {
                               Stuff_DevCommmonACK_0001H();        
				   if(SD_ACKflag.f_CentreCMDack_0001H==2)  //  修改IP设置了需要重拨
				   	   Close_DataLink();    //  AT_END    
				   else	   
				   if(SD_ACKflag.f_CentreCMDack_0001H==3) //   远程复位
				   	{
                                       Systerm_Reset_counter=Max_SystemCounter;
					  ISP_resetFlag=2;    //   借助远程下载重启机制复位系统
				   	}
				   else
				   if(SD_ACKflag.f_CentreCMDack_0001H==5) //   关闭数据通信
				   	{
				   	   Close_DataLink();  
                                      Stop_Communicate();      
				   	}				 
                               SD_ACKflag.f_CentreCMDack_0001H=0; 
				   SD_ACKflag.f_CentreCMDack_resualt=0;    
                   
				   
