nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                   return true;    
				}  	 
         
		 //  15.  行车记录仪数据上传
			  //------------ Error	state --------------
				if(Recode_Obj.Error)
				 {
		 
					Stuff_RecoderACK_0700H_Error();
					Recode_Obj.Error=0;
					Recode_Obj.SD_Data_Flag = 0;
					Recode_Obj.CountStep = 0;
					  rt_kprintf("\r\n	记录仪CoutStepFlag=0--3 \r\n");
					return true;
				 } 
             
			 //-----------------------------------------
			 if((1==Recode_Obj.SD_Data_Flag)&&(1==Recode_Obj.CountStep))
			 {
				 //  1. clear	one  packet  flag
				 switch( Recode_Obj.CMD )
				 {
					 /* 			   divide  not	stop	2013-6-20  */
					 //----------------------------------------------------
						case 0x08:
						case 0x09:
						case 0x10:
						case 0x11:
						case 0x12:
						case 0x15:
					  //---------------------------------------------------
					 case 0x00:
					 case 0x01:
					 case 0x02:
					 case 0x03:  
					 case 0x04:
					 case 0x05:
					 case 0x06: 
					 case 0x07:
					 case 0x13:
					 case 0x14:    //	上边是查询的
			 
					  case 0x82: //    中心设置车牌号  
					  case 0x83://	记录仪初次安装时间
					  case 0x84:// 设置信号量配置信息
					  case 0xC2: //设置记录仪时钟
					  case 0xC3: //车辆速度脉冲系数（特征系数）
					  case 0xC4: //   设置初始里程
					 //------------------------
						 Recode_Obj.SD_Data_Flag = 0;
						 Recode_Obj.CountStep= 0;
						   rt_kprintf("\r\n  记录仪CoutStepFlag=0--2 \r\n");
						 break;
					 default:
							   break;
				 }
				 //  2.  stuff	 recorder	infomation
				 //  judge	packet	type
				 if( Recode_Obj.Devide_Flag==1 )
				 {
					 packet_type = Packet_Divide;
				 } else
				 {
					 packet_type = Packet_Normal;
				 }	
			 
				 Stuff_RecoderACK_0700H( packet_type); //	行车记录仪数据上传
				 
				 rt_kprintf( "\r\n 记录仪 CMD_ID =0x%2X \r\n", Recode_Obj.CMD );
				 if( packet_type == Packet_Divide )
				 {
					 rt_kprintf( "\r\n current =%d	Total: %d \r\n", Recode_Obj.Current_pkt_num, Recode_Obj.Total_pkt_num );
				 }
				 //  3. step  by  step	send   from  00H  ---  07H
			 
			 
				 if( Recode_Obj.CountStep==1 )
				 {
					 Recode_Obj.CountStep=2;
					 Recode_Obj.timer = 0;
					 rt_kprintf( "\r\n 记录仪定时发送----CountStep"); 
				 }
			 
				 return true;  
			   } 
			//----------------------------------------------------------------------
			if(Current_State==1)   // 调试时30  实际是10 Current_SD_Duration 
			 {	
				 if(PositionSD_Status()&&(DEV_Login.Operate_enable==2)&&((enable==BD_EXT.Trans_GNSS_Flag)||(DispContent==6))||(Current_UDP_sd&&PositionSD_Status()&&(DEV_Login.Operate_enable==2))||((DF_LOCK==enable)&&PositionSD_Status()))	  //首次定位再发 
				   //  if((PositionSD_Status())&&(DataLink_Status())&&(DEV_Login.Operate_enable==2))	                                                                                                                     // DF  锁定发送当前位置信息  
			      {
			                  PositionSD_Disable();
					          Current_UDP_sd=0; 
	                              //1.   时间超前判断
	                              //if(Time_FastJudge()==false)
								//return false;		
					  // 2. 			  
				 	   Stuff_Current_Data_0200H();  // 上报即时数据  				   
					   //----应答次数 ----		   
					  // ACKFromCenterCounter++; // 只关注应答报数，不关心应答时间 
					   //---------------------------------------------------------------------------------
					   if(DispContent)	
						    rt_kprintf("\r\n 发送 GPS -current !\r\n");     
					   return true;
				    }   
			 }
			 else 
             if((RdCycle_RdytoSD==ReadCycle_status)&&(0==BD_ISP.ISP_running)&&(DataLink_Status())&&(DEV_Login.Operate_enable==2)&&(CameraState.camera_running==0))    // 读取发送--------- 正常GPS 
             {                                       /* 远程下载时不允许上报GPS ，因为有可能发送定位数据时
                                                          正在接收大数据量得下载数据包,导致GSM模块处理不过来，而不是单片机处理不过来*/
                  if (false==Stuff_Normal_Data_0200H())        
				 	return false;
				  fCentre_ACK=1;// 判断应答
				 //-------- change status  Ready  ACK  ------ 
			         ReadCycle_status=RdCycle_SdOver;
				  Send_Rdy4ok=1;  // enable
				  //----应答次数 ----		  
				  ACKFromCenterCounter++; 
				 // if(DispContent)	
					//  rt_kprintf("\r\n 发送 GPS --saved  OK!\r\n");    
				 return true; 
             }			 
 			//-------------------------------------------------------------
			return  false; 
             
}
void strtrim(u8 *s, u8 c)
{
	u8		 *p1, *p2;
	u16  i, j;

	if (s == 0) return;

	// delete the trailing characters
	if (*s == 0) return;
	j = strlen((char const *)s);
	p1 = s + j;
	for (i = 0; i < j; i++)
	{
	   	p1--;
	   	if (*p1 != c) break;
	}
	if (i < j) p1++;
	*p1 = 0;	// null terminate the undesired trailing characters

	// delete the leading characters
  	p1 = s;
	if (*p1 == 0) return;
	for (i = 0; *p1++ == c; i++);
	if (i > 0)
	{
		p2 = s;
	 	p1--;
		for (; *p1 != 0;) *p2++ = *p1++;
		*p2 = 0;
	}
} 

int str2ip(char *buf, u8 *ip)
{	// convert an ip:port string into a binary values
	int	i;
	u16	_ip[4]; 
	

	memset(_ip, 0, sizeof(_ip));

	strtrim((u8*)buf, ' ');
   
	i = sscanf(buf, "%u.%u.%u.%u", (u32*)&_ip[0], (u32*)&_ip[1], (u32*)&_ip[2], (u32*)&_ip[3]);

	*(u8*)(ip + 0) = (u8)_ip[0];
	*(u8*)(ip + 1) = (u8)_ip[1];
	*(u8*)(ip + 2) = (u8)_ip[2];
	*(u8*)(ip + 3) = (u8)_ip[3];

	return i;
}



int IP_Str(char *buf, u32 IP)
{
	T_IP_Addr	ip;
    
	if (!buf) return 0;

	ip.ip32 = IP;
    
	return sprintf(buf, "%u.%u.%u.%u", ip.ip8[0], ip.ip8[1], ip.ip8[2], ip.ip8[3]);
}

u16 AsciiToGb(u8 *dec,u8 InstrLen,u8 *scr)
{
u16 i=0,j=0,m=0;
u16 Info_len=0;


for(i=0,j=0;i<InstrLen;i++,j++) 
	{
	m=scr[i];
	if((m>=0x30)&&(m<=0x39))
		{
		memcpy(&dec[j],&arr_A3B0[(m-'0')*2],2);
		j++;
		}
	else if((m>=0x41)&&(m<=0x4f))
		{
		memcpy(&dec[j],&arr_A3C0[(m-0x41+1)*2],2);
		j++;
		}
	else if((m>=0x50)&&(m<=0x5a))
		{
		memcpy(&dec[j],&arr_A3D0[(m-0x50)*2],2) ;
		j++;
		}
	else if((m>=0x61)&&(m<=0x6f))
		{
		memcpy(&dec[j],&arr_A3E0[(m-0x61+1)*2],2) ;
		j++;
		}
	else if((m>=0x70)&&(m<=0x7a))
		{
		memcpy(&dec[j],&arr_A3F0[(m-0x70)*2],2)  ;
		j++;
		}
	else
		{
		dec[j]=m;
		}	
	}
Info_len=j;
return Info_len;
}


