nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	  }
	// else
	 //	rt_kprintf("\r\n RTC 配置校验 OK \r\n");
	 
 }
 //------------------------------------------------ 	
 if(GPRMC.status=='A')     //  记录定位时间
{
  Time2BCD(A_time);  
  //------- Debug 存储 每秒的经纬度  || 实际应该是 存储每分钟的位置  -----   
  //  内容持续55秒每秒更新，这寄存器中记录的是在每分钟内最后一包定位的经纬度 ,预留5秒用于存储上一小时的位置 
  if(sec<55)
  	{
      memcpy(Posit[min].latitude_BgEnd,Gps_Gprs.Latitude,4); //北纬
      memcpy(Posit[min].longitude_BgEnd,Gps_Gprs.Longitude,4); //经度	  
      Posit[min].longitude_BgEnd[0]|=0x80;//  东经
  	}
  if((min==59)&&(sec==55))
    { // 每个小时的位置信息               
       NandsaveFlg.MintPosit_SaveFlag=1; 
	}  
 }   
  //---- 存储当前的起始里程  跨天时------------
   if((hour==0)&&(min==0)&&(sec==3))   // 存储3次确保存储成功 
  	{ 
  	     //replace
	     // JT808Conf_struct.DayStartDistance_32=JT808Conf_struct.Distance_m_u32;
         // Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
         // by
		  DF_Write_RecordAdd(Distance_m_u32,DayStartDistance_32,TYPE_DayDistancAdd);
		  JT808Conf_struct.DayStartDistance_32=DayStartDistance_32;
		  JT808Conf_struct.Distance_m_u32=Distance_m_u32;		  
       } 
 
 //-------------------------------------------------
      //---------  天地通协议  -------
                       
						//if(systemTick_TriggerGPS==0)
 {
   Temp_Gps_Gprs.Date[0] = year;
   Temp_Gps_Gprs.Date[1] = mon;
   Temp_Gps_Gprs.Date[2] = day;   						
  }

  
 //-------------- 计算算平均速度 ----------------
 AvrgSpd_MintProcess(hour,min,sec); 
}


//---------  GGA --------------------------
void HDop_pro(u8 *tmpinfo)
{ 
 float dop;
 
  dop=atof((char *)tmpinfo);				        
  HDOP_value=dop;		 //  Hdop 数值

}

void  GPS_Delta_DurPro(void)    //告GPS 触发上报处理函数
{
    

 //    1.    定时上报相关
  if((1==JT808Conf_struct.SD_MODE.DUR_TOTALMODE)&&(Year_illigel==0))   // 定时上报模式
  {
	 	//----- 上一包数据记录的时间
		fomer_time_seconds = ( u32 ) ( BakTime[0] * 60 * 60 ) + ( u32 ) ( BakTime[1] * 60 ) + ( u32 ) BakTime[2];  
		
		//-----  当前数据记录的时间
		tmp_time_secnonds = ( u32 ) ( CurrentTime[0] * 60 * 60 ) + ( u32 ) ( CurrentTime[1] * 60 ) + ( u32 )  CurrentTime[2];
		
		//一天86400秒
		
		if ( tmp_time_secnonds > fomer_time_seconds )
		{
				delta_time_seconds = tmp_time_secnonds - fomer_time_seconds;
				//systemTickGPS_Clear();
		}
		else if(tmp_time_secnonds < fomer_time_seconds)
		{
				delta_time_seconds = 86400 - fomer_time_seconds + tmp_time_secnonds;
				//systemTickGPS_Clear();
		}
		else 
		 {
			 // systemTickGPS_Set();  
			  UDP_dataPacket_flag=0X03; 
			  StatusReg_GPS_V();
		 }	
		
		if((SleepState==1)&&(delta_time_seconds==(Current_SD_Duration-5)))  //  --  休眠时 先发鉴权
		   {
			  SleepConfigFlag=1;  //发送前5 发送一包鉴权
		   }            
		
		if((delta_time_seconds >= Current_SD_Duration))//limitSend_idle
		  {			  
			 if(Current_SD_Duration<=CURREN_LIM_Dur)   // 若发送间隔小于 10  则上报即时信息 
			  {     
			        Current_State=1;   //   使能发送标志位
				     PositionSD_Enable();
                     Current_UDP_sd=1;   // 使能发送操作执行
			  }
			 else
			 	 Current_State=0; 

			 
			 if (BD_ISP.ISP_running==0)
			    PositionSD_Enable();  
			 
			  memcpy(BakTime,CurrentTime,3); // update   
		  }
  	}  
  
    //------------------------------ do this every  second-----------------------------------------    
	memcpy((char*)&Gps_Gprs,(char*)&Temp_Gps_Gprs,sizeof(Temp_Gps_Gprs));     






  //  2.  判断行驶状态
     if((Speed_gps>100) || (Speed_cacu>100))
     {
            VDR_TrigStatus.Run_baseon_spd_10s_couter++;
			if(VDR_TrigStatus.Run_baseon_spd_10s_couter>20)  //  速度大于10km/h  超过 10s   这里判20s
				{
				   //  做循环判断处理
				   if(VDR_TrigStatus.Run_baseon_spd_10s_couter>65530)
				   	  VDR_TrigStatus.Run_baseon_spd_10s_couter=21;

                   //    11 H   连续驾驶开始时间   和起始位置     从60s 开始算驾驶起始
                    VDR_product_11H_Start();
                    
				   
				    VDR_TrigStatus.Running_state_enable=1;  //  处于行驶状态

				}
     }
     if((Speed_gps<100)&&(Speed_cacu<100))
     {
         //         11 H     相关
         VDR_product_11H_End();
	 
		 VDR_TrigStatus.Run_baseon_spd_10s_couter=0;	 	 
		 VDR_TrigStatus.Running_state_enable=0;  //  处于停止状态    
	 }




	 

   // 3.  行驶记录相关数据产生 触发,  且定位的情况下   
    VDR_product_08H_09H_10H();




   
   //4.   电子围栏 判断  ----------
  /*  if((Temp_Gps_Gprs.Time[2]%20)==0) //   认证时不检测圆形电子围栏
    {
        CycleRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
		//rt_kprintf("\r\n --- 判断圆形电子围栏");
    }	*/
    // if((Temp_Gps_Gprs.Time[2]==5)||(Temp_Gps_Gprs.Time[2]==25)||(Temp_Gps_Gprs.Time[2]==45)) //  
    if(Temp_Gps_Gprs.Time[2]%2==0)//    认证时要求2 秒
   {
        RectangleRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude);
		//rt_kprintf("\r\n -----判断矩形电子围栏"); 
    }
      if((Temp_Gps_Gprs.Time[2]%5)==0) //    
    {
          // printf("\r\n --- 判断圆形电子围栏");
          // RouteRail_Judge(Temp_Gps_Gprs.Latitude,Temp_Gps_Gprs.Longitude); 
          ;
    }
	//rt_kprintf("\r\n Delta_seconds %d \r\n",delta_time_seconds);    
  //----------------------------------------------------------------------------------------	
}

//---------------------------------------------------------------------------------------------------
void K_AdjustUseGPS(u32  sp_DISP)  // 通过GPS 校准  K 值  (车辆行驶1KM 的脉冲数目)  0.1 km/h 进入
{
      
  u32 Reg_distance=0;
  u32 Reg_plusNum=0;
  u16 i=0;
  
  if(JT808Conf_struct.DF_K_adjustState)   // 只有没校准时才有效
			return;
		
   Speed_Rec=(u8)(sp_DISP/10);	// GPS速度    单位:km/h
   // -------	要求速度在60到65km/h  -------------
   if(((Speed_Rec>=Speed_area)&&(Speed_Rec<=(Speed_area+8)))||((Speed_Rec>=40)&&(Speed_Rec<=(40+8)))||((Speed_Rec>=70)&&(Speed_Rec<=(70+8))))   // Speed_area=60   
 // if(Speed_Rec>=Speed_area) 
//   if((Speed_Rec>=40)&&(Speed_Rec<=48))   // Speed_area=60    
   {
	   Spd_adjust_counter++;    
	   if(Spd_adjust_counter>K_adjust_Duration)  //持续在速度在60~65下认为已经是匀速了
	   {
		   // 用获取到的匀速GPS速度作为基准，和根据传感器计算出来的速度，做K值得校准
		   Reg_distance=0;	// clear
		   Reg_plusNum=0;	// clear 
		   for(i=2;i<K_adjust_Duration;i++)  //剔除前2组数据(前两组数据不是很准确，因为什么时刻开始不确定)
		   {
			  Reg_distance+=Former_gpsSpd[i];  // 除以3.6km/h 表示该秒内走了多少米
			  Reg_plusNum+=Former_DeltaPlus[i]; 						   
		   }
           /*
                做一个判断  ， 如果速度传感器不管用， 那么返回， 
             */
           if(Reg_plusNum<20)
		   	 {
		   	   Spd_adjust_counter=0; 
			   rt_kprintf("\r\n    速度传感器 没有脉冲!\r\n");
		   	   return; 
           	 }  		   	
		   //===================================================================
		   // 转换成根据GPS速度计算行驶了多少米，(总距离) 先求和在除以3.6 ，为了计算方便 先x10  再除以36 
		   Reg_distance=(u32)(Reg_distance*10/36); // 转换成根据GPS速度计算行驶了多少米，(总距离)
		   // (Reg_plusNum/Reg_distance) 表示用脉冲总数除以距离(米)= 每米产生多少个脉冲 ，因为K值是1000米脉冲数，所以应该乘以1000
		   JT808Conf_struct.Vech_Character_Value=1000*Reg_plusNum/Reg_distance;
		   //-------  存储新的特征系数 -------------------------------- 						
		   JT808Conf_struct.DF_K_adjustState=1;					// clear  Flag
		   ModuleStatus|=Status_Pcheck;
		   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		   
		  Spd_adjust_counter=0; // clear  counter
	   }
	   else
	   {   //-------- 记录规定时间内的脉冲数和GPS速度----------
		   Former_gpsSpd[Spd_adjust_counter]=Speed_Rec; 
		   Former_DeltaPlus[Spd_adjust_counter]=Delta_1s_Plus;
	   }
  
