nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
   }  
   else
	  Spd_adjust_counter=0;  // 只要速度超出预设范围 计数器清0
}


void  Delta_Speed_judge(void)
{
    /*
         Note: 在从传感器速度，且速度被校准的情况下，在GPS 速度大于40Km/h
                 的时候，判断速度传感器和实际速度的差值，如果速度差值连续续大于12 km/h
                ，且持续一段时间，说明以前脉冲系数已经不准确， 那么启动重新校准。
                     
       */
   if((JT808Conf_struct.DF_K_adjustState)&&(JT808Conf_struct.Speed_GetType)&&(Speed_gps>=400)&&(UDP_dataPacket_flag==0x02 ))
  {
     // rt_kprintf("\r\n  delta  check \r\n");
     if(abs(Speed_gps-Speed_cacu)>120)  // 速度相差12Km/h    这里的单位是0.1km/h
     {  
          Spd_Deltacheck_counter++;
		  if(Spd_Deltacheck_counter>30)  //  持续30s
		  {
		     Spd_Deltacheck_counter=0; // clear
             JT808Conf_struct.DF_K_adjustState=0;// disable              
			// rt_kprintf("\r\n  Re_adust!\r\n");
		  }
     }
	 else
	 	Spd_Deltacheck_counter=0; // clear   

   }

}
//==================================================================================================
// 第二部分 :   以下是外部传感器状态监测
//==================================================================================================
/*    
     -----------------------------
     2.1   和协议相关的功能函数
     ----------------------------- 
*/


/*    
     -----------------------------
    2.4  不同协议状态寄存器变化
     ----------------------------- 
*/

void StatusReg_WARN_Enable(void)
{
  //     紧急报警状态下 寄存器的变化
    Warn_Status[3] |= 0x01;//BIT( 0 );		   
}

void StatusReg_WARN_Clear(void)
{
  //     清除报警寄存器  
    Warn_Status[3] &= ~0x01;//BIT( 0 );  	  	
}

void StatusReg_ACC_ON(void)
{  //    ACC 开
  Car_Status[3]|=0x01; //  Bit(0)     Set  1  表示 ACC开

}

void StatusReg_ACC_OFF(void)
{  //    ACC 关  
  
  Car_Status[3]&=~0x01; //  Bit(0)     Set  01  表示 ACC关
}

void StatusReg_POWER_CUT(void)
{  //  主电源断开
   Warn_Status[2]	|= 0x01;//BIT( 0 );
   ModuleStatus|=Status_Battery;
}

void StatusReg_POWER_NORMAL(void)
{  // 主电源正常
   Warn_Status[2] &= ~0x01;//BIT( 0 );     
   ModuleStatus&=~Status_Battery;
}

void StatusReg_GPS_A(void)
{     // GPS 定位 
   if(GPS_getfirst==0)
   {	    
	 #ifdef LCD_5inch
                   DwinLCD.Type=LCD_SETTIME;       
	  #endif
   }	  
 GPS_getfirst=1;
 Car_Status[3]|=0x02;   //Bit(1)
 ModuleStatus |= Status_GPS;	
}

void StatusReg_GPS_V(void)
{    //  GPS 不定位  
  Car_Status[3]&=~0x02;   //Bit(1)
  ModuleStatus &= ~Status_GPS;
}
	
void StatusReg_SPD_WARN(void)
{    //  超速报警
   Warn_Status[3] |= 0x02;//BIT( 1 );
}

void StatusReg_SPD_NORMAL(void)
{    //  速度正常
  Warn_Status[3] &=~ 0x02;//BIT( 1 );
}

void StatusReg_Relay_Cut(void)
{  // 断油断电状态 

}

 void StatusReg_Relay_Normal(void)
{ //  断油电状态正常
 
}


void StatusReg_Default(void)
{    //   状态寄存器还原默认设置
  
   Warn_Status[0]=0x00; //HH
   Warn_Status[1]=0x00; //HL  
   Warn_Status[2]=0x00; //LH 
   Warn_Status[3]=0x00; //LL	      
}

//==================================================================================================
// 第三部分 :   以下是GPRS无线传输相关协议
//==================================================================================================
void  Save_GPS(void)     
{
   u16 counter_mainguffer,i;
   u8  lati_reg[4];//,regstatus;
   
		  if (PositionSD_Status())	
		  {
		         if(DF_LOCK==enable)    // 清除文件区域时 ，禁止操作DF
				 	return ;
				 if(Login_Menu_Flag!=1)  // 没有被设置前不存储相关位置信息，没有意义
				 	return;  
		     //-------------------------------------------------------	 
		     //1.   时间超前判断
                              //if(Time_FastJudge()==false)    
							//return ;		 
				  //----------------------- Save GPS --------------------------------------
				  memset(GPSsaveBuf,0,40);   
				  GPSsaveBuf_Wr=0;				  
				   //------------------------------- Stuff ----------------------------------------
					counter_mainguffer = GPSsaveBuf_Wr;
				   // 1. 告警状态   4 Bytes
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )Warn_Status,4 );   
				   GPSsaveBuf_Wr += 4;  
                   // 2. 车辆状态   4 Bytes
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )Car_Status,4 );   
				   GPSsaveBuf_Wr += 4; 
				   // 3.   纬度     4 Bytes
				   memcpy(lati_reg,Gps_Gprs.Latitude,4);
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
				   GPSsaveBuf_Wr += 4;
				   // 4.   经度     4 Bytes
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	 //经度    东经  Bit 7->0	西经 Bit 7 -> 1
				   GPSsaveBuf_Wr += 4;
				   // 5.  高度	  2 Bytes    m
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(GPS_Hight>>8);	// High 			   
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)GPS_Hight;  // Low  
				   // 6.  速度	  2 Bytes     0.1Km/h
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(Speed_gps>>8);	// High 			   
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)Speed_gps;  // Low 
				   // 7.  方向	  2 Bytes	    1度 				   
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(GPS_direction>>8);	//High
				   GPSsaveBuf[GPSsaveBuf_Wr++]=GPS_direction; // Low				   
				   // 8.  日期时间	  6 Bytes 
				    GPSsaveBuf[GPSsaveBuf_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);  	   	
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);    
                   //------------------------------------------------------------------ 
                   //   注:   因为长度有限所以存储时只存储传感器速度，不填写 类型和长度 
                  //----------- 附加信息  ------------
				    //  附加信息 1  -----------------------------    
					//	附加信息 ID
					//Original_info[Original_info_Wr++]=0x03; // 行驶记录仪的速度
					//	附加信息长度
					//Original_info[Original_info_Wr++]=2;
					//	类型
					//GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)(Speed_cacu>>8);  
					//GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)(Speed_cacu);	           
				   //--------------------------------------------------------------------
				if(strncmp(( char * )GPSsaveBuf + GPSsaveBuf_Wr-3,(const char*)Sdgps_Time,3)==0)						
					{
					/*if(strncmp((const char*)GPSsaveBuf + GPSsaveBuf_Wr-3,(const char*)Sdgps_Time,3)==0)
						{
						PositionSD_Disable();
						rt_kprintf("\r\n  -->不存储上报时间相同的车\r\n");
						return;
						}
					else*/
						//{    //-------- 用RTC 时钟 -----     
				        time_now=Get_RTC();  
						
					    if((time_now.year<100)&&(time_now.month<12)&&(time_now.day<31)&&(time_now.hour<24)&&(time_now.min<60)&&(time_now.sec<60))
					    {
						   Time2BCD(GPSsaveBuf + GPSsaveBuf_Wr-6);  
						   rt_kprintf("\r\n    启用RTC时间了! \r\n"); 
						  } 
					}
					memcpy(Sdgps_Time,GPSsaveBuf + GPSsaveBuf_Wr-3,3); //更新最新一次存储时间

                   //-------------  Caculate  FCS  -----------------------------------
					FCS_GPS_UDP=0;  
					for ( i = counter_mainguffer; i < 30; i++ )  
					{
							FCS_GPS_UDP ^= *( GPSsaveBuf + i ); 
					}			   //求上边数据的异或和
					GPSsaveBuf[30] = FCS_GPS_UDP;  	  	
			     //-------------------------------- Save  ------------------------------------------
			      if(Api_cycle_write(GPSsaveBuf,31))
			      { 
					  if(DispContent) 	
					       rt_kprintf("\r\n    GPS Save succed\r\n");
			      	}
				 else
			       {
				  	  if(DispContent) 
				     	         rt_kprintf("\r\n GPS save fail\r\n"); 
				 }
                 //---------------------------------------------------------------------------------
				  if(PositionSD_Status())
				         PositionSD_Disable();
				 if(SleepState==1)	   
				 {	 
					 rt_kprintf("\r\n休眠时存储时间 %d-%d-%d %02d:%02d:%02d\r\n", time_now.year+2000, time_now.month, time_now.day, \
					 time_now.hour, time_now.min, time_now.sec);
				 }
				  //-----------------------------------------------------
		  }
   

