nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		   memset(reg_str,0,sizeof(reg_str));	  //  填写域名
		   memcpy(reg_str,"jt1.gghypt.net",strlen((char const*)"jt1.gghypt.net"));
		 // memcpy(reg_str,"fde.0132456.net",strlen((char const*)"jt1.gghypt.net"));
		   Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
			  memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));	// 参数值	 
		   Original_info_Wr+=strlen((const char*)reg_str);
	       break;
	   case 0x0014:	   
					 //   A.12	 BAK  APN 字符串
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x14;
			Original_info[Original_info_Wr++]=strlen((const char*)"UNINET"); // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr,"UNINET",6); // 参数值
			Original_info_Wr+=6;
			break;
			
	  case 0x0015:
				   //	A.13 BAK APN 用户名
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x15;
			Original_info[Original_info_Wr++]=4; // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
			Original_info_Wr+=4;
			break;
	  case 0x0016:
				   //	A.14  BAK  APN 密码
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x16;
			Original_info[Original_info_Wr++]=4; // 参数长度
			memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
			Original_info_Wr+=4;
	        break;
     case 0x0017:			
						//	A.15   备用IP		 
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x17;    
													 // 参数长度				
		  memset(reg_str,0,sizeof(reg_str));	 //  填写域名
		  memcpy(reg_str,DomainNameStr_aux,strlen((char const*)DomainNameStr_aux));
		 // memcpy(reg_str,"fde.0132456.net",strlen((char const*)"jt1.gghypt.net"));
		   Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
			  memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));	// 参数值	 
		   Original_info_Wr+=strlen((const char*)reg_str);
	      break;
			
     case 0x0018:			  
	
				 //  A.16  主服务TCP端口
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x18;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=(7008>>8); 
			Original_info[Original_info_Wr++]=(u8)(7008); 
			break;
     case 0x0019:			
															
				//	A.17  备用服务TCP端口
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x19;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=(7008>>8); 
			Original_info[Original_info_Wr++]=(u8)(7008); 
			break;

	case 0x001a:		
	
				 //  A.18  IC卡认证 主服务器地址
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1A;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	
			//memcpy(( char * ) Original_info+ Original_info_Wr,"202.96.42.113",13);
			//Original_info_Wr+=13;
			 break;
	case 0x001b:
							//	A.19  IC卡认证 主服务器TCP
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1B;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00;  
			break;
	case 0x001c:
								//	A.20  IC卡认证 主服务器UDP
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1C;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00;  
			break;
	case 0x001d:		
	
					   //  A.21  IC卡认证  备用服务器地址
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes  
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x1D;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	
			//memcpy(( char * ) Original_info+ Original_info_Wr,"202.96.42.114",13);
			//Original_info_Wr+=13;
	         break;
	case 0x0020:		
	
								 //  A.22  位置汇报策略
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x20;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=JT808Conf_struct.SD_MODE.Send_strategy; 
			break;
	case 0x0021:
															   //  A.23  位置汇报方案
		    Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		    Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x21;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=JT808Conf_struct.PositionSd_Stratage; 
			break;
	case 0x0022:
												  //  A.24 驾驶员未登录 汇报间隔
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x22;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=30; 
			break;
	case 0x0027:		
	
