nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
													   //  A.25  休眠时汇报间隔
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x27;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			JT808Conf_struct.DURATION.Sleep_Dur=300;
			Original_info[Original_info_Wr++]=(300>>24);   // 参数值  
			Original_info[Original_info_Wr++]=(300>>16);
			Original_info[Original_info_Wr++]=(300>>8);
			Original_info[Original_info_Wr++]=(u8)(300);	
			break;
	case 0x0028:		 
											//	A.26 紧急报警时 
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x28;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;   // 参数值
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=0x00; 
			Original_info[Original_info_Wr++]=10; 
			break;		 
	case 0x0029:
			 //   A.27	  缺省时间上报间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x29;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>24);	 // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur);	   
			break;
	case 0x002c:
				 //   A.28	  缺省距离上报间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2c;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			//JT808Conf_struct.DISTANCE.Defalut_DistDelta=500;
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta);	 
	        break;
	case 0x002d:			 
					 //   A.29	  驾驶员未登录间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2d;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta);	 
			break;
	case 0x002e:
	
					 //   A.30	休眠时汇报距离间隔
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2e;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>16);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta>>8);
			Original_info[Original_info_Wr++]=(JT808Conf_struct.DISTANCE.Defalut_DistDelta);	 
			break;
	case 0x002f:
						 //   A.31	  紧急报警时 定距离
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x2f;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(200>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(200>>16);
			Original_info[Original_info_Wr++]=(200>>8);
			Original_info[Original_info_Wr++]=(200);	 
			break;
	case 0x0030:
						  //   A.32 	拐点补传角度
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x30;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(45>>24);   // 参数值 
			Original_info[Original_info_Wr++]=(45>>16);
			Original_info[Original_info_Wr++]=(45>>8);
			Original_info[Original_info_Wr++]=(45); 	
	       break;
	case 0x0031:
				//	 A.33	  电子围栏半径
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x31;
			Original_info[Original_info_Wr++]=2  ; // 参数长度
		  // 参数值 
			Original_info[Original_info_Wr++]=(500>>8);
			Original_info[Original_info_Wr++]=(u8)(500);	 
	        break;
	case 0x0040:
				 //   A.34	  设置求助号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x40;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
			break;
	case 0x0041:
					//	 A.35	 复位电话号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x41;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
			break;
	
	case 0x0042:
				 //   A.36	  恢复出厂设置电话号码
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x42;
			Original_info[Original_info_Wr++]=0  ; // 参数长度
	         break;
	case 0x0043:
					   //  A37	监控平台SMS 短息号码
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x43;
			Original_info[Original_info_Wr++]=5  ; // 参数长度

	       
