nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			 //  A.52  当天累计驾驶门限
				 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
				 Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x58;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec>>24);	 // 参数值
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec>>16);	
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec>>8);
			Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec);
			break;
	case 0x0059:
	
			 //   A.53	 最小休息时间
			 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x59;
			 Original_info[Original_info_Wr++]=4  ; // 参数长度
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>24);	 // 参数值
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>16);	
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>8);
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec);		
			 break;
	case 0x005A:
	
						 //   A.54	最长停车时间
			 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x5A;
			 Original_info[Original_info_Wr++]=4  ; // 参数长度
			 TiredConf_struct.TiredDoor.Door_MaxParkingSec=3600;
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec>>24);  // 参数值
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec>>16); 
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec>>8);
			 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec); 	
			 break;
	case 0x005B:
	
						  //   A.55  超速报警预警差值
			 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x5B;
			 Original_info[Original_info_Wr++]=2  ; // 参数长度
			// 参数值
			 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_MaxSpd_preWarnValue>>8); // 100
			 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_MaxSpd_preWarnValue);	
			 break;
	case 0x005C:
	
	
						   //	A.56  疲劳驾驶预警差值
			 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x5C;
			 Original_info[Original_info_Wr++]=2  ; // 参数长度
			// 参数值
			 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_TiredDrv_preWarnValue>>8);
			 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_TiredDrv_preWarnValue);		
			 break;
	case 0x005D:
	
						//	 A.57  碰撞报警参数设置
			 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x5D;
			 Original_info[Original_info_Wr++]=2  ; // 参数长度
			// 参数值
			 Original_info[Original_info_Wr++]=(17924>>8);
			 Original_info[Original_info_Wr++]=(17924); 	
			 break;
	case 0x005E:	
						//	 A.58  侧翻报警参数设置
			 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x00;
			 Original_info[Original_info_Wr++]=0x5E;
			 Original_info[Original_info_Wr++]=2  ; // 参数长度
			// 参数值
			 Original_info[Original_info_Wr++]=(30>>8);
			 Original_info[Original_info_Wr++]=(30);	
			 break;
	case 0x0064:	
	 //   A.59	 定时拍照控制
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x64;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			break;
	case 0x0065:
	
	 //   A.60	定距拍照控制
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x65;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			break;
	case 0x0070:
	
	 //   A.61 图像、视频质量
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x70;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x05;
			break;
	case 0x0071:
	
	 //   A.62	亮度
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x71;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=127;
			break;
	case 0x0072:
	
	 //   A.63	 对比度
				  Original_info[Original_info_Wr++]=0x00;	// 参数ID 4Bytes
				  Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x72;
			Original_info[Original_info_Wr++]=4  ; // 参数长度
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=0x00;
			Original_info[Original_info_Wr++]=64;
			break;
	case 0x0073:
	
	
