nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

//-----------------------------------------------------------------------
u8  Sub_stuff_AppointedPram_0106(void)
{    // 7E81060005013901234505004F0100000021B77E
     u16  i=0,len=0;
	
  
     //  1. Head     
      if(!Protocol_Head(MSG_0x0104,Packet_Normal)) 
 	  return false; // 终端参数上传

           //   float ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID; 
     //   参数个数	
	    Original_info[Original_info_Wr++]=Setting_Qry.Num_pram;

      for(i=0;i<Setting_Qry.Num_pram;i++)
	   {    
	   	    len=Paramater_0106_stuff(Setting_Qry.List_pram[i],Original_info);   //    填写信息	   	    
	   	    rt_kprintf("\r\n SendID:  %X  i=%d ",Setting_Qry.List_pram[i],i);     
            //  Original_info_Wr+=len;
       }
       
	// Paramater_0106_stuff(CMD_U32ID,Original_info);	//	  填写信息
	// rt_kprintf("\r\n SendID:  %4X ",CMD_U32ID);	   
	    
		  //  3. Send 
  Protocol_End(Packet_Normal ,0);
  if(DispContent)
	rt_kprintf("\r\n	发送单个参数查询信息! \r\n");    

  return true;
	 
}
u8  Stuff_SettingPram_0104H(void)
{
   u8  reg_str[30];
   u32  reg_u32=0;
  
  //  1. Head     
  if(!Protocol_Head(MSG_0x0104,Packet_Normal)) 
 	  return false; // 终端参数上传

  //  2. content 
       //   float ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID;
	   //   参数个数	
	    Original_info[Original_info_Wr++]=81;
	   //   参数列表
          //  A.1 心跳包间隔   
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
             Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x01;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur>>24);   // 参数值 
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur>>16);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur>>8);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Heart_Dur);     
         //  A.2 TCP  消息应答间隔   
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
             Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x02;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur>>24);   // 参数值 
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur>>16);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur>>8);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ACK_Dur);     

	       //  A.3 TCP  消息重传次数   
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
             Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x03;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num>>24);   // 参数值 
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num>>16);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num>>8);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.TCP_ReSD_Num);     	

              //  A.4   UDP 应答超时
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x04;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(5>>24);   // 参数值 
		Original_info[Original_info_Wr++]=(5>>16);
		Original_info[Original_info_Wr++]=(5>>8);
		Original_info[Original_info_Wr++]=(5);     	

           
              //  A.5   UDP 重传次数
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x05;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num>>24);   // 参数值 
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num>>16);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num>>8);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.UDP_ReSD_Num);     	

               
              //  A.6   SMS消息应答超时时间
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x06;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0;   // 参数值 
		Original_info[Original_info_Wr++]=0;
		Original_info[Original_info_Wr++]=0;
		Original_info[Original_info_Wr++]=5;     	



              //  A.7   SMS 消息重传次数
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x07;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0;   // 参数值 
		Original_info[Original_info_Wr++]=0;
		Original_info[Original_info_Wr++]=0;
		Original_info[Original_info_Wr++]=3;     	

             //   A.8  APN 字符串
             Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
             Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x10;
		Original_info[Original_info_Wr++]=strlen((const char*)APN_String); // 参数长度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )APN_String,strlen((const char*)APN_String)); // 参数值
		Original_info_Wr+=strlen((const char*)APN_String);

               //   A.9  APN 用户名
             Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
             Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x11;
		Original_info[Original_info_Wr++]=4; // 参数长度
		memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
		Original_info_Wr+=4;

               //   A.10  APN 密码
             Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
             Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x12;
		Original_info[Original_info_Wr++]=4; // 参数长度
		memcpy( ( char * ) Original_info+ Original_info_Wr, "user",4); // 参数值
		Original_info_Wr+=4;

             //   A.11   主服务器IP    
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x13;    
		                                         // 参数长度		

	   memset(reg_str,0,sizeof(reg_str));     //  填写域名
	   memcpy(reg_str,"jt1.gghypt.net",strlen((char const*)"jt1.gghypt.net"));
	 // memcpy(reg_str,"fde.0132456.net",strlen((char const*)"jt1.gghypt.net"));
	   Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
          memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));  // 参数值	 
	   Original_info_Wr+=strlen((const char*)reg_str);

