nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		 //  A.52  当天累计驾驶门限
             Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
             Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x58;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec>>24);   // 参数值
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec>>16);  
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec>>8);
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DayAccumlateDrvSec);



		 //   A.53   最小休息时间
		 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x59;
		 Original_info[Original_info_Wr++]=4  ; // 参数长度
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>24);	 // 参数值
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>16);	
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>8);
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec);         

             		 //   A.54  最长停车时间
		 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x5A;
		 Original_info[Original_info_Wr++]=4  ; // 参数长度
		 TiredConf_struct.TiredDoor.Door_MaxParkingSec=3600;
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec>>24);	 // 参数值
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec>>16);	
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec>>8);
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MaxParkingSec);         

                      //   A.55  超速报警预警差值
		 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x5B;
		 Original_info[Original_info_Wr++]=2  ; // 参数长度
		// 参数值
 		 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_MaxSpd_preWarnValue>>8); // 100
		 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_MaxSpd_preWarnValue);          


                       //   A.56  疲劳驾驶预警差值
		 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x5C;
		 Original_info[Original_info_Wr++]=2  ; // 参数长度
		// 参数值
 		 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_TiredDrv_preWarnValue>>8);
		 Original_info[Original_info_Wr++]=(JT808Conf_struct.BD_TiredDrv_preWarnValue);          



                    //   A.57  碰撞报警参数设置
		 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x5D;
		 Original_info[Original_info_Wr++]=2  ; // 参数长度
		// 参数值
 		 Original_info[Original_info_Wr++]=(17924>>8);
		 Original_info[Original_info_Wr++]=(17924);          



                    //   A.58  侧翻报警参数设置
		 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x5E;
		 Original_info[Original_info_Wr++]=2  ; // 参数长度
		// 参数值
 		 Original_info[Original_info_Wr++]=(30>>8);
		 Original_info[Original_info_Wr++]=(30);          


 //   A.59   定时拍照控制
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x80;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		reg_u32=JT808Conf_struct.Distance_m_u32/100;
		Original_info[Original_info_Wr++]=(reg_u32>>24);	// 参数值
		Original_info[Original_info_Wr++]=(reg_u32>>16);   
		Original_info[Original_info_Wr++]=(reg_u32>>8);
		Original_info[Original_info_Wr++]=(reg_u32);		 

 //   A.60  定距拍照控制
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x65;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;

 //   A.61 图像、视频质量
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x70;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x05;

 //   A.62  亮度
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x71;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=127;

 //   A.63   对比度
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x72;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=64;


 //   A.64  饱和度
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x73;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=64;


 //   A.65  色度
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x74;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=127;

 //   A.66   车辆里程表读数
	   Original_info[Original_info_Wr++]=0x00;	 // 参数ID 4Bytes
	   Original_info[Original_info_Wr++]=0x00;
 Original_info[Original_info_Wr++]=0x00;
 Original_info[Original_info_Wr++]=0x64;
 Original_info[Original_info_Wr++]=4  ; // 参数长度
 reg_u32=JT808Conf_struct.Distance_m_u32/100;
 Original_info[Original_info_Wr++]=(reg_u32>>24);	 // 参数值
 Original_info[Original_info_Wr++]=(reg_u32>>16);	
 Original_info[Original_info_Wr++]=(reg_u32>>8);
 Original_info[Original_info_Wr++]=(reg_u32);		  



 //   A.67   车辆所在省域
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x81;
		Original_info[Original_info_Wr++]=2  ; // 参数长度
             Original_info[Original_info_Wr++]=(u8)(10>>8);
              Original_info[Original_info_Wr++]=(u8)10;

//   A.68   车辆所在市域
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x82;
		Original_info[Original_info_Wr++]=2  ; // 参数长?
	       //  county  ID
              Original_info[Original_info_Wr++]=(u8)(1010>>8);
              Original_info[Original_info_Wr++]=(u8)1010;   

													
