nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	   //   A.69   车牌号
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x83;
		Original_info[Original_info_Wr++]=strlen((const char*)Vechicle_Info.Vech_Num); // 参数长度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Vechicle_Info.Vech_Num,strlen((const char*)Vechicle_Info.Vech_Num) ); // 参数值
		Original_info_Wr+=strlen((const char*)Vechicle_Info.Vech_Num); 
        
//   A.70   车辆颜色
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x84;
		Original_info[Original_info_Wr++]=1  ; // 参数长?
		Original_info[Original_info_Wr++]=Vechicle_Info.Dev_Color;

//   A.71   GNSS  模式设置
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x90;
		Original_info[Original_info_Wr++]=1  ; // 参数长?

	   if( GpsStatus.Position_Moule_Status==1)
		     Original_info[Original_info_Wr++]=2;
	   
	   if( GpsStatus.Position_Moule_Status==2)
		  Original_info[Original_info_Wr++]=1;   
	   
	   if( GpsStatus.Position_Moule_Status==3) 
		  Original_info[Original_info_Wr++]=3;     

//   A.72   GNSS 波特率设置
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x91;
		Original_info[Original_info_Wr++]=1  ; // 参数长?
		Original_info[Original_info_Wr++]=2;

//   A.73   GNSS nmea  输出更新频率
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x92;
		Original_info[Original_info_Wr++]=1  ; // 参数长?
		Original_info[Original_info_Wr++]=1;

 //   A74   车辆里程表读数
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x93;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=1;

//   A.75  GNSS定位上传方式
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x94;
		Original_info[Original_info_Wr++]=1  ; // 参数长?
		Original_info[Original_info_Wr++]=0;

 //   A76   模块详细数据上传设置
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x95;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0;

 //   A77   CAN1   采集间隔
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x01;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;

 //   A78   CAN1   上传间隔
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x01;
		Original_info[Original_info_Wr++]=0x01;
		Original_info[Original_info_Wr++]=2  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;

 //   A79    CAN2   采集间隔
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x01;
		Original_info[Original_info_Wr++]=0x02;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0;		

 //   A80  CAN2   上传间隔
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x01;
		Original_info[Original_info_Wr++]=0x03;
		Original_info[Original_info_Wr++]=2  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;



 //   A81  CAN  总线ID 单独采集设置
              Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x01;
		Original_info[Original_info_Wr++]=0x10;
		Original_info[Original_info_Wr++]=8 ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0;
              Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0;		   
  //  3. Send 
  Protocol_End(Packet_Normal ,0);
  if(DispContent)
	rt_kprintf("\r\n	发送参数查询信息! \r\n");    

  return true;
}


u8  Stuff_DeviceAttribute_BD_0107H(void)
{
  //   u16   infoLen=0;
   // 1. Head
	if(!Protocol_Head(MSG_0x0107,Packet_Normal)) 
 	  return false; 
	 // 2. content   
       Original_info[Original_info_Wr++]=(ProductAttribute._1_DevType>>8); 
	   Original_info[Original_info_Wr++]=ProductAttribute._1_DevType;
       memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)"70420",5);
       Original_info_Wr+=5;	
       memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)ProductAttribute._3_Dev_TYPENUM,20);
       Original_info_Wr+=20;
	    memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)SimID_12D+5,7);
       Original_info_Wr+=7;	
	   memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)ProductAttribute._5_Sim_ICCID,10);
       Original_info_Wr+=10;   
	   
	Original_info[Original_info_Wr++]=ProductAttribute._6_HardwareVer_Len;   
       memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)ProductAttribute._7_HardwareVer,ProductAttribute._6_HardwareVer_Len);
       Original_info_Wr+=ProductAttribute._6_HardwareVer_Len;   
	   
	//Original_info[Original_info_Wr++]=ProductAttribute._8_SoftwareVer_len;      
	//memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)ProductAttribute._9_SoftwareVer,ProductAttribute._8_SoftwareVer_len);
	//Original_info_Wr+=ProductAttribute._8_SoftwareVer_len;

