nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	Original_info[Original_info_Wr++]=ProductAttribute._10_FirmWareVer_len;      
	memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)ProductAttribute._11_FirmWare,ProductAttribute._10_FirmWareVer_len);
	Original_info_Wr+=ProductAttribute._10_FirmWareVer_len; 

	Original_info[Original_info_Wr++]=ProductAttribute._12_GNSSAttribute;
	Original_info[Original_info_Wr++]=ProductAttribute._13_ComModuleAttribute;

	 /*
	  infoLen=sizeof(ProductAttribute);
	  memcpy( ( char * ) Original_info+ Original_info_Wr,(u8*)&ProductAttribute,infoLen);
	  Original_info_Wr+=infoLen;	 
        */
	  
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	发送终端属性 \r\n");    

    return true;
}
//--------------------------------------------------------------------------
u8  Stuff_EventACK_0301H(void)      
{    
	// 1. Head
	if(!Protocol_Head(MSG_0x0301,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	   Original_info[Original_info_Wr++]=EventObj.Event_ID;// 返回事件ID
	    
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	 事件结果返回  \r\n");    
	 return true; 

}

u8  Stuff_ASKACK_0302H(void)      
{  
  
	// 1. Head
	if(!Protocol_Head(MSG_0x0302,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	   //  应答流水号
	   Original_info[Original_info_Wr++]=(ASK_Centre.ASK_floatID>>8);// 返回事件ID
	   Original_info[Original_info_Wr++]=ASK_Centre.ASK_floatID;
       Original_info[Original_info_Wr++]=ASK_Centre.ASK_answerID;	    
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	发送提问选择结果 \r\n");     
	 return true; 

}

u8  Stuff_MSGACK_0303H(void)      
{  
 
	// 1. Head
	if(!Protocol_Head(MSG_0x0303,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	   //  应答流水号
	   Original_info[Original_info_Wr++]=MSG_BroadCast_Obj.INFO_TYPE; 
	   Original_info[Original_info_Wr++]=MSG_BroadCast_Obj.INFO_PlyCancel;  //  0  取消  1 点播 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	点播取消回复  \r\n");     
	 return true;    

}


void  Recorder_init(void)
{
  Recode_Obj.Float_ID=0;     //  命令流水号
  Recode_Obj.CMD=0;     //  数据采集 
  Recode_Obj.SD_Data_Flag=0; //  发送返回数返回标志
  Recode_Obj.CountStep=0;  //  发送数据需要一步一步发送 
  Recode_Obj.timer=0;
  //--------- add on  5-4 
  Recode_Obj.Devide_Flag=0;//  需要分包上传标志位
  Recode_Obj.Total_pkt_num=0;   // 分包总包数
  Recode_Obj.Current_pkt_num=0; // 当前发送包数 从 1  开始
  Recode_Obj.fcs=0;
  Recode_Obj.Error=0;
  rt_kprintf( "\r\n 记录仪定时发送---- init"); 
}




u8  Stuff_ControlACK_0500H(void)   //   车辆控制应答
{  

 //  1. Head	
   if(!Protocol_Head(MSG_0x0500,Packet_Normal)) 
 	  return false; 
 // 2. content 
    //------------------------------- Stuff ----------------------------------------
    //   float ID                                                // 对应中心应答消息的流水号
	Original_info[Original_info_Wr++]=(u8)(Vech_Control.CMD_FloatID>>8);
	Original_info[Original_info_Wr++]=(u8)Vech_Control.CMD_FloatID;  

	// 1. 告警标志  4
	memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Warn_Status,4 );    
	Original_info_Wr += 4;
	// 2. 状态  4
	memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Car_Status,4 );   
	Original_info_Wr += 4;
	// 3.  纬度
    memcpy( ( char * ) Original_info+ Original_info_Wr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
	Original_info_Wr += 4;
	// 4.  经度
	memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Original_info_Wr += 4;
	// 5.  高程
	Original_info[Original_info_Wr++]=(u8)(GPS_Hight<<8);
	Original_info[Original_info_Wr++]=(u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Original_info[Original_info_Wr++]=(u8)(Speed_gps>>8);
	Original_info[Original_info_Wr++]=(u8)Speed_gps;   
	// 7. 方向   单位 1度
	Original_info[Original_info_Wr++]=(GPS_direction>>8);  //High 
	Original_info[Original_info_Wr++]=GPS_direction; // Low
	// 8.  日期时间	
	Original_info[Original_info_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
	Original_info[Original_info_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
	Original_info[Original_info_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
	Original_info[Original_info_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
	Original_info[Original_info_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
	Original_info[Original_info_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	 

 //  3. Send 
 Protocol_End(Packet_Normal ,0);
 if(DispContent)
   rt_kprintf("\r\n	SEND  Vech  Control  ! \r\n"); 
   	
 return true; 

}

u8  Stuff_RecoderACK_0700H_Error(void) 
{
    
	u16  SregLen=0,Swr=0;//,Gwr=0; // S:serial	G: GPRS   	
	u8			Sfcs=0; 	
	u16  i=0;	
   
   //  1. Head
	   if( !Protocol_Head( MSG_0x0700, Packet_Normal ) )
	   {
		   return false;
	   }

        
		Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
		Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
		Original_info[Original_info_Wr++]	= Recode_Obj.CMD;	// 命令字
		Swr 								= Original_info_Wr;
		
		Original_info[Original_info_Wr++]	= 0x55; 			// 起始头
		Original_info[Original_info_Wr++]	= 0x7A;
		if(Recode_Obj.Error==1)
		   Original_info[Original_info_Wr++]	= 0xFA; 			//命令字
		else
		if(Recode_Obj.Error==2)	
		   Original_info[Original_info_Wr++]	= 0xFB; 			//命令字	
		Original_info[Original_info_Wr++]	= 0x00; 			// 保留字

     	//---------------  填写计算 A 协议	Serial Data   校验位  -------------------------------------

	Sfcs = 0;                            //  计算S校验 从Ox55 开始
	for( i = Swr; i < Original_info_Wr; i++ )
	{
		Sfcs ^= Original_info[i];
	}
	//Original_info[Original_info_Wr++] = Sfcs;               // 填写FCS

/*bitter:最后一包发送fcs*/


		Original_info[Original_info_Wr++] = Sfcs;               // 填写FCS
	

	//  3. Send
	Protocol_End( Packet_Normal, 0 );

	//  4.     如果是分包 判断结束
  return true; 
}


u8  Stuff_RecoderACK_0700H( u8 PaketType )  //   行车记录仪数据上传
{  

   u16	SregLen=0,Swr=0;//,Gwr=0; // S:serial  G: GPRS   
//   u16      Reg_len_position=0;  
   u8	       Sfcs=0;     
   u16	i=0;   
   u32	regdis=0,reg2=0;   
//   u8   	Reg[70];  
//   u8       QueryRecNum=0;  // 查询记录数目
   u16    stuff_len=0;

	//  1. Head
	if( !Protocol_Head( MSG_0x0700, PaketType ) )
	{
		return false;
	}

	switch( Recode_Obj.CMD )
	{
		case   0x00:                                                //  执行标准版本年号
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;   // 命令字
			Swr									= Original_info_Wr;

			Original_info[Original_info_Wr++]	= 0x55;             // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;
			Original_info[Original_info_Wr++]	= 0x00;             //命令字
			SregLen								= 0x02;             // 信息长度
			Original_info[Original_info_Wr++]	= 0x00;             // Hi
			Original_info[Original_info_Wr++]	= 2;                // Lo

			Original_info[Original_info_Wr++]	= 0x00;             // 保留字
			Original_info[Original_info_Wr++]	= 0x12;             //  12  年标准 
			Original_info[Original_info_Wr++]	= 0x00;

			break;
		//---------------- 上传数类型  -------------------------------------
		case 0x01:
			//  01  当前驾驶员代码及对应的机动车驾驶证号
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;               // 命令字
			Swr									= Original_info_Wr;

			Original_info[Original_info_Wr++]	= 0x55;                         // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;
			Original_info[Original_info_Wr++]	= 0x01;                         //命令字

