nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			SregLen								= 0x00;                         // 信息长度
			Original_info[Original_info_Wr++]	= 0x00;                         // Hi
			Original_info[Original_info_Wr++]	= 18;                           // Lo

			Original_info[Original_info_Wr++] = 0x00;                           // 保留字

            /*
			memcpy( Original_info + Original_info_Wr, "120221123456789", 15 );  //信息内容
			Original_info_Wr					+= 15;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			*/

             memcpy( Original_info + Original_info_Wr,JT808Conf_struct.Driver_Info.DriverCard_ID, 18 );  //信息内容
			 Original_info_Wr					+= 18;			
			break;
		case 0x02:                                                              //  02  采集记录仪的实时时钟
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;               // 命令字
			Swr									= Original_info_Wr;

			Original_info[Original_info_Wr++]	= 0x55;                         // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;
			Original_info[Original_info_Wr++]	= 0x02;                         //命令字

			SregLen								= 0x00;                         // 信息长度
			Original_info[Original_info_Wr++]	= 0x00;                         // Hi
			Original_info[Original_info_Wr++]	= 6;                            // Lo

			Original_info[Original_info_Wr++] = 0x00;                           // 保留字

             time_now=Get_RTC();     
			Time2BCD( Original_info + Original_info_Wr );                       //记录仪时间
			Original_info_Wr += 6;
			break;
		case 0x03:                                                              // 03 采集360h内里程
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;               // 命令字
			Swr									= Original_info_Wr;

			Original_info[Original_info_Wr++]	= 0x55;                         // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;
			Original_info[Original_info_Wr++]	= 0x03;                         //命令字

			SregLen								= 0x00;                         // 信息长度
			Original_info[Original_info_Wr++]	= 0x00;                         // Hi
			Original_info[Original_info_Wr++]	= 20;                           // Lo

			Original_info[Original_info_Wr++] = 0x00;                           // 保留字
			//	信息内容
			Time2BCD( Original_info + Original_info_Wr );                       // 记录仪实时时间
			Original_info_Wr					+= 6;
			Original_info[Original_info_Wr++]	= JT808Conf_struct.FirstSetupDate[0];                         // 初次安装时间
			Original_info[Original_info_Wr++]	= JT808Conf_struct.FirstSetupDate[1];
			Original_info[Original_info_Wr++]	= JT808Conf_struct.FirstSetupDate[2];
			Original_info[Original_info_Wr++]	= JT808Conf_struct.FirstSetupDate[3];
			Original_info[Original_info_Wr++]	= JT808Conf_struct.FirstSetupDate[4];
			Original_info[Original_info_Wr++]	= JT808Conf_struct.FirstSetupDate[5];
			//--- 初始里程
			Original_info[Original_info_Wr++]	= chushilicheng[0];
			Original_info[Original_info_Wr++]	= chushilicheng[1];
			Original_info[Original_info_Wr++]	= chushilicheng[2];
			Original_info[Original_info_Wr++]	= chushilicheng[3];

			/*Original_info[Original_info_Wr++]	= leijilicheng[0];
			Original_info[Original_info_Wr++]	= leijilicheng[1];
			Original_info[Original_info_Wr++]	= leijilicheng[2];
			Original_info[Original_info_Wr++]	= leijilicheng[3]; */
			// -- 累积里程 3个字节 单位0.1km    6位
			regdis								= JT808Conf_struct.Distance_m_u32 / 100; //单位0.1km
			reg2								= regdis / 100000;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= ( reg2 << 4 ) + ( regdis % 100000 / 10000 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 10000 / 1000 ) << 4 ) + ( regdis % 1000 / 100 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 100 / 10 ) << 4 ) + ( regdis % 10 );
			
			break;

		case 0x04:                                                                  // 04  采集记录仪脉冲系数
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;                   // 命令字
			Swr									= Original_info_Wr;
			Original_info[Original_info_Wr++]	= 0x55;                             // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;

			Original_info[Original_info_Wr++] = 0x04;                               //命令字

			SregLen								= 0x00;                             // 信息长度
			Original_info[Original_info_Wr++]	= 0x00;                             // Hi
			Original_info[Original_info_Wr++]	= 8;                                // Lo

			Original_info[Original_info_Wr++] = 0x00;                               // 保留字

			//  信息内容
			Time2BCD( Original_info + Original_info_Wr );                           // 记录仪实时时间
			Original_info_Wr					+= 6;
			Original_info[Original_info_Wr++]	= (u8)( JT808Conf_struct.Vech_Character_Value >> 8 );
			Original_info[Original_info_Wr++]	= (u8)( JT808Conf_struct.Vech_Character_Value );
			break;
		case 0x05:                                                                  //05      车辆信息采集
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;                   // 命令字
			Swr									= Original_info_Wr;
			Original_info[Original_info_Wr++]	= 0x55;                             // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;

			Original_info[Original_info_Wr++] = 0x05;                               //命令字

			SregLen								= 41;                               // 信息长度
			Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 );             // Hi
			Original_info[Original_info_Wr++]	= (u8)SregLen;                      // Lo	  65x7

			Original_info[Original_info_Wr++] = 0x00;                               // 保留字
			//-----------	信息内容  --------------
			//memcpy( Original_info + Original_info_Wr, "LGBK22E70AY100102", 17 );    //信息内容
			memcpy( Original_info + Original_info_Wr,Vechicle_Info.Vech_VIN,17);
			Original_info_Wr += 17;
			memcpy( Original_info + Original_info_Wr,Vechicle_Info.Vech_Num, 8 );               // 车牌号
			Original_info_Wr					+= 8;
			//Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			//车辆类型
			/*Original_info[Original_info_Wr++]	= 0x03; //小型车
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;*/
			/*
			memcpy( Original_info + Original_info_Wr, "小型车", 6 );   
			Original_info_Wr+=6;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;*/
			 memcpy(Original_info + Original_info_Wr,Vechicle_Info.Vech_Type,12); 
			Original_info_Wr+=12; 
			//---- 去掉了一个多余的字节
			break;
		case   0x06:                                                    // 06-09
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;       // 命令字
			Swr									= Original_info_Wr;
			//  06 信号配置信息
			Original_info[Original_info_Wr++]	= 0x55;                 // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;

			Original_info[Original_info_Wr++] = 0x06;                   //命令字

