nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			Original_info_Wr += stuff_len;   

			break;
		case   0x14:
			Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
			Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
			Original_info[Original_info_Wr++]	= Recode_Obj.CMD;       // 命令字
			Swr									= Original_info_Wr;
			// 14 记录仪参数修改记录
			Original_info[Original_info_Wr++]	= 0x55;                 // 起始头
			Original_info[Original_info_Wr++]	= 0x7A;

			Original_info[Original_info_Wr++] = 0x14;                   //命令字

			//SregLen								= 700;                  // 信息长度
            if(Vdr_Wr_Rd_Offset.V_14H_Write>100)
				       SregLen= 700;                      // 信息长度      50*10
			else
					   SregLen=Vdr_Wr_Rd_Offset.V_14H_Write*7; 
				 
			
			Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 ); // Hi
			Original_info[Original_info_Wr++]	= (u8)SregLen;          // Lo    65x7

			Original_info[Original_info_Wr++] = 0x00;                   // 保留字
			//------- 信息内容 ------


			/*
			       每条 7 个字节   100 条    1个完整包
			 */
			 WatchDog_Feed( );
			// get_14h( Original_info + Original_info_Wr );
			// Original_info_Wr += 700;
			
			
			if(Vdr_Wr_Rd_Offset.V_14H_Write>100)
				stuff_len=stuff_drvData(0x14,Vdr_Wr_Rd_Offset.V_14H_Write-100,100,Original_info + Original_info_Wr);  
			else
				stuff_len=stuff_drvData(0x14,0,Vdr_Wr_Rd_Offset.V_14H_Write,Original_info + Original_info_Wr); 

			Original_info_Wr += stuff_len;   
			
			break;

		case    0x15:                                                      // 15 采集指定的速度状态日志     --------Divde
			//if( ( PaketType == Packet_Divide ) && ( Recode_Obj.Current_pkt_num == 1 ) )
		//	if( ( Recode_Obj.Current_pkt_num == 1 ) ) 
			{
				Original_info[Original_info_Wr++]	= (u8)( Recode_Obj.Float_ID >> 8 );
				Original_info[Original_info_Wr++]	= (u8)Recode_Obj.Float_ID;
				Original_info[Original_info_Wr++]	= Recode_Obj.CMD;       // 命令字
				Swr									= Original_info_Wr;
				Original_info[Original_info_Wr++]	= 0x55;                 // 起始头
				Original_info[Original_info_Wr++]	= 0x7A;

				Original_info[Original_info_Wr++] = 0x15;                   //命令字

				//SregLen								= 133*2;             // 信息长度
				if(Vdr_Wr_Rd_Offset.V_15H_Write>2)
				       SregLen=266;                      // 信息长度      50*10
			    else
					   SregLen=Vdr_Wr_Rd_Offset.V_15H_Write*133;
				Original_info[Original_info_Wr++]	= (u8)( SregLen >> 8 ); // Hi
				Original_info[Original_info_Wr++]	= (u8)SregLen;          // Lo    65x7

				Original_info[Original_info_Wr++] = 0x00;                   // 保留字 
			}


			/*
			       每条 133 个字节   10 条    1个完整包     5*133=665        totalnum=2
			 */
			WatchDog_Feed( );
			//get_15h( Original_info + Original_info_Wr );
			//Original_info_Wr += 133;
            
			if(Vdr_Wr_Rd_Offset.V_15H_Write>2)
				stuff_len=stuff_drvData(0x15,Vdr_Wr_Rd_Offset.V_15H_Write-2,2,Original_info + Original_info_Wr);  
			else
				stuff_len=stuff_drvData(0x15,0,Vdr_Wr_Rd_Offset.V_15H_Write,Original_info + Original_info_Wr); 

			Original_info_Wr += stuff_len;   
			break;
		default:         
			
			break;
	}
	//---------------  填写计算 A 协议	Serial Data   校验位  -------------------------------------

	Sfcs = 0;                            //  计算S校验 从Ox55 开始
	for( i = Swr; i < Original_info_Wr; i++ )
	{
		Sfcs ^= Original_info[i];
	}
	//Original_info[Original_info_Wr++] = Sfcs;               // 填写FCS

/*bitter:最后一包发送fcs*/
#if 1
	if( PaketType == Packet_Divide )
	{
		Recode_Obj.fcs ^= Sfcs;
		if( Recode_Obj.Current_pkt_num == Recode_Obj.Total_pkt_num )
		{
			Original_info[Original_info_Wr++] = Recode_Obj.fcs; // 填写FCS
		}
	}else
	{
		Original_info[Original_info_Wr++] = Sfcs;               // 填写FCS
	}
#endif

	//  3. Send
	Protocol_End( PaketType, 0 );

	//  4.     如果是分包 判断结束
    if( Recode_Obj.Devide_Flag== 1 )   // 不给应答
	{
		if(Recode_Obj.Current_pkt_num >=Recode_Obj.Total_pkt_num )
		{
			Recorder_init( );           //  clear
		}else
		{
			Recode_Obj.Current_pkt_num++;
		}
	}

	if( DispContent )
	{
		rt_kprintf( "\r\n	SEND Recorder Data ! \r\n");
	}

	return true;
}


//------------------------------------------------------------------
u8  Stuff_DataTransTx_0900H(void)      
{  
	
	// 1. Head
	if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	 //  应答流水号
	Original_info[Original_info_Wr++]=DataTrans.TYPE;// 返回透传数据的类型
	memcpy(Original_info+Original_info_Wr,DataTrans.Data_Tx,DataTrans.Data_TxLen);
	Original_info_Wr+=DataTrans.Data_TxLen;
	 //  3. Send 
	Protocol_End(Packet_Normal ,0);
    if(DispContent)
	     rt_kprintf("\r\n	发送透传  \r\n");    
	return true; 

}

//----------------------------------------------------------------------
u8  Stuff_CentreTakeACK_BD_0805H( void )
{
	// 1. Head
	if( !Protocol_Head( MSG_0x0805, Packet_Normal ) )
	{
		return false;
	}
	// 2. content
	//   float ID
	Original_info[Original_info_Wr++]	= (u8)( Centre_FloatID >> 8 );      //  应答流水号
	Original_info[Original_info_Wr++]	= (u8)Centre_FloatID;
	Original_info[Original_info_Wr++]	= (u8)SingleCamra_TakeResualt_BD;   // 中心应答结果
	Original_info[Original_info_Wr++]	= 0x00;                             //  成功拍照多媒体个数    1
	Original_info[Original_info_Wr++]	= 1;
	Original_info[Original_info_Wr++]	= 0;                                // 多媒体ID 列表
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 0;
	Original_info[Original_info_Wr++]	= 1;
	//  3. Send
	Protocol_End( Packet_Normal, 0 );
	if( DispContent )
	{
		rt_kprintf( "\r\n	摄像头立即拍照应答 \r\n");
	}
 
	return true;  
}

//----------------------------------------------------------------------

u8  Stuff_MultiMedia_InfoSD_0800H(void)      
{  
  
	// 1. Head
	if(!Protocol_Head(MSG_0x0800,Packet_Normal)) 
 	  return false; 
	 // 2. content          
		 switch (MediaObj.Media_Type)
		  {
		   case 0 : // 图像
				   MediaObj.Media_totalPacketNum=Photo_sdState.Total_packetNum;  // 图片总包数
				   MediaObj.Media_currentPacketNum=Photo_sdState.SD_packetNum;	// 图片当前报数
				   MediaObj.Media_ID=1;   //  多媒体ID
				   MediaObj.Media_Channel=Camera_Number;  // 图片摄像头通道号
				   break;
		   case 1 : // 音频
		          #ifdef REC_VOICE_ENABLE
				  MediaObj.Media_totalPacketNum=Sound_sdState.Total_packetNum;	// 图片总包数
				  MediaObj.Media_currentPacketNum=Sound_sdState.SD_packetNum;  // 图片当前报数
				  MediaObj.Media_ID=1;	 //  多媒体ID
				  MediaObj.Media_Channel=1;  // 图片摄像头通道号
		         // rt_kprintf(" \r\n 申请上传音频信息 \r\n");  
		         #endif
				   break;
		   default:
				   return false;
		  }
	 
	   //  MediaID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>24);// 返回事件ID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>16);
       Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>8);    	
	   Original_info[Original_info_Wr++]=MediaObj.Media_ID;
	   //  Type	   
	   Original_info[Original_info_Wr++]=MediaObj.Media_Type;
	   //  MediaCode Type 
	    Original_info[Original_info_Wr++]=MediaObj.Media_CodeType;
	    Original_info[Original_info_Wr++]=MediaObj.Event_Code;
	    Original_info[Original_info_Wr++]=MediaObj.Media_Channel;
	   
	   
	 //  3. Send 
	Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	发送多媒体事件信息上传  \r\n");    
	 return true; 

