nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

//--------------------------------------------------------------------------
u8  Stuff_MultiMedia_Data_0801H(void)      
{  
	u16 inadd=0,readsize=0;//,soundpage=0,sounddelta=0;
//	u8  instr[SpxGet_Size];  

	  
	//  rt_kprintf("\r\n  1--- pic_total_num:  %d	current_num:  %d  MediaObj.Media_Type: %d \r\n ",MediaObj.Media_totalPacketNum,MediaObj.Media_currentPacketNum,MediaObj.Media_Type);
	 // 1. Head 
	 if(!Protocol_Head(MSG_0x0801,Packet_Divide))   
 	  return false;    
	 // 2. content1  ==>  MediaHead   
	 if(MediaObj.Media_currentPacketNum==1)
	 {
	   //  MediaID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>24);//  多媒体ID
	   Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>16);
       Original_info[Original_info_Wr++]=(MediaObj.Media_ID>>8);    	
	   Original_info[Original_info_Wr++]=MediaObj.Media_ID;
	   //  Type	   
	   Original_info[Original_info_Wr++]=MediaObj.Media_Type;    // 多媒体类型
	   //  MediaCode Type 
	    Original_info[Original_info_Wr++]=MediaObj.Media_CodeType; // 多媒体编码格式
	    Original_info[Original_info_Wr++]=MediaObj.Event_Code;     // 多媒体事件编码
	    Original_info[Original_info_Wr++]=MediaObj.Media_Channel;  // 通道ID  

	    //  Position Inifo	    
		//  告警标志  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Warn_Status,4 );    
		Original_info_Wr += 4;
		// . 状态  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Car_Status,4 );   
		Original_info_Wr += 4;
		//   纬度
	    memcpy( ( char * ) Original_info+ Original_info_Wr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
		Original_info_Wr += 4;
		//   经度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
		Original_info_Wr += 4;
		//   高程
		Original_info[Original_info_Wr++]=(u8)(GPS_Hight<<8);
		Original_info[Original_info_Wr++]=(u8)GPS_Hight;
		//   速度    0.1 Km/h
		Original_info[Original_info_Wr++]=(u8)(Speed_gps>>8);//(GPS_speed>>8); 
		Original_info[Original_info_Wr++]=(u8)(Speed_gps);//GPS_speed;     
		//   方向   单位 1度
		Original_info[Original_info_Wr++]=(GPS_direction>>8);  //High 
		Original_info[Original_info_Wr++]=GPS_direction; // Low
		//   日期时间	
		Original_info[Original_info_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	 
		//------------
	 } 	
      // 4. content3  ==> Media Info
     switch (MediaObj.Media_Type) 
         {
          case 0 : // 图像
                   
				   if(((Photo_sdState.photo_sending)==enable)&&((Photo_sdState.SD_flag)==enable))
				   {
					   Photo_sdState.SD_flag=disable;// clear    
				   }
				   else				   	
				   if((1==MediaObj.RSD_State)&&(Photo_sdState.SD_flag==enable)) //  补报相关
				   {
					   Photo_sdState.SD_flag=disable;// clear    
				   }
				   else
				   	 return false; 
				   //  ---------------  填写内容  ---------------
				   Photo_sdState.photo_sendTimeout=0;  // clear timeout   
				   //			read		Photo_sdState.SD_packetNum从1开始计数
				   //			content_startoffset 	picpage_offset				 contentpage_offset
                  if(TF_Card_Status()==0) 
                  {
	                   if(Camera_Number==1)
					      Api_DFdirectory_Read(camera_1, Original_info + Original_info_Wr, 512,1,MediaObj.Media_currentPacketNum); 
	                   else
					   if(Camera_Number==2)
					      Api_DFdirectory_Read(camera_2, Original_info + Original_info_Wr, 512,1,MediaObj.Media_currentPacketNum); 
	                   else
					   if(Camera_Number==3)
					      Api_DFdirectory_Read(camera_3, Original_info + Original_info_Wr, 512,1,MediaObj.Media_currentPacketNum); 
	                   else
			         if(Camera_Number==4)
					      Api_DFdirectory_Read(camera_4, Original_info + Original_info_Wr, 512,1,MediaObj.Media_currentPacketNum);  
 	   	
                       DF_delay_ms(10); 
				      inadd=(Photo_sdState.SD_packetNum-1)<<9; //乘以512
				   	  if(PicFileSize>inadd)
				   	  	{
                            if((PicFileSize-inadd)>512)
                                 readsize=512;
							else
							 {	 
							    readsize=PicFileSize-inadd; // 最后一包  
							    rt_kprintf("\r\n   最后一包 readsize =%d \r\n",readsize);
							 }
				   	  	}
					  else
					  	 return false;
                  	}
				  else
				   if(TF_Card_Status()==1)  
				   	{  ;

				   	} 
			 Original_info_Wr+=readsize;		 //         
		          break;
		  case 1 : // 音频
		   #ifdef REC_VOICE_ENABLE
			  if(((Sound_sdState.photo_sending)==enable)&&((Sound_sdState.SD_flag)==enable))
			   {
				   Sound_sdState.SD_flag=disable;// clear	   
			   }
			   else
				 return false; 
                       //------------------------------------------------------------------------
			   //  ---------------  填写内容  ---------------
			   //			read		Photo_sdState.SD_packetNum从1开始计数
			   //			content_startoffset 	picpage_offset				 contentpage_offset
	                  if(TF_Card_Status()==0) 
	                  {
				       Api_DFdirectory_Read(voice, Original_info + Original_info_Wr, 512,1,MediaObj.Media_currentPacketNum);  
					inadd=(Sound_sdState.SD_packetNum-1)<<9; //乘以512
					if(SrcFileSize>inadd)
					 {
			                           if((SrcFileSize-inadd)>512)
			                                 readsize=512;
							else
							 {	 
							     readsize=SrcFileSize-inadd; // 最后一包  
							     rt_kprintf("\r\n   最后一包 readsize =%d \r\n",readsize);  
							 }
					  }
					  else
						  return false;    
	                  	}
				 rt_kprintf("\r\n Sound_sdState.SD_packetNum= %d   filesize=%d  readsize=%d  \r\n",Sound_sdState.SD_packetNum,SrcFileSize,SrcFileSize-inadd);  
                              Original_info_Wr+=readsize;	  


		  #endif
		          break; 
		  default:
		  	      return false;
         }	  

	 
