nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	 if(MediaObj.Media_currentPacketNum>MediaObj.Media_totalPacketNum)
	 {
	 	return false;
	 }	
	 //  5. Send 
	 
		/*     debug   丢包情况   模拟
		       if((MediaObj.Media_currentPacketNum==3)&&(MediaObj.RSD_State==0))
			 	    rt_kprintf("\r\n	jump 3  packet \r\n"); 
			 else
			   if((MediaObj.Media_currentPacketNum==5)&&(MediaObj.RSD_State==0))
			 	    rt_kprintf("\r\n	jump 5  packet \r\n");	 
			 else  
			   if((MediaObj.Media_currentPacketNum==8)&&(MediaObj.RSD_State==0))
			 	    rt_kprintf("\r\n	jump 8  packet \r\n");  
			 else
			     if((MediaObj.Media_currentPacketNum==11)&&(MediaObj.RSD_State==0))
			 	    rt_kprintf("\r\n	jump 11  packet \r\n");	
			 else	 
		*/
	     Protocol_End(Packet_Divide,0);
	 
	 if(DispContent)
	     rt_kprintf("\r\n	Send Media Data \r\n");     
	//  else
	  {
		 rt_kprintf("\r\n pic_total_num:  %d   current_num:  %d   \r\n ",MediaObj.Media_totalPacketNum,MediaObj.Media_currentPacketNum);
		 if(MediaObj.Media_currentPacketNum>=MediaObj.Media_totalPacketNum)
		 {				    
			rt_kprintf("\r\n Media 最后一个block\r\n");
			
			if(0==MediaObj.RSD_State)	// 如果在顺序传输模式下，则改为停止状态,等待中心下重传
			 {
			    MediaObj.RSD_State=2;	
			    MediaObj.RSD_Timer=0;			   
			 } 
			
		 }							 

	  }  
     //----------  累加发送报数 --------------------
     if(0==MediaObj.RSD_State)
     {
		 if(MediaObj.Media_currentPacketNum<MediaObj.Media_totalPacketNum)
		  {
		    //  图片
		    if(Photo_sdState.photo_sending==enable)
		       Photo_sdState.SD_packetNum++;
			//  音频 
			if(Sound_sdState.photo_sending==enable)
			Sound_sdState.SD_packetNum++;
			//视频
			if(Video_sdState.photo_sending==enable)
			 Video_sdState.SD_packetNum++; 
		  }
     }
	 else
	 if(1==MediaObj.RSD_State)
	 {
	      rt_kprintf("\r\n  MediaObj.RSD_Reader =%d\r\n",MediaObj.RSD_Reader); 
	      MediaObj.RSD_Reader++;
	      if(MediaObj.RSD_Reader==MediaObj.RSD_total)
	   	     MediaObj.RSD_State=2; //  置位等待状态，等待着中心再发重传指令
	 }	
	 //----------  返回  -------------------
	 return true; 

}
//----------------------------------------------------------------------
u8  Stuff_MultiMedia_IndexAck_0802H(void)      
{  
   u16  totalNum=0, lenregwr=0;
   u16  i=0;  
   
   
	// 1. Head
	if(!Protocol_Head(MSG_0x0802,Packet_Normal)) 
 	  return false; 
	 // 2. content     
        //   float ID  应答流水号 
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID;
          
		//------- 多媒体总项数 ----
		lenregwr=Original_info_Wr;		
	    Original_info[Original_info_Wr++]=(u8)(totalNum>>8); // 临时占上位置
	    Original_info[Original_info_Wr++]=(u8)totalNum;

		//----- 查找有效效位置 ----
		totalNum=0;
		  for(i=0;i<8;i++)
		  {
			  if(SD_ACKflag.f_MediaIndexACK_0802H==1)  // 图像
			  {		
				 Api_RecordNum_Read(pic_index,i,(u8*)&MediaIndex, sizeof(MediaIndex));   
			  }
			  else
			  if(SD_ACKflag.f_MediaIndexACK_0802H==2) // 音频
			  {
			       Api_RecordNum_Read(voice_index,i,(u8*)&MediaIndex, sizeof(MediaIndex));   
			  }  
			 // rt_kprintf("\r\n Effective_Flag %d  f_QueryEventCode %d  EventCode %d  \r\n",MediaIndex.Effective_Flag,SD_ACKflag.f_QueryEventCode,MediaIndex.EventCode);
			  if((MediaIndex.Effective_Flag==1)&&(SD_ACKflag.f_QueryEventCode==MediaIndex.EventCode))
			  { //  查找有效的索引和相对应类型的索引
			    Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID>>24); //  多媒体ID dworrd
			    Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID>>16);
				Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID>>8);
				Original_info[Original_info_Wr++]=(u8)(MediaIndex.MediaID);
			    Original_info[Original_info_Wr++]=MediaIndex.Type; //  多媒体类型
				Original_info[Original_info_Wr++]=MediaIndex.ID;   //  通道
			    Original_info[Original_info_Wr++]=MediaIndex.EventCode;
				memcpy(Original_info+Original_info_Wr,MediaIndex.PosInfo,28);
			    Original_info_Wr+=28;    
				totalNum++;    
			  }
			  
		  }

          //---------   补上总项数  -------- 
          Original_info[lenregwr]=(u8)(totalNum>>8);
		  Original_info[lenregwr+1]=totalNum;     

	 //  3. Send 
	Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Media Index \r\n");    
	 return true; 

}
//--------------------------------------------------------------------------------------
u8  Stuff_DriverInfoSD_0702H(void)      
{  
    u8 i=0;
	 // 1. Head
	 if(!Protocol_Head(MSG_0x0702,Packet_Normal))  
 	    return false; 
	
	 // 2. content     
        //   驾驶员姓名长度
        i=strlen((const char*) JT808Conf_struct.Driver_Info.DriveName);
	    Original_info[Original_info_Wr++]=i;
	    memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.DriveName,i);// name
		Original_info_Wr+=i;
        memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.Driver_ID,20);// 身份证号码
        Original_info_Wr+=20;
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.Drv_CareerID,40);//从业资格证
        Original_info_Wr+=40;
		i=strlen((const char*)JT808Conf_struct.Driver_Info.Comfirm_agentID); // 机构名称
		Original_info[Original_info_Wr++]=i;
		memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.Comfirm_agentID,i);
		Original_info_Wr+=i;
		
	 // 3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Driver Info \r\n");    
	 return true; 

}
u8  Stuff_ISP_Resualt_BD_0108H(void)
{
   // 1. Head
	if(!Protocol_Head(MSG_0x0108,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	 BD_ISP.ISP_running=0; // clear
         //----------------------------------------------------
         Original_info[Original_info_Wr++]=BD_ISP.Update_Type; // 升级类型
	  Original_info[Original_info_Wr++]=SD_ACKflag.f_BD_ISPResualt_0108H-1;//BD_ISP.Update_Type;  // 升级结果
	 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	远程升级结果上报   %d \r\n",SD_ACKflag.f_BD_ISPResualt_0108H-1);      
  
		return true;
}
u8  Stuff_BatchDataTrans_BD_0704H(void)
{
   // 1. Head
	if(!Protocol_Head(MSG_0x0704,Packet_Normal)) 
 	     return false; 
	 // 2. content   
             // 2.1   数据项个数
             Original_info[Original_info_Wr++]=1;   
	       // 2.2   位置数据类型
             Original_info[Original_info_Wr++]=0;   //  0: 正常上报  1: 盲区补报
	      // 2.3   位置汇报数据项
	      	// 1. 告警标志  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Warn_Status,4 );    
		Original_info_Wr += 4;
		// 2. 状态  4
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Car_Status,4 );   
		Original_info_Wr += 4;
		// 3.  纬度
	       memcpy( ( char * ) Original_info+ Original_info_Wr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
		Original_info_Wr += 4;
		// 4.  经度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
		Original_info_Wr += 4;
		// 5.  高程
		Original_info[Original_info_Wr++]=(u8)(GPS_Hight<<8);
		Original_info[Original_info_Wr++]=(u8)GPS_Hight;
		// 6.  速度    0.1 Km/h
		Original_info[Original_info_Wr++]=(u8)(Speed_gps>>8);//(GPS_speed>>8); 
		Original_info[Original_info_Wr++]=(u8)(Speed_gps);//GPS_speed;     
		// 7. 方向   单位 1度
		Original_info[Original_info_Wr++]=(GPS_direction>>8);  //High 
		Original_info[Original_info_Wr++]=GPS_direction; // Low
		// 8.  日期时间	
		Original_info[Original_info_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
		Original_info[Original_info_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
		Original_info[Original_info_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	 
     
	 //  3. Send 
	  Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	          rt_kprintf("\r\n	定位数据批量上传\r\n");    
   return true;
}


u8  Stuff_CANDataTrans_BD_0705H(void)
{
      u16   DataNum=0,i=0;
      u32   read_rd=0; 	  
   // 1. Head
	if(!Protocol_Head(MSG_0x0705,Packet_Normal)) 
 	  return false; 
	 // 2. content   
        // 数据项个数
        DataNum=(CAN_trans.canid_1_SdWr>>3);  // 除以8 
        Original_info[Original_info_Wr++]=(DataNum>>8);
	 Original_info[Original_info_Wr++]=DataNum;
	 Can_sdnum+=DataNum;  
	 //接收时间
        Original_info[Original_info_Wr++]=((time_now.hour/10)<<4)+(time_now.hour%10);
	 Original_info[Original_info_Wr++]=((time_now.min/10)<<4)+(time_now.min%10);
	 Original_info[Original_info_Wr++]=((time_now.sec/10)<<4)+(time_now.sec%10);    
	 Original_info[Original_info_Wr++]=(Can_same%10);//0x00;  // ms 毫秒  
	 Original_info[Original_info_Wr++]=0x00;    
	 //  CAN 总线数据项
	 read_rd=0;
        for(i=0;i<DataNum;i++)
        {	
           /*
		Original_info[Original_info_Wr++]= (CAN_trans.canid_1_Filter_ID>>24)|0x40;// 返回透传数据的类型 
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_Filter_ID>>16);
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_Filter_ID>>8);
		Original_info[Original_info_Wr++]=CAN_trans.canid_1_Filter_ID;        
	  */     
		
		Original_info[Original_info_Wr++]= (CAN_trans.canid_1_ID_SdBUF[i]>>24)|0x40;// 返回透传数据的类型 
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_ID_SdBUF[i]>>16);
		Original_info[Original_info_Wr++]=(CAN_trans.canid_1_ID_SdBUF[i]>>8);
		Original_info[Original_info_Wr++]=CAN_trans.canid_1_ID_SdBUF[i];   
		
