nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		//--------------------------------------------------------------------------
		memcpy(Original_info+Original_info_Wr,CAN_trans.canid_1_Sdbuf+read_rd,8);    
		Original_info_Wr+=8;
		read_rd+=8;  
        }	 
	 CAN_trans.canid_1_SdWr=0;   
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	CAN 总线数据上传 数据项=%d   Rxnum=%d  Sd_num=%d  Can_loudiao=%d  Can_notsame=%d Same=%d\r\n",DataNum,Can_RXnum,Can_sdnum,Can_loudiao,Can_same,Can_notsame);       
   return true;
}

//---------------------------------------------------------------------------------
u8  Stuff_Worklist_0701H(void)      
{  
    u32  listlen=215;
	 // 1. Head
	 if(!Protocol_Head(MSG_0x0701,Packet_Normal)) 
 	    return false; 
	
	 // 2. content     
        //   信息长度
	     listlen=207;
		 Original_info[Original_info_Wr++]=(listlen>>24);// 返回事件ID
		 Original_info[Original_info_Wr++]=(listlen>>16);
		 Original_info[Original_info_Wr++]=(listlen>>8);		  
		 Original_info[Original_info_Wr++]=listlen;
	    
        memcpy(Original_info+Original_info_Wr,"托运单位:天津七一二通信广播有限公司 电话:022-26237216  ",55);
        Original_info_Wr+=55;		
        memcpy(Original_info+Original_info_Wr,"承运单位:天津物流运输公司 电话:022-86692666  ",45);
        Original_info_Wr+=45;
		memcpy(Original_info+Original_info_Wr,"物品名称:GPS车载终端  包装方式:  箱式   每箱数量: 20   总量: 30箱  ",67);
        Original_info_Wr+=67;
		memcpy(Original_info+Original_info_Wr,"车型:箱式小货车 运达日期 :  2012-1-11   ",40); 
        Original_info_Wr+=40; 
		
	 // 3. Send 
	Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	Send Worklist  \r\n");    
	 return true; 

}
 //-------------------- ISP Check  ---------------------------------------------
void  ISP_file_Check(void)
{
   u8  FileHead[100];
   u8  ISP_judge_resualt=0;
   u32  HardVersion=0;
   	
      memset(ISP_buffer,0,sizeof(ISP_buffer));
	  SST25V_BufferRead(ISP_buffer,ISP_StartArea,256); 
      //---判断文件更新标志---------------------
      if(ISP_buffer[32]!=ISP_BYTE_CrcPass)   //  计算校验通过后  更新标志改成0xE1     以前是0xF1
      	{
      	     rt_kprintf("\r\n 厂商型号正确\r\n");  
             return;  
      	}
	  
	  /*
		   序号   字节数	名称			  备注
		  1 		  1    更新标志 	 1 表示需要更新   0 表示不需要更新
		  2-5			  4   设备类型				 0x0000 0001  ST712   TWA1
											0x0000 0002   STM32  103  新A1
											0x0000 0003   STM32  101  简易型
											0x0000 0004   STM32  A3  sst25
											0x0000 0005   STM32  行车记录仪 
		  6-9		 4	   软件版本 	 每个设备类型从  0x0000 00001 开始根据版本依次递增
		  10-29 	  20	日期		' mm-dd-yyyy HH:MM:SS'
		  30-31 	  2    总页数		   不包括信息页
		  32-35 	  4    程序入口地址    
		  36-200	   165	  预留	  
		  201-		  n    文件名  
	 
	  */
	  //------------   Type check  ---------------------
	  memset(FileHead,0,sizeof(FileHead));
	  memcpy(FileHead,ISP_buffer,32);
	  rt_kprintf( "\r\n FileHead:%s\r\n",FileHead ); 


	  //------    文件格式判断
	  if(strncmp(ISP_buffer+32+13,"70420TW705",10)==0) //判断厂商和型号
		 {
			 ISP_judge_resualt++;// step 1
			 rt_kprintf("\r\n 厂商型号正确\r\n");  

			 // hardware 
			 HardVersion=(ISP_buffer[32+38]<<24)+(ISP_buffer[32+39]<<16)+(ISP_buffer[32+40]<<8)+ISP_buffer[32+41]; 
			 HardWareVerion=HardWareGet();
			 if(HardWareVerion==HardVersion)	// 要兼容以前的老板子 全1									
			  {
				  ISP_judge_resualt++;// step 2
				  rt_kprintf("\r\n 硬件版本:%d\r\n",HardVersion);  
			  }
             else
				  rt_kprintf("\r\n 硬件版本不匹配!\r\n");    
			 //firmware
			 if(strncmp(ISP_buffer+32+42,"TJGGHYPT",8)==0) 
			 {
				ISP_judge_resualt++;// step 3
				rt_kprintf("\r\n  固件版本:TJGGHYPT\r\n");	 
			 }
			 // operater
			 if(strncmp(ISP_buffer+32+62,"TJGTGS",6)==0) 
			 {
				ISP_judge_resualt++;// step 4
				rt_kprintf("\r\n  固件版本:TJGTGS\r\n");  	  
			 }
			 
		 }

     //ISP_judge_resualt=4;
	 if(ISP_judge_resualt==4) 
	 {
		  //------- enable  flag -------------
		 SST25V_BufferRead( FileHead,0x001000,100 );
		 FileHead[32] = ISP_BYTE_Rdy2Update;    //-----  文件更新标志  使能启动时更新
		 SST25V_BufferWrite( FileHead,0x001000,100);   
		
		 {
			Systerm_Reset_counter= (Max_SystemCounter-5);	 // 准备重启更新最新程序
			ISP_resetFlag=1;//准备重启 
			rt_kprintf( "\r\n 准备重启更新程序!\r\n" );	  
		 } 	
		
		// rt_kprintf( "\r\n 升级完成了，但不更新等待判断 校验测试 \r\n" );	   
	 }
	else
	{
	        //------- enable  flag -------------
		 SST25V_BufferRead( FileHead,0x001000,100 );
		 FileHead[32] = ISP_BYTE_TypeNotmatch;    //-----   文件校验通过，但 类型不匹配  
		 SST25V_BufferWrite( FileHead,0x001000,100);   
	      BD_ISP.ISP_running=0; // recover normal  
          rt_kprintf( "\r\n 相关参数不匹配不与更新!\r\n" );	 
	}
   
 }
// FINSH_FUNCTION_EXPORT(ISP_file_Check, ISP_file_Check);   



//----------------------------------------------------------------------------------
void Stuff_O200_Info_Only( u8* Instr) 
{
   u8  Infowr=0;
   
	// 1. 告警标志  4
	memcpy( ( char * ) Instr+ Infowr, ( char * )Warn_Status,4 );    
	Infowr += 4;
	// 2. 状态  4
	memcpy( ( char * ) Instr+ Infowr, ( char * )Car_Status,4 );   
	Infowr += 4;
	// 3.  纬度
    memcpy( ( char * ) Instr+ Infowr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
	Infowr += 4;
	// 4.  经度
	memcpy( ( char * ) Instr+ Infowr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Infowr += 4;
	// 5.  高程
	Instr[Infowr++]=(u8)(GPS_Hight<<8);
	Instr[Infowr++]=(u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Instr[Infowr++]=(u8)(Speed_gps>>8);
	Instr[Infowr++]=(u8)Speed_gps;   
	// 7. 方向   单位 1度
	Instr[Infowr++]=(GPS_direction>>8);  //High 
	Instr[Infowr++]=GPS_direction; // Low
	// 8.  日期时间	
	Instr[Infowr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
	Instr[Infowr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
	Instr[Infowr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	

}
//-----------------------------------------------------
u8  Save_MediaIndex( u8 type, u8* name, u8 ID,u8 Evencode)
{
  u8   i=0;

  if((type!=1)&&(type!=0))
    return false;
  
