nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					 i =str2ip((char*)reg_in, SysConf_struct.BD_IC_main_IP);
					 if (i <= 3)
					 {
					  rt_kprintf("\r\n IC  主 域名: %s \r\n",reg_in); 
					  
					  memset(SysConf_struct.BD_IC_DNSR,0,sizeof(SysConf_struct.BD_IC_DNSR));
					  memcpy(SysConf_struct.BD_IC_DNSR,(char*)Content,infolen);   
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					  break;
					 }
					 memset(reg_str,0,sizeof(reg_str));
					 IP_Str((char*)reg_str, *( u32 * ) SysConf_struct.BD_IC_main_IP); 		  
				       Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					rt_kprintf("\r\n IC  主IP: %d.%d.%d.%d \r\n",SysConf_struct.BD_IC_main_IP[0],SysConf_struct.BD_IC_main_IP[1],SysConf_struct.BD_IC_main_IP[2],SysConf_struct.BD_IC_main_IP[3]);    
			break;
       case  0x001B:// IC 卡  主TCP端口
                                    SysConf_struct.BD_IC_TCP_port=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)+Content[3];
                                 	 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					  rt_kprintf("\r\n IC  TCP Port: %d \r\n",SysConf_struct.BD_IC_TCP_port); 	
                                     //  IC 卡中心
					  DataLink_IC_Socket_set(SysConf_struct.BD_IC_main_IP,SysConf_struct.BD_IC_TCP_port,0); 
	              break;
       case  0x001C:// IC卡   主UDP 端口
                                     SysConf_struct.BD_IC_UDP_port=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)+Content[3];
                                    Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					 rt_kprintf("\r\n IC  UDP Port : %d \r\n",SysConf_struct.BD_IC_UDP_port); 	 			
	              break;
       case  0x001D:// IC 卡备用服务器和端口
                                    memset(reg_in,0,sizeof(reg_in)); 
					  memcpy(reg_in,Content,infolen);
					 //----------------------------						 
					 i =str2ip((char*)reg_in, SysConf_struct.BD_IC_Aux_IP);
					 if (i <= 3)
					 {
					  rt_kprintf("\r\n IC  主 域名: %s \r\n",reg_in); 
					  
					  memset(SysConf_struct.BD_IC_DNSR_Aux,0,sizeof(SysConf_struct.BD_IC_DNSR_Aux));
					  memcpy(SysConf_struct.BD_IC_DNSR_Aux,(char*)Content,infolen);   
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					  break;
					 }
					 memset(reg_str,0,sizeof(reg_str));
					 IP_Str((char*)reg_str, *( u32 * ) SysConf_struct.BD_IC_Aux_IP); 		  
				        Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					 rt_kprintf("\r\n IC  备用IP: %d.%d.%d.%d \r\n",SysConf_struct.BD_IC_Aux_IP[0],SysConf_struct.BD_IC_Aux_IP[1],SysConf_struct.BD_IC_Aux_IP[2],SysConf_struct.BD_IC_Aux_IP[3]);    

	              break;
	case   0x0031://  电子围栏半径(非法位移阈值)
                            if(infolen!=2)
						break;					
				JT808Conf_struct.BD_CycleRadius_DoorValue=(Content[0]<<8)+Content[1]; 
	                     Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
		  		rt_kprintf("\r\n 电子围栏半径(非法移动阈值): %d m\r\n",JT808Conf_struct.BD_CycleRadius_DoorValue);  
			break;
	case   0x005B: // 超速报警预警差值   1/10 KM/h
	                     if(infolen!=2)
						break;					
				JT808Conf_struct.BD_MaxSpd_preWarnValue=(Content[0]<<8)+Content[1]; 
	                     Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
		  		rt_kprintf("\r\n 超速报警预警差值: %d x 0.1km/h\r\n",JT808Conf_struct.BD_MaxSpd_preWarnValue);

	              break;
	case   0x005C: // 疲劳驾驶阈值  单位:s
	                    if(infolen!=2)
						break;					
				JT808Conf_struct.BD_TiredDrv_preWarnValue=(Content[0]<<8)+Content[1]; 
	                     Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
		  		rt_kprintf("\r\n 疲劳驾驶阈值: %d s\r\n",JT808Conf_struct.BD_TiredDrv_preWarnValue);	
	              break;
	case   0x005D:// 碰撞报警参数设置 
	        	       if(infolen!=2)
						break;					
				JT808Conf_struct.BD_Collision_Setting=(Content[0]<<8)+Content[1]; 
	                     Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
		  		rt_kprintf("\r\n 碰撞报警参数设置 : %x \r\n",JT808Conf_struct.BD_MaxSpd_preWarnValue);	
	              break;
	case   0x005E: // 侧翻报警参数设置   默认30度
		              if(infolen!=2)
						break;					
				JT808Conf_struct.BD_Laydown_Setting=(Content[0]<<8)+Content[1]; 
	                     Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
		  		rt_kprintf("\r\n侧翻报警参数设置: %x r\n",JT808Conf_struct.BD_Laydown_Setting);	
	              break;
       //---  CAMERA 
	case   0x0064://  定时拍照控制
	                        if(infolen!=4)
						break;
	                         JT808Conf_struct.BD_CameraTakeByTime_Settings=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)+Content[3];
                                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
				    rt_kprintf("\r\n 定时拍照控制: %X\r\n",JT808Conf_struct.BD_CameraTakeByTime_Settings); 			
	              break;
	case   0x0065://  定距离拍照控制
                               if(infolen!=4)
						break;
				    JT808Conf_struct.BD_CameraTakeByDistance_Settings=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8)+Content[3];
                                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
				    rt_kprintf("\r\n  定距离拍照控制: %X\r\n",JT808Conf_struct.BD_CameraTakeByDistance_Settings); 	
                     break;
	 //--- GNSS
	case    0x0090: // GNSS 定位模式 
		           	
                                   JT808Conf_struct.BD_EXT.GNSS_Mode=Content[0]; 
					  rt_kprintf("\r\n  GNSS Value= 0x%2X	\r\n",Content[0]);		   
				        switch(JT808Conf_struct.BD_EXT.GNSS_Mode)
				      	{
		                         case 0x01:  // 单 GPS 定位模式                        
								   gps_mode("2");
							          Car_Status[1]&=~0x0C; // clear bit3 bit2      1100
							          Car_Status[1]|=0x04; // Gps mode   0100
								 break;
					    case  0x02:  // 	单BD2 定位模式
					                        gps_mode("1");
								    Car_Status[1]&=~0x0C; // clear bit3 bit2 
							           Car_Status[1]|=0x08; // BD mode	1000		
						               break;
					    case  0x03: //  BD2+GPS 定位模式 
								   gps_mode("3");
								    Car_Status[1]&=~0x0C; // clear bit3 bit2 
							           Car_Status[1]|=0x0C; // BD+GPS  mode	1100	
						               break;							   	
				      	}				
                                  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
	              break;
       case    0x0091: // GNSS 波特率
	                      JT808Conf_struct.BD_EXT.GNSS_Baud=Content[0];
				switch(JT808Conf_struct.BD_EXT.GNSS_Baud)
				{ 
				    case 0x00:  //  4800
                                                  JT808Conf_struct.BD_EXT.GNSS_Baud_Value=4800;    
							//rt_thread_delay(5);						  
							//gps_write("$PCAS01,0*1C\r\n",14);	
							//rt_thread_delay(5);	
							// gps_baud( 4800 );
						        break;
				     case 0x01: //9600   --default 
				                     JT808Conf_struct.BD_EXT.GNSS_Baud_Value=9600;
							//rt_thread_delay(5);			 
                                                 //gps_write("$PCAS01,1*1D\r\n",14);	
							//rt_thread_delay(5);
							//gps_baud( 9600 );
						        break;
				     case  0x02: // 19200
				                     JT808Conf_struct.BD_EXT.GNSS_Baud_Value=19200;
							//rt_thread_delay(5);			 
                                                 //gps_write("$PCAS01,2*1E\r\n",14);	
							//rt_thread_delay(5);	
							//gps_baud( 19200 );
					               break;
				     case  0x03://  38400
                                                  JT808Conf_struct.BD_EXT.GNSS_Baud_Value=38400;
							 //rt_thread_delay(5);						  
							 //gps_write("$PCAS01,3*1F\r\n",14);	
							 //rt_thread_delay(5);	
							 //gps_baud( 38400 ); 
					               break;
				     case  0x04:// 57600
				                      JT808Conf_struct.BD_EXT.GNSS_Baud_Value=57600;
							 //rt_thread_delay(5);			  
                                                  //gps_write("$PCAS01,4*18\r\n",14);	
							 //rt_thread_delay(5);		
							 //gps_baud( 57600 );
					               break;
				     case   0x05:// 115200
				                      JT808Conf_struct.BD_EXT.GNSS_Baud_Value=115200; 
							//rt_thread_delay(5);			  
                                                 // gps_write("$PCAS01,5*19\r\n",14);	
							 //rt_thread_delay(5);	
							// gps_baud( 115200 ); 
					               break;				    				

