nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
				}
		      	 //---UART_GPS_Init(baud);  //   修改串口波特率 
		      	 rt_thread_delay(20);
                      // BD_EXT_Write();   
			rt_kprintf("\r\n 中心设置GNSS 波特率:  %d s\r\n",JT808Conf_struct.BD_EXT.GNSS_Baud_Value); 

	              break;
       case    0x0092: // GNSS 模块详细定位数据输出频率

	              break;
       case    0x0093://  GNSS 模块详细定位数据采集频率  1

	              break;
       case    0x0094:// GNSS 模块详细定位数据上传方式
                   if(Content[0]==0x01)
                       rt_kprintf("\r\n 按时间上传");
				   if(Content[0]==0x00)
                       rt_kprintf("\r\n 本地存储不上传"); 
				   
	              break;
       case    0x0095://  GNSS 模块详细上传设置
                        // GNSS_rawdata.SendDuration=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];;  // 
	              break;
	 //----CAN--
	case      0x0100://  CAN  总线通道 1  采集间隔              0   : 表示不采集 
                     if(infolen!=4)
						break;					
			CAN_trans.can1_sample_dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                     Can_RXnum=0;
			Can_sdnum=0;	
			Can_same=0; 
		     break;
	case    0x0101://  CAN  总线通道 1 上传时间间隔    0 :  表示不上传
                    if(infolen!=2)
						break;					
			CAN_trans.can1_trans_dur=(Content[0]<<8) +Content[1];
	           
	              break;
	case    0x0102://  CAN  总线通道 2  采集间隔              0   : 表示不采集 
                     if(infolen!=4)
						break;					
			CAN_trans.can2_sample_dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
	              break;
	case    0x0103://  CAN  总线通道 2 上传时间间隔    0 :  表示不上传
                     if(infolen!=2)
						break;					
			CAN_trans.can2_trans_dur=(Content[0]<<8) +Content[1];	           
	              break;
	case    0x0110://  CAN 总线ID 单独采集设置
                     CAN_trans.canid_2_NotGetID= ((Content[4]&0x1F)<<24)+(Content[5]<<16)+(Content[6]<<8) +Content[7];
		       rt_kprintf("\r\n不采集ID  0x0110= %08X\r\n",CAN_trans.canid_2_NotGetID);   		  

	            break;	
	case    0x0111://  CAN 总线ID 单独采集设置 其他
                    if(infolen!=8)
						break;		
			OutPrint_HEX("0x0111",Content,8);			
		       memcpy(	CAN_trans.canid_1,Content,8);
			memset(CAN_trans.canid_1_Rxbuf,0,sizeof(CAN_trans.canid_1_Rxbuf));
			CAN_trans.canid_1_RxWr=0;    // clear  write
			CAN_trans.canid_timer=0;
			CAN_trans.canid_0705_sdFlag=0;
           
		        //------ 解析赋值 --------
                      CAN_trans.canid_1_sample_dur=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                      if(Content[4]&0x40) // bit 30   
			 	   CAN_trans.canid_1_ext_state=1;
			 else
			 	   CAN_trans.canid_1_ext_state=0;
                       CAN_trans.canid_1_Filter_ID=((Content[4]&0x1F)<<24)+(Content[5]<<16)+(Content[6]<<8) +Content[7];

                       rt_kprintf("\r\n FilterID=%08X, EXTstate: %d   can1_samle=%d ms   canid_1_sample_dur=%dms    Trans_dur=%d s\r\n", CAN_trans.canid_1_Filter_ID, CAN_trans.canid_1_ext_state,CAN_trans.can1_sample_dur,CAN_trans.canid_1_sample_dur,CAN_trans.can1_trans_dur);
			 
	             break;
	 default:
				return false;
   }

    return true;
}

//--------------------------------------------------------------------
u8  CentreSet_subService_8105H(u32 Control_ID, u8 infolen, u8 *Content )
{

   switch(Control_ID) 
   {
      case 1:  //  无线升级参数  参数之间采用分号分隔   指令格式如下:
             /*
URL 地址；拨号名称；拨号用户名；拨号密码；地址；TCP端口；UDP端口；制造商ID; 硬件版本；固件版本；连接到指定服务器指定是服务器时限；
           若某个参数无数值，则放空
               */
             rt_kprintf("\r\n 无线升级 \r\n");  
			 rt_kprintf("\r\n 内容: %s\r\n",Content); 
		     break;
	  case 2:  // 控制终端连接指定服务器
	        /*
连接控制；监管平台鉴权码；拨号点名称； 拨号用户名；拨号密码；地址；TCP端口；UDP端口；连接到指定服务器时限
           若每个参数无数值，则放空
	         */  
	         rt_kprintf("\r\n 终端控制连接指定服务器\r\n");  
			 rt_kprintf("\r\n 内容: %s\r\n",Content);
			 break;
	  case 3:  //  终端关机
              SD_ACKflag.f_CentreCMDack_0001H=5; 
			  rt_kprintf("\r\n 终端关机 \r\n");  
	         break;
      case 4:  //  终端复位
               SD_ACKflag.f_CentreCMDack_0001H=3;
			   rt_kprintf("\r\n 终端复位 \r\n");          
	         break;
	  case 5: //   终端恢复出厂设置		 		  	       
	           /* if(SysConf_struct.Version_ID==SYSID)   //  check  wether need  update  or not 
	          	{                    
					SysConf_struct.Version_ID=SYSID+1;   
					Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					Systerm_Reset_counter=Max_SystemCounter;
					ISP_resetFlag=2;    //   借助远程下载重启机制复位系统 
	          	}
				rt_kprintf("\r\n 恢复出厂设置 \r\n"); */ 
			 break;
	  case 6: //   关闭数据通信
             SD_ACKflag.f_CentreCMDack_0001H=5; 
			 rt_kprintf("\r\n 关闭数据通信 \r\n"); 
	         break;
	  case 7: //   关闭所有无线通信
             SD_ACKflag.f_CentreCMDack_0001H=5; 
			 rt_kprintf("\r\n 关闭所有通信 \r\n");   
		     break;
	  default:
	  	     return false;			 

   }
      return  true;
}

//-------------------------------------------------------------------
void CenterSet_subService_8701H(u8 cmd,  u8*Instr)
{  
   TDateTime now;
   u32  reg_dis=0,regdis=0,reg2=0; 
  
  switch(cmd)
   {
	 case 0x82: //	  中心设置车牌号  
				memset(Vechicle_Info.Vech_VIN,0,sizeof(Vechicle_Info.Vech_VIN));
				memset(Vechicle_Info.Vech_Num,0,sizeof(Vechicle_Info.Vech_Num));
				memset(Vechicle_Info.Vech_Type,0,sizeof(Vechicle_Info.Vech_Type));	
				
				 //-----------------------------------------------------------------------
				 memcpy(Vechicle_Info.Vech_VIN,Instr,17);
				 memcpy(Vechicle_Info.Vech_Num,Instr+17,12);
				 memcpy(Vechicle_Info.Vech_Type,Instr+29,12); 

				DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));   
				WatchDog_Feed();
				DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				WatchDog_Feed();
				DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				break;
	 case 0xC2: //设置记录仪时钟
			    // 没啥用，给个回复就行，俺有GPS校准就够了 
			    //  年月日 时分秒 BCD
			    now.year=(Instr[0]>>4)*10+(Instr[0]&0x0F);  
				now.month=(Instr[1]>>4)*10+(Instr[1]&0x0F);   
				now.day=(Instr[2]>>4)*10+(Instr[2]&0x0F);  
				now.hour=(Instr[3]>>4)*10+(Instr[3]&0x0F);  
				now.min=(Instr[4]>>4)*10+(Instr[4]&0x0F);  
				now.sec=(Instr[5]>>4)*10+(Instr[5]&0x0F);      
				now.week=1;      
	            Device_RTC_set(now);    
		        break;

