nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
	 case 0xC3: //车辆速度脉冲系数（特征系数）
	              // 前6 个是当前时间
	                  now.year=(Instr[0]>>4)*10+(Instr[0]&0x0F);  
				now.month=(Instr[1]>>4)*10+(Instr[1]&0x0F);   
				now.day=(Instr[2]>>4)*10+(Instr[2]&0x0F);  
				now.hour=(Instr[3]>>4)*10+(Instr[3]&0x0F);  
				now.min=(Instr[4]>>4)*10+(Instr[4]&0x0F);  
				now.sec=(Instr[5]>>4)*10+(Instr[5]&0x0F);      
				now.week=1;      
	            Device_RTC_set(now);   
				 JT808Conf_struct.Vech_Character_Value=(Instr[6]<<8)+(u32)Instr[7]; // 特征系数  速度脉冲系数
				 JT808Conf_struct.DF_K_adjustState=0; 		
		                ModuleStatus&=~Status_Pcheck; 
	                      Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		        break;
	 case 0x83: //  记录仪初次安装时间
                
			    memcpy(JT808Conf_struct.FirstSetupDate,Instr,6); 
				Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
	            break;
	 case 0x84: // 设置信号量配置信息
	            memcpy(Setting08,Instr,80);
				break;
	  
	 case 0xC4: //   设置初始里程	
	          
            /*   Time2BCD( Original_info + Original_info_Wr );                       // 记录仪实时时间
				Original_info_Wr					+= 6;
				Original_info[Original_info_Wr++]	= 0x13;                         // 初次安装时间
				Original_info[Original_info_Wr++]	= 0x03;
				Original_info[Original_info_Wr++]	= 0x01;
				Original_info[Original_info_Wr++]	= 0x08;
				Original_info[Original_info_Wr++]	= 0x30;
				Original_info[Original_info_Wr++]	= 0x26; 
			*/
                 now.year=(Instr[0]>>4)*10+(Instr[0]&0x0F);  
				now.month=(Instr[1]>>4)*10+(Instr[1]&0x0F);   
				now.day=(Instr[2]>>4)*10+(Instr[2]&0x0F);  
				now.hour=(Instr[3]>>4)*10+(Instr[3]&0x0F);  
				now.min=(Instr[4]>>4)*10+(Instr[4]&0x0F);  
				now.sec=(Instr[5]>>4)*10+(Instr[5]&0x0F);      
				now.week=1;      
	            Device_RTC_set(now);   


			
			memcpy(JT808Conf_struct.FirstSetupDate,Instr+6,6);  
			//Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
			     // instr     + 12      设置初始里程的位置   BCD
			     
			reg_dis=(Instr[12]>>4)*10000000+(Instr[12]&0x0F)*1000000+(Instr[13]>>4)*100000+(Instr[13]&0x0F)*10000 \
			       +(Instr[14]>>4)*1000+(Instr[14]&0x0F)*100+(Instr[15]>>4)*10+(Instr[15]&0x0F);  

			  Distance_m_u32=reg_dis*100;  
			  DF_Write_RecordAdd(Distance_m_u32,DayStartDistance_32,TYPE_DayDistancAdd);
			  JT808Conf_struct.DayStartDistance_32=DayStartDistance_32;
			  JT808Conf_struct.Distance_m_u32=Distance_m_u32;	
			//Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
			//--- 初始里程
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= 0x00;
			// -- 累积里程 3个字节 单位0.1km    6位
			regdis								= JT808Conf_struct.Distance_m_u32 / 100; //单位0.1km
			reg2								= regdis / 100000;
			Original_info[Original_info_Wr++]	= 0x00;
			Original_info[Original_info_Wr++]	= ( reg2 << 4 ) + ( regdis % 100000 / 10000 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 10000 / 1000 ) << 4 ) + ( regdis % 1000 / 100 );
			Original_info[Original_info_Wr++]	= ( ( regdis % 100 / 10 ) << 4 ) + ( regdis % 10 );
			
			
		/*	chushilicheng[0]	=Instr[12];
			chushilicheng[1]	=Instr[13];
			chushilicheng[2]    =Instr[14];
			chushilicheng[3]	= Instr[15];  

			leijilicheng[0]	=Instr[16];
			leijilicheng[1]	=Instr[17];
			leijilicheng[2] =Instr[18];
			leijilicheng[3]	= Instr[19];*/
	              
	             break;
	 default:
	 	        Recode_Obj.Error=2; // 设置错误
				break;
   }

   if(Recode_Obj.Error!=2)
        VDR_product_14H(cmd);     
    
}
//-------------------------------------------
void  Media_Start_Init( u8  MdType , u8  MdCodeType)
{  
  MediaObj.Media_Type=MdType;//	指定当前传输多媒体的类型   0  表示图片
  MediaObj.Media_CodeType=MdCodeType;  //  多媒体编码格式   0  表示JPEG	格式 
  MediaObj.SD_media_Flag=1;   //  置多媒体事件信息发送标志位  ，开始图片传输  
  MediaObj.SD_Eventstate=1;		  //  开始处于发送状态 
  MediaObj.RSD_State=0;  
  MediaObj.RSD_Timer=0;
  MediaObj.RSD_total=0;
  MediaObj.RSD_Reader=0;
  MediaObj.SD_Data_Flag=0; 
  MediaObj.Media_transmittingFlag=0;      
   //------------  add  for debuging   --------------
  // Media_Clear_State();  //  clear  
 /*  if(0==MediaObj.Media_Type)
	{
	   Photo_sdState.photo_sending=enable; 
	   Photo_sdState.SD_packetNum=1; // 第一包开始  
	   rt_kprintf("\r\n 开始上传照片! ....\r\n");  												
    }
  */
   //---------------------------------------------------- 
}

void Media_Clear_State(void)
{
     // 不清楚Meia Type
    MediaObj.MaxSd_counter=0;
    MediaObj.SD_Eventstate=0;
    MediaObj.SD_timer=0;
    MediaObj.SD_media_Flag=0;	
	MediaObj.SD_Data_Flag=0; 
	MediaObj.RSD_State=0;
	MediaObj.RSD_Timer=0;
	MediaObj.RSD_total=0;
	MediaObj.RSD_Reader=0;
	MediaObj.Media_transmittingFlag=0;
}
void  Media_Timer(void)
{
  if(1==MediaObj.SD_Eventstate) 
  	{
  	  MediaObj.SD_timer++;
      if(MediaObj.SD_timer>6) 
      	{
            MediaObj.SD_timer=0;			
            MediaObj.SD_media_Flag=1; 
			MediaObj.MaxSd_counter++;
			if(MediaObj.MaxSd_counter>5)
                   Media_Clear_State();  
      	}

  	}
}
void Media_RSdMode_Timer(void)
{
    if((1==MediaObj.RSD_State))
	   	{ 
	        MediaObj.RSD_Timer++;
			if(MediaObj.RSD_Timer>12)
				{
	              MediaObj.RSD_Timer=0;
				  MediaObj.SD_Data_Flag=1; // 置重传发送多媒体信息标志位
				  switch(MediaObj.Media_Type)    //   图片重传包数
				  	{
				  	 case 0://  图像
				  	         Photo_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                         Photo_sdState.SD_flag=1;
							  rt_kprintf("\r\n 补报 %d 包\r\n",Photo_sdState.SD_packetNum); 
							 break;
					 case 1:// 音频                             
				  	         Sound_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                         Sound_sdState.SD_flag=1;  
					         break;
				  #if 0			 
					 case 2:// 视频
							 Video_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
							 Video_sdState.SD_flag=1;  					          
					         break;
				 #endif			 
				     default:
					 	     break;

