nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

 void Media_Timer_Service(void)
{
       //----------------------------------
   if(DataLink_Status()&&(DEV_Login.Operate_enable==2))
   {
     if(Photo_sdState.photo_sending==enable)
	  Photo_Timer(); 
	 
	 #ifdef REC_VOICE_ENABLE
	 else 
	 if(Sound_sdState.photo_sending==enable)	 
	  Sound_Timer(); 
	 #endif
	// else
	 // Video_Timer();  	 
	  Media_RSdMode_Timer(); 
   }   
}

#endif

//------------------------------------------------------------
void DataTrans_Init(void)
{
   DataTrans.Data_RxLen=0; 
   DataTrans.Data_TxLen=0;
   DataTrans.Tx_Wr=0; 
   memset(DataTrans.DataRx,0,sizeof((const char*)DataTrans.DataRx));   
   memset(DataTrans.Data_Tx,0,sizeof((const char*)DataTrans.Data_Tx)); 
}
//------------------------------------------------------------
void DoorCameraInit(void)
{
   DoorOpen.currentState=0;
   DoorOpen.BakState=0;
}
//-----------------------------------------------------------
void Spd_ExpInit(void)
{
   speed_Exd.current_maxSpd=0;
   speed_Exd.dur_seconds=0;
   speed_Exd.excd_status=0;   
   memset((char*)(speed_Exd.ex_startTime),0,5);
   speed_Exd.speed_flag=0;
}

//  河北天地通多媒体事件信息上传报文应答不好，所以单独处理  
 void Multimedia_0800H_ACK_process(void)
 {
      						 Media_Clear_State();  //  clear 
											 
                                            if(0==MediaObj.Media_Type)
											{
											   MediaObj.Media_transmittingFlag=1; 
											   PositionSD_Enable(); 
											   Current_UDP_sd=1;
											   
											   Photo_sdState.photo_sending=enable; 
											   Photo_sdState.SD_packetNum=1; // 第一包开始 
											   PositionSD_Enable();  //   使能上报
											   rt_kprintf("\r\n 开始上传照片! ....\r\n");   												
                            	            }
											else
											if(1==MediaObj.Media_Type)
											{
											   MediaObj.Media_transmittingFlag=1;  
											   
											   Sound_sdState.photo_sending=enable; 
											   Sound_sdState.SD_packetNum=1; // 第一包开始 
											   PositionSD_Enable();  //   使能上报 
											   Current_UDP_sd=1;
											   rt_kprintf("\r\n 开始上传音频! ....\r\n");    												
                            	            }	
										/*	else
											if(2==MediaObj.Media_Type)
											{
											   MediaObj.Media_transmittingFlag=1;   
											   PositionSD_Enable();  //   使能上报
											   Current_UDP_sd=1;
											   Video_sdState.photo_sending=enable; 
											   Video_sdState.SD_packetNum=1; // 第一包开始   
											   rt_kprintf("\r\n 开始上传视频! ....\r\n");    	
									   
                            	            }	
										*/	

 }

u16  Instr_2_GBK(u8 *SrcINstr, u16 Inlen, u8* DstOutstr )
{
  u16 i=0,j=0;
  
	
	//对非GBK编码处理------------------------------------
	for(i=0,j=0;i<Inlen;i++)
		{
		if((SrcINstr[i]>=0xA1)&&(SrcINstr[i+1]>=0xA0))
			{
			DstOutstr[j]=SrcINstr[i];
			DstOutstr[j+1]=SrcINstr[i+1];
			j+=2;
			i++;
			}
		else
			{
			DstOutstr[j]=' ';
			DstOutstr[j+1]=SrcINstr[i];
			j+=2;
			}
		}
	return   j;		    					
}


//-----------------------------------------------------------
void TCP_RX_Process( u8  LinkNum)  //  ---- 808  标准协议 
{
  	  u16	i=0,j=0;//,DF_PageAddr;
	  u16  infolen=0,contentlen=0; 
	  u8  ISP_judge_resualt=0;
	  u32 HardVersion=0;
	 // u8   ireg[5]; 
	  u8   Ack_Resualt=1;
	  u16  Ack_CMDid_8001=0;
	  u8   Total_ParaNum=0;        // 中心设置参数总数 
	  u8   Process_Resualt=0;  //  bit 表示   bit0 表示 1  bit 1 表示2
	  u8   ContentRdAdd=0;   // 当前读取到的地址
	  u8   SubInfolen=0;     // 子信息长度
	  u8   Reg_buf[22];
	  u8   CheckResualt=0;
      u32  reg_u32=0;
	  u16  GB19056infolen=0;  
  //----------------      行车记录仪808 协议 接收处理   -------------------------- 

  //  0.  Decode     
  Protocol_808_Decode();
  //  1.  fliter head
  if(UDP_HEX_Rx[0]!=0x7e)           //   过滤头 
  	   return; 
  //  2.  check Centre Ack
  Centre_CmdID=(UDP_HEX_Rx[1]<<8)+UDP_HEX_Rx[2];  // 接收到中心消息ID   
  Centre_FloatID=(UDP_HEX_Rx[11]<<8)+UDP_HEX_Rx[12];  // 接收到中心消息流水号        


  //  3.   get infolen    ( 长度为消息体的长度)    不分包的话  消息头长度为12 则参与计算校验的长度 =infolen+12
  //infolen =( u16 )((UDP_HEX_Rx[3]&0x3f) << 8 ) + ( u16 ) UDP_HEX_Rx[4];  
  infolen =( u16 )((UDP_HEX_Rx[3]&0x03) << 8 ) + ( u16 ) UDP_HEX_Rx[4];  
  contentlen=infolen+12;    //  参与校验字节的长度   

  //  4.   Check  Fcs 
  
	  FCS_RX_UDP=0; 
  	  //nop;nop;
	  for ( i=0;i<(UDP_DecodeHex_Len-3); i++ ) //先算出收到数据的异或和   
		  {
			  FCS_RX_UDP^=UDP_HEX_Rx[1+i];	  
		  } 
	  //nop;
	  // ------- FCS filter -----------------
	  if( UDP_HEX_Rx[UDP_DecodeHex_Len-2]!=FCS_RX_UDP ) //判断校验结果	    
		  {
			  rt_kprintf("\r\n  Protocolinfolen=%d   UDP_hexRx_len=%d",infolen,UDP_hexRx_len);  
			  rt_kprintf("\r\n808协议校验错误	  Caucate %x  ,RX  %x\r\n",FCS_RX_UDP,UDP_HEX_Rx[UDP_DecodeHex_Len-2]); 
			 // OutPrint_HEX("UDP_HEX_RX",UDP_HEX_Rx,UDP_DecodeHex_Len);
				//-----------------  memset  -------------------------------------
			  memset(UDP_HEX_Rx, 0, sizeof(UDP_HEX_Rx));    
			  UDP_hexRx_len= 0; 
			  return; 
		  }		  
	//  else		  
		 // rt_kprintf("\r\n 808协议校验正确	  Caucate %x  ,RX  %x\r\n",FCS_RX_UDP,UDP_HEX_Rx[UDP_DecodeHex_Len-2]);	   
   
 //   5 .  Classify  Process 
         rt_kprintf("\r\n           CentreCMD = 0x%X  \r\n",Centre_CmdID);  // add for  debug  
         
     switch(Centre_CmdID)
     	{
     	   case  0x8001:  //平台通用应答
     	             // 若没有分包处理的话  消息头长12  从0开始计算第12个字节是消息体得主体

					  //  13 14  对应的终端消息流水号  
					  //  15 16  对应终端的消息
                       Ack_CMDid_8001=(UDP_HEX_Rx[15]<<8)+UDP_HEX_Rx[16];

					   switch(Ack_CMDid_8001)   // 判断对应终端消息的ID做区分处理
					   	{ 
					   	   case 0x0200:    //  对应位置消息的应答
                                      //----- 判断确认是否成功
						              if(0x00!=UDP_HEX_Rx[17])
									  	 break;
									  //--------------------------------
									  if (Warn_Status[3]&0x01) 
									  {
											  StatusReg_WARN_Clear();			  
											  f_Exigent_warning = 0;
											  warn_flag=0;
											  Send_warn_times=0; 
											   StatusReg_WARN_Clear();	
											   rt_kprintf( "\r\n紧急报警收到应答，得清除!\r\n");   
									  }

									  if((Warn_Status[0]&0x20)==0x20) 
								     {
                                             Warn_Status[0]&=~0x20; 
											 rt_kprintf( "\r\n碰撞侧翻收到应答，得清除!\r\n");  
									 } 
									  //------------------------------------  
										rt_kprintf( "\r\nCentre ACK!\r\n");  	
									    Api_cycle_Update();   
									   //-------------------------------------------------------------------
									  /* cycle_read++;   //  收到应答才递增
									   if(cycle_read>=Max_CycleNum)
											   cycle_read=0;
									   ReadCycle_status=RdCycle_Idle;
                                                                 */
                                        //--------------  多媒体上传相关  --------------                                       
									   if(MediaObj.Media_transmittingFlag==1)  // clear									      
									      {
									         MediaObj.Media_transmittingFlag=2;   
											 if(Duomeiti_sdFlag==1)
											  { 
											      Duomeiti_sdFlag=0; 
											      Media_Clear_State();
												Photo_send_end();
												#ifdef REC_VOICE_ENABLE
												Sound_send_end();
												#endif
                                                                                     rt_kprintf("\r\n  手动上报多媒体上传处理\r\n");
											  }	
											 rt_kprintf("\r\n  多媒体信息前的多媒体发送完毕 \r\n");  
									   	  }	
									   
								       break;
				  case 0x0002:  //  心跳包的应答
                                       //  不用判结果了  ---     
                                        JT808Conf_struct.DURATION.TCP_ACK_DurCnter=0;//clear
                                        JT808Conf_struct.DURATION.TCP_SD_state=0; //clear
                                         rt_kprintf( "\r\n  Centre  Heart ACK!\r\n");  
							           break;
                            case 0x0101:  //  终端注销应答
                            case 0x0003:
                                        if(0==UDP_HEX_Rx[17])
                                        {  // 注销成功
                                          
