nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
						   rt_kprintf("\r\n 信息服务内容:%s\r\n",TextInfo.TEXT_Content); 
                          //------- 返回 ----
						 //  if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     Ack_Resualt=0;
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
                         }
		              break;	
		   case  0x8400:    //  电话回拨
                       
					   if(infolen==0)
							 break;
					   if(0==UDP_HEX_Rx[13])   // 普通通话
					   	{   Speak_ON;rt_kprintf("\r\n   电话回拨-->普通通话\r\n");}
					   else
					   if(1==UDP_HEX_Rx[13])  //  监听
					    {  Speak_OFF;rt_kprintf("\r\n   电话回拨-->监听"); } 
					   else
					       break;
	 					  memset(JT808Conf_struct.LISTEN_Num,0,sizeof(JT808Conf_struct.LISTEN_Num));
	 					  memcpy(JT808Conf_struct.LISTEN_Num,UDP_HEX_Rx+14,infolen-1);  										  
                                            Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
                                            CallState=CallState_rdytoDialLis;  // 准备开始拨打监听号码 

						 // if(SD_ACKflag.f_CentreCMDack_0001H==0)
						 {
						     SD_ACKflag.f_CentreCMDack_0001H=1;
							 SD_ACKflag.f_CentreCMDack_resualt=0;      
                         }
		              break;
		   case  0x8401:  //   设置电话本
                      
					  switch(UDP_HEX_Rx[13])
					  {
						 case 0 :  //  删除终端现有所有信息
								  // PhoneBook_Init(1); 
								   rt_kprintf("\r\n 删除电话本\r\n"); 
								   break;
						 case 1:  // 更新菜单
						          if(UDP_HEX_Rx[13]==1)
									 	 rt_kprintf("\r\n 更新电话本\r\n"); 
						 case 3:  // 修改菜单
						           if(UDP_HEX_Rx[13]==3)
									 	 rt_kprintf("\r\n 修改电话本\r\n"); 
						           Rx_PhoneBOOK.CALL_TYPE=UDP_HEX_Rx[15]; // 标志 ，呼入呼出
                                   Rx_PhoneBOOK.NumLen=UDP_HEX_Rx[16];								   
								   memset(Rx_PhoneBOOK.NumberStr,0,sizeof(Rx_PhoneBOOK.NumberStr)); 
								   memcpy(Rx_PhoneBOOK.NumberStr,UDP_HEX_Rx+17,Rx_PhoneBOOK.NumLen);
								   
								   contentlen=UDP_HEX_Rx[17+Rx_PhoneBOOK.NumLen]; 								   
								   memset(Rx_PhoneBOOK.UserStr,0,sizeof(Rx_PhoneBOOK.UserStr));	
								     //----  Instr  转 GBK ----------------------
						           Rx_PhoneBOOK.UserLen=Instr_2_GBK(UDP_HEX_Rx+18+Rx_PhoneBOOK.NumLen,contentlen,Rx_PhoneBOOK.UserStr);	
								   //memcpy(Rx_PhoneBOOK.UserStr,UDP_HEX_Rx+18+Rx_PhoneBOOK.NumLen,Rx_PhoneBOOK.UserLen);
								   
								   for(i=0;i<8;i++)
								   {
                                    PhoneBook.CALL_TYPE=2; //类型定义为输出 
								    PhoneBook.NumLen=0;    // 号码长度
								    memset(PhoneBook.NumberStr,0,sizeof(PhoneBook.NumberStr));  
								    PhoneBook.UserLen=0;		
								    memset(PhoneBook.UserStr,0,sizeof(PhoneBook.UserStr)); 	 
									   Api_RecordNum_Write(phonebook, i+1, (u8*)&PhoneBook,sizeof(PhoneBook)); 
									if(strncmp((char*)PhoneBook.UserStr,(const char*)Rx_PhoneBOOK.UserStr,Rx_PhoneBOOK.UserLen) == 0) 
									{ // 找到相同名字的把以前的删除用新的代替
									   Api_RecordNum_Write(phonebook, i+1, (u8*)&Rx_PhoneBOOK,sizeof(Rx_PhoneBOOK)); 
									   break;  // 跳出for 
									}

								   }
								   break;
						 case 2:  // 追加菜单	
						          if(UDP_HEX_Rx[13]==2)
									 	 rt_kprintf("\r\n 追加电话本\r\n"); 
						           Rx_PhoneBOOK.CALL_TYPE=UDP_HEX_Rx[15]; // 标志 ，呼入呼出
                                   Rx_PhoneBOOK.NumLen=UDP_HEX_Rx[16];								   
								   memset(Rx_PhoneBOOK.NumberStr,0,sizeof(Rx_PhoneBOOK.NumberStr)); 
								   memcpy(Rx_PhoneBOOK.NumberStr,UDP_HEX_Rx+17,Rx_PhoneBOOK.NumLen);
								 //  Rx_PhoneBOOK.UserLen=UDP_HEX_Rx[17+Rx_PhoneBOOK.NumLen]; 								   
								 //  memset(Rx_PhoneBOOK.UserStr,0,sizeof(Rx_PhoneBOOK.UserStr));		
								   Rx_PhoneBOOK.Effective_Flag=1; // 有效标志位  
								  // memcpy(Rx_PhoneBOOK.UserStr,UDP_HEX_Rx+18+Rx_PhoneBOOK.NumLen,Rx_PhoneBOOK.UserLen);	
								   //---------------------------------------------------  
								   contentlen=UDP_HEX_Rx[17+Rx_PhoneBOOK.NumLen]; 								   
								   memset(Rx_PhoneBOOK.UserStr,0,sizeof(Rx_PhoneBOOK.UserStr));	
								     //----  Instr  转 GBK ----------------------
						           Rx_PhoneBOOK.UserLen=Instr_2_GBK(UDP_HEX_Rx+18+Rx_PhoneBOOK.NumLen,contentlen,Rx_PhoneBOOK.UserStr);	
								   //memcpy(Rx_PhoneBOOK.UserStr,UDP_HEX_Rx+18+Rx_PhoneBOOK.NumLen,Rx_PhoneBOOK.UserLen);
                                   //-------------------------------------------
								   
								   Api_RecordNum_Write(phonebook, UDP_HEX_Rx[14], (u8*)&Rx_PhoneBOOK, sizeof(Rx_PhoneBOOK)); 
                                                           rt_kprintf("\r\n Name:%s\r\n",Rx_PhoneBOOK.UserStr); 
								   rt_kprintf("\r\n Number:%s\r\n",Rx_PhoneBOOK.NumberStr);
								   break;
						 default:
								   break;
					  
					  }

					   
					// if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
					 
			          break;
           case  0x8500:    //  车辆控制
                      Vech_Control.Control_Flag=UDP_HEX_Rx[13];
					  if(UDP_HEX_Rx[13]&0x01)
					  	{ // 车门加锁       bit 12
                            Car_Status[2]|=0x10;     // 需要控制继电器
							rt_kprintf("\r\n  车辆加锁 \r\n"); 
					  	}
					  else
					  	{ // 车门解锁
                            Car_Status[2]&=~0x10;    // 需要控制继电器
                            rt_kprintf("\r\n  车辆解锁 \r\n"); 
					  	}					  
					  Vech_Control.ACK_SD_Flag=1;    
		              break;
		   case  0x8600:    //  设置圆形区域
                       rt_kprintf("\r\n  设置圆形区域 \r\n"); 
		              if(UDP_HEX_Rx[14]==1)  //  现在支持设置一个区域
		              { 
	                       switch(UDP_HEX_Rx[13])
	                       	{	                       	      
		                          case 1:  // 追加区域
                                           for(i=0;i<8;i++)
                                           	{                                                
												memset((u8*)&Rail_Cycle,0,sizeof(Rail_Cycle));
												Api_RecordNum_Write(Rail_cycle,Rail_Cycle.Area_ID, (u8*)&Rail_Cycle,sizeof(Rail_Cycle)); 	 
                                                Rails_Routline_Read();  
												if(Rail_Cycle.Area_attribute) // 找出来未使用的
													break;
                                           	}
										   if(8==i)  //  如果都满了，那么用 0
										   	{
										   	  i=0;
										   	}
								         
