nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                                  /*
                                                             exam1  gghypt: 7E 87 00 00 15 01 39 01 23 45 03 01 A1 09 AA 75 09 00 0E 00 13 01 01 01 01 01 14 01 01 01 01 01 0A  D5 67 7E
                                                             exam2   cctic:   7E 87 00 00 01 01 36 01 30 00 01 C9 47 15 1A 7E
                                                            */

								   //------ 判断有没有起始时间 -----------
								   Recode_Obj.Get_withDateFlag=0;   // 初始化没有 GB19056 报文 
                                  if((UDP_HEX_Rx[14]==0xAA)&&(UDP_HEX_Rx[15]==0x75)&&(UDP_HEX_Rx[13]==UDP_HEX_Rx[16])) 
                                  {   // 判断该字段是否有 GB19056 2012 的字段内容  ，协议里写可为空，
                                      // 然后判断中心下发的命令字和GB19056 里的命令字是否一致
                                      GB19056infolen=(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];
									  if(GB19056infolen==0x0E)   // 长度是14  
									  switch(UDP_HEX_Rx[16])
									  	{  // 判断ID 是否是  08 -15 
									  	    case 0x08:
										    case 0x09:
										    case 0x10:
										    case 0x11:
										    case 0x12:
										    case 0x13:
										    case 0x14:
										    case 0x15: 	  
												for(i=0;i<6;i++)
													{
										  	            Recode_Obj.Get_startDate[i]=UDP_HEX_Rx[20+i];  
														Recode_Obj.Get_endDate[i]=UDP_HEX_Rx[26+i];  

													}
											  Recode_Obj.Get_recNum=(UDP_HEX_Rx[31]<<8)+UDP_HEX_Rx[32];  // 获取的条数
											  Recode_Obj.Get_withDateFlag= 1; 

                                                      // ---  记录仪获取采集指定日志时间-- 
											     if(UDP_HEX_Rx[16]==0x15)
															VDR_get_15H_StartEnd_Time(UDP_HEX_Rx+20,UDP_HEX_Rx+26);
							

											  rt_kprintf( "\r\n  记录仪8700 带AA 75 start   %2X-%2X-%2X  %2X:%2X:%2X\r\n",UDP_HEX_Rx[20],UDP_HEX_Rx[21],UDP_HEX_Rx[22],UDP_HEX_Rx[23],UDP_HEX_Rx[24],UDP_HEX_Rx[25]);
											  rt_kprintf( "\r\n                     end     %2X-%2X-%2X  %2X:%2X:%2X  GetNUM: %d \r\n",UDP_HEX_Rx[26],UDP_HEX_Rx[27],UDP_HEX_Rx[28],UDP_HEX_Rx[29],UDP_HEX_Rx[30],UDP_HEX_Rx[31],Recode_Obj.Get_recNum); 
											  break;
										   default:
                                                      Recode_Obj.Get_withDateFlag=0;
											          break;
										}
                                         


								  
                                  }
								  
								  //Recode_Obj.CMD=UDP_HEX_Rx[13];   
								  //	Stuff  Hardly
								  switch( UDP_HEX_Rx[13] )
								  {
									  case 0x00:
									  case 0x01:
									  case 0x02:
									  case 0x03:	
									  case 0x04:
									  case 0x05:
									  case 0x06:
									  case 0x07:	
									  case 0x08:
									  case 0x09:
									  case 0x10:
									  case 0x11:
									  case 0x12:
									  case 0x13:
									  case 0x14:
									  case 0x15: 	  
									  	  Recode_Obj.CMD   = UDP_HEX_Rx[13]; 
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1; 
										  break;
									  //--------- Lagre  block -------
								  
								  
									  /*
									        cmd 		maxnum
									        15H	       2
									        12H 	10
										 11H 	10
										 10H  	100
										 09H 	360
										 08H 	576								  
									   */
									/*  case	0x08:  Recode_Obj.Total_pkt_num   = 20;//720;
										  Recode_Obj.Current_pkt_num		  = 1;
										  Recode_Obj.Devide_Flag			  = 1;
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  MediaObj.Media_Type	  = 3; //行驶记录仪
										  break;
								  
									  case	0x09:  Recode_Obj.Total_pkt_num   =15; // 720;
										  Recode_Obj.Current_pkt_num		  = 0; //0
										  Recode_Obj.Devide_Flag			  = 1;
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  MediaObj.Media_Type	  = 3; //行驶记录仪
										  break;
									  case	0x10:
										  Recode_Obj.Total_pkt_num	  =10;// 100;
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type	  = 3; //行驶记录仪
										  break;
									  case	0x11:
										  Recode_Obj.Total_pkt_num	  = 10;//100;
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  Recode_Obj.CMD			  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag	  = 1;
										  Recode_Obj.CountStep		  = 1;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type		  = 3; //行驶记录仪
										  break;
									  case	0x12:
										  Recode_Obj.Total_pkt_num	  = 10;
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  Recode_Obj.CMD			  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag	  = 1;
										  Recode_Obj.CountStep		  = 1;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type		  = 3; //行驶记录仪
										  break;
									  case	0x13:
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  break;
									  case	0x14:
										  //--------------------------------
										  Recode_Obj.CMD		  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag = 1;
										  Recode_Obj.CountStep	  = 1;
										  break;
									  case	0x15:
										  Recode_Obj.Current_pkt_num  = 1;
										  Recode_Obj.Devide_Flag	  = 1;
										  Recode_Obj.CMD			  = UDP_HEX_Rx[13];
										  Recode_Obj.SD_Data_Flag	  = 1;
										  Recode_Obj.CountStep		  = 1;
										  Recode_Obj.Total_pkt_num	  = 2;
										  Recode_Obj.fcs			  = 0;
										  MediaObj.Media_Type		  = 3;						  //行驶记录仪
										  break;*/
									   default:
									   	      Recode_Obj.Error=1;  //  采集错误
												  break;
										 }
		              break;
		   case  0x8701:    //  行驶记录仪参数下传命令
		               rt_kprintf("\r\n  记录仪参数下传 \r\n");
		               Recode_Obj.Float_ID=Centre_FloatID;
					   Recode_Obj.CMD=UDP_HEX_Rx[13];    
					   Recode_Obj.SD_Data_Flag=1;  
					   CenterSet_subService_8701H(Recode_Obj.CMD,UDP_HEX_Rx+14); //跳过2B长度和1 保留字
			          break; 
		   case  0x8800:    //   多媒体数据上传应答
		              if(infolen==5)
		              	{  //  判断是否有重传ID列表，如果没有则表示中心接收完成!						
                                switch (MediaObj.Media_Type)
						         {
						          case 0 : // 图像
						                  Photo_send_end();  // 拍照上传结束
						                  rt_kprintf("\r\n 图像传输结束! \r\n");
                                          //------------多路拍照处理  -------
                                          CheckResualt=Check_MultiTakeResult_b4Trans();  
						                 				   
								          break;
								  case 1 : // 音频
								         #ifdef REC_VOICE_ENABLE
								          Sound_send_end();
										  rt_kprintf("\r\n 音频传输结束! \r\n");
										  #endif
								          break;
							
								  default:
								  	      break;
						         }
						 if(CheckResualt==0)	
						   	   Media_Clear_State();  
		              	}
					  else
					  	{  //  重传包ID 列表 
					  	  //if(UDP_HEX_Rx[17]!=0)
						  if((UDP_HEX_Rx[17]!=0)&&(MultiTake.Taking==0))
					  	  {
						  	   MediaObj.RSD_State=1;   //   进入重传状态
						  	   MediaObj.RSD_Timer=0;   //   清除重传定时器   
						  	   MediaObj.RSD_Reader=0;
							   MediaObj.RSD_total=UDP_HEX_Rx[17];    // 重传包总数 


						  	   memset(MediaObj.Media_ReSdList,0,sizeof(MediaObj.Media_ReSdList));                       
						       //   获取重传列表 
							   j=0;			
                               // 根据总包数后边第一个字节区分是老版本还是新版本
                               if(UDP_HEX_Rx[18]!=0)   // 老版本
                               {
									   for(i=0;i<MediaObj.RSD_total;i++)
									   	{
											//----- 天地通-----									
		                                    MediaObj.Media_ReSdList[i]=UDP_HEX_Rx[18+i]; 
										}		
                               	}
							   else
							   	{          //  新版本协议                                   
									 for(i=0;i<MediaObj.RSD_total;i++)
									  {
										  // formal
										  MediaObj.Media_ReSdList[i]=(UDP_HEX_Rx[18+j]<<8)+UDP_HEX_Rx[19+j];
										  j+=2;
									  } 
							   	}
							   
	                           rt_kprintf("\r\n  8800 重传列表Total=%d: ",MediaObj.RSD_total);
							   for(i=0;i<MediaObj.RSD_total;i++)
							         rt_kprintf("%d,",MediaObj.Media_ReSdList[i]);   
							   rt_kprintf("\r\n");   

