nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					  	   } 
						}
                        
		              break;
					  //---------  BD  add -------------------------------
			 case  0x8003: // BD--8.4 分包请求上传
												// nouse	Detach_PKG.Original_floatID=(UDP_HEX_Rx[13]<<8)+UDP_HEX_Rx[14];//原始消息流水号
								  MediaObj.RSD_State=1;   //   进入重传状态
						  	      MediaObj.RSD_Timer=0;   //   清除重传定时器   
						  	      MediaObj.RSD_Reader=0;				
								  MediaObj.RSD_total=UDP_HEX_Rx[15];
								  //  重传列表
								  reg_u32=0;// 借用做下标计数器
								  for(i=3;i<infolen;i+=2)
								  {
									 MediaObj.Media_ReSdList[reg_u32]=(UDP_HEX_Rx[16+2*reg_u32]<<24)+UDP_HEX_Rx[17+2*reg_u32+1];
									 reg_u32++; 
								  }

								 rt_kprintf("\r\n  8003 重传列表Total=%d: ",MediaObj.RSD_total);
							     for(i=0;i<MediaObj.RSD_total;i++)
							         rt_kprintf("%d,",MediaObj.Media_ReSdList[i]);  
							     rt_kprintf("\r\n");  
					  
									   {
									   SD_ACKflag.f_CentreCMDack_0001H=1;
									   Ack_Resualt=0;
									   SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
									 }	  
								   
								break;	  		   
					  
		   case  0x8801:   //    摄像头立即拍照		  

				     Camera_Obj.Channel_ID=UDP_HEX_Rx[13];     //   通道
					 Camera_Obj.Operate_state=UDP_HEX_Rx[18];  //   是否保存标志位  
		            //----------------------------------
				   
					if((Camera_Take_Enable())&&(Photo_sdState.photo_sending==0)) //图片传输中不能拍
					{
					   Camera_Number=UDP_HEX_Rx[13];
					   if((Camera_Number>Max_CameraNum)&&(Camera_Number<1)) 
						  break;
					 
					   Start_Camera(Camera_Number);   //开始拍照  
					   SingleCamera_TakeRetry=0;   // clear 
					}	   
					rt_kprintf("\r\n   中心及时拍照  Camera: %d    \r\n",Camera_Number);	

                                    if(UDP_HEX_Rx[18]==0x01)    // 拍照不上传
                                      {    
                                          Camera_Take_not_trans=1;
                                           rt_kprintf("\r\n   拍照不上传\r\n");
                                      }				
					else
						Camera_Take_not_trans=0;  
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt; 
 					 }
                      break;
		   case  0x8802:   //    存储多媒体数据检索
		                 SD_ACKflag.f_QueryEventCode=UDP_HEX_Rx[15];    
                         switch(UDP_HEX_Rx[13])
                         {
                            case 0:  // 图像
                                     SD_ACKflag.f_MediaIndexACK_0802H=1;
									 rt_kprintf("\r\n  中心查询图像索引 \r\n");   
							       break;
							case 1:  //  音频
                                     SD_ACKflag.f_MediaIndexACK_0802H=2;
									  rt_kprintf("\r\n  中心查询音频索引 \r\n"); 	 
							case 2:  //  视频
							         SD_ACKflag.f_MediaIndexACK_0802H=3;
						    default:
								     break; 
						}						 
						
		              break;
		   case  0x8803:   //    存储多媒体数据上传命令
                      rt_kprintf("\r\n 多媒体数据上传\r\n"); 
                       switch(UDP_HEX_Rx[13])
                         {
                            case 0:  // 图像
									 rt_kprintf("\r\n   上传固有图片\r\n");    
							       break;
							case 1:  //  音频
                                    // MP3_send_start();
									  rt_kprintf("\r\n  上传固有音频 \r\n"); 
								   break;	  
							case 2:  //  视频
							        // Video_send_start();
							         // MP3_send_start();
									  rt_kprintf("\r\n  上传固有视频  不操作了 用音频\r\n"); 
								   break;	  
						    default:
								     break; 
						}				
					  
                     //----------------------------------------------------------
                     // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8804:   //    录音开始命令
		   
		            //#if  1			     
                       switch(UDP_HEX_Rx[13])
                       	{ 
                       	  case 0x00:  // 停录音

						            break;
						  case 0x01:  // 开始录音
                                     #ifdef REC_VOICE_ENABLE                  
								       VOC_REC_Start();	 
									 #endif		
							        break;

                       	}
					  
					      
					  //------------------------------
					 //if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;

		 case  0x8900:   //    数据下行透传                      
                                   switch(UDP_HEX_Rx[13]) // 透传消息类型  // BD
                                   {
                                         case  0x41 : // 串口1  透传消息
                                               rt_kprintf("\r\n 串口1 透传:"); 
                                                  for(i=0;i<(infolen-1);i++)
                                                       rt_kprintf("%c",UDP_HEX_Rx[14+i]);   
											   rt_kprintf("\r\n");  	  
												  	   
								         break;
									case  0x42:  //  串口2 透传消息
									           rt_kprintf("\r\n 串口2 透传:"); 
                                               for(i=0;i<(infolen-1);i++)
                                                       rt_kprintf("%c",UDP_HEX_Rx[14+i]);   
											   rt_kprintf("\r\n");  

									                   break;
									case  0x0B:  //  IC  卡 信息
                                    /*                         memcpy(IC_MOD.IC_Rx,UDP_HEX_Rx+14,infolen-1);
								     rt_kprintf("\r\n IC 卡透传len=%dBytes  RX:",infolen-1);
									 for(i=0;i<infolen-1;i++)
									 	rt_kprintf("%2X ",UDP_HEX_Rx[14+i]); 
								     rt_kprintf("\r\n");	 
                                                             //------ 直接发送给IC 卡模块-----
                                                             Reg_buf[0]=0x00;
								     memcpy(Reg_buf,IC_MOD.IC_Rx,infolen-1);
                                                             DeviceData_Encode_Send(0x0B,0x40,Reg_buf,infolen); 									 
						                   return;  */
						                   break;

