nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
										//firmware
										if(strncmp(BD_ISP.ContentData+32+42,"TJGGHYPT",8)==0)  
										{
										   ISP_judge_resualt++;// step 3
										   rt_kprintf("\r\n  固件版本:TJGGHYPT\r\n");   
										}
										// operater
										if(strncmp(BD_ISP.ContentData+32+62,"TJGTGS",6)==0)  
										{
										   ISP_judge_resualt++;// step 4
										   rt_kprintf("\r\n  固件版本:TJGTGS\r\n");       
										}
										
                                   	}

								  
								  //  根据判断是否是本机的然后进行操作，如不是返回取消    
								  // 若是 第一包，擦除相关区域
								  if(ISP_judge_resualt==4) 
								     DF_Erase();  
								  else
								  	{									  	
	                                  SD_ACKflag.f_BD_ISPResualt_0108H=3;  // 取消
	                                  rt_kprintf("\r\n 类型不匹配失败!\r\n");  
									  break; 
								  	}

								  
						}		
						else
							 i=17; 
						   //3. --------  升级包内容  -------------		
                           if(BD_ISP.CurrentPacket_Num!=BD_ISP.Total_PacketNum)
								 BD_ISP.PacketSizeGet=infolen;
						   
						   if(infolen) //  升级内容以后根据类型往不同的存储区域写
                            {
                                  memcpy(BD_ISP.ContentData,UDP_HEX_Rx+i,infolen); // 升级包内容
                                  BD_ISP.PacketRX_wr+=infolen;
                                  //---- 替换更新标志-----
                                  if(BD_ISP.CurrentPacket_Num==1)
								  	     BD_ISP.ContentData[32]=ISP_BYTE_StartValue;        
								  
								  // OutPrint_HEX("Write",BD_ISP.ContentData,infolen);   
                                  //  判断写入地址
                                  if(((BD_ISP.CurrentPacket_Num-1)*BD_ISP.PacketSizeGet)>257024) //257024=251*1024
                                  	{                                  	
									     SD_ACKflag.f_BD_ISPResualt_0108H=3;  // 取消
									    rt_kprintf("\r\n 地址偏出区域 --异常 ，失败!\r\n"); 
								  	    break;
                                  	}	
								  
                                  //  write area   
                                  WatchDog_Feed();
                                  SST25V_BufferWrite(BD_ISP.ContentData,ISP_StartArea+(BD_ISP.CurrentPacket_Num-1)*BD_ISP.PacketSizeGet,infolen);
								  //delay_ms(160);
								  rt_thread_delay(12);  
								  WatchDog_Feed();
                            

								  // read 
								  memset(ISP_buffer,0,sizeof(ISP_buffer));
								  SST25V_BufferRead(ISP_buffer,ISP_StartArea+(BD_ISP.CurrentPacket_Num-1)*BD_ISP.PacketSizeGet,infolen); 
								  //delay_ms(120);
								  rt_thread_delay(8); 

								  for(i=0;i<infolen;i++)
								  {
                                     if(BD_ISP.ContentData[i]!=ISP_buffer[i])
                                     	{
                                          rt_kprintf("\r\n ISP error at :%d   wr=0x%2X rd=0x%2X\r\n",i,BD_ISP.ContentData[i],ISP_buffer[i]);  
                                          break;
                                     	}

								  }
								  if(i!=infolen)
								  	{
                                      rt_kprintf("\r\n DF 读写 有出入!  \r\n");
									  return;
								  	}
                                //  OutPrint_HEX("Read",ISP_buffer,infolen);   
								  
						    }
						   
						   rt_kprintf("\r\n  ISP  当前包数:%d	--- 总包数:%d    contentlen=%d Bytes \r\n",BD_ISP.CurrentPacket_Num,BD_ISP.Total_PacketNum,infolen);
						   
                           //4.----------- ISP state update ---------------------- 
                           BD_ISP.ISP_running=1;
                           BD_ISP.ISP_runTimer=0;     

						   //5. --------  ISP ACK process  -----------
						   if((BD_ISP.CurrentPacket_Num==BD_ISP.Total_PacketNum)&&(i==infolen))
						   {
						        // File_CRC_Get(); 
						       SD_ACKflag.f_BD_ISPResualt_0108H=1;   //正常
							   rt_kprintf("\r\n 最后一包\r\n"); 
						   }
						   else
						   if(BD_ISP.CurrentPacket_Num>BD_ISP.Total_PacketNum)
						   	{
                                
                                  SD_ACKflag.f_BD_ISPResualt_0108H=3;  // 取消
                                 rt_kprintf("\r\n 当前包大于总包数 --异常 ，失败!\r\n"); 
						   	}
						   else
						   	{
                                
								//------------	 ACK   Flag -----------------
		  					    SD_ACKflag.f_CentreCMDack_0001H=1;
							    Ack_Resualt=0;
							    SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt; 
						    	 //------------------------------------------------------------------------   

						   	} 
                            break;
            case   0x8203://BD--8.22  人工确认报警消息
                                     rt_kprintf( "\r\n收到8203!\r\n"); 
                             	    if (Warn_Status[3]&0x01)  //紧急报警
									  {
											  StatusReg_WARN_Clear();			  
											  f_Exigent_warning = 0;
											  warn_flag=0;
											  Send_warn_times=0; 
											   StatusReg_WARN_Clear();	
											   rt_kprintf( "\r\n紧急报警收到应答，得清除!\r\n");   
									  }
			 
                                            HumanConfirmWarn.Warn_FloatID=(UDP_HEX_Rx[13]<<8)+UDP_HEX_Rx[14];
                                            HumanConfirmWarn.ConfirmWarnType=(UDP_HEX_Rx[15]<<24)+(UDP_HEX_Rx[16]<<16)+(UDP_HEX_Rx[17]<<8)+UDP_HEX_Rx[18];
                                            if(HumanConfirmWarn.Warn_FloatID==0x00)
                                            	{    //  如果为0 表示所有消息
                                            	     Warn_Status[3] &= ~0x01;  // bit 0
							     Warn_Status[3]&=~0x08;	// bit3
							     Warn_Status[1]&=~0x10;	// bit20 进出区域报警 
							     Warn_Status[1]&=~0x20;    // bit 21 进出线路报警
							     Warn_Status[1]&=~0x40; 	// bit 22  路段行驶时间不足报警 
							     Warn_Status[0]&=~0x08;    // bit 27  确认车辆非法点火报警
							     Warn_Status[0]&=~0x10;    // bit 28  确认车辆非法报警
                                                      Warn_Status[0]&=~0x80;    //bit 31  非法开门 (终端不设置区域时，车门开关无效) 
                                            	}
						  else
						  	{
						  	     	  //--------------------------------
									  if ((Warn_Status[3]&0x01)&&(0x00000001&HumanConfirmWarn.ConfirmWarnType))  //紧急报警
									  {
											  StatusReg_WARN_Clear();		 	  
											  f_Exigent_warning = 0;
											  warn_flag=0;
											  Send_warn_times=0; 
											   StatusReg_WARN_Clear();	
											   rt_kprintf( "\r\n紧急报警收到应答，得清除!\r\n");   
									  }
			                                      	  if( (Warn_Status[3]&0x08)&&(0x00000008&HumanConfirmWarn.ConfirmWarnType))   //危险报警-BD
									    {
														  Warn_Status[3]&=~0x08;
									     }
									  
