nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
									  //------------------------------------
				                                     if((Warn_Status[1]&0x10)&&(0x00001000&HumanConfirmWarn.ConfirmWarnType)) // 进出区域报警
				                                     {
										                  InOut_Object.TYPE=0;//圆形区域
										                  InOut_Object.ID=0; //  ID
										                  InOut_Object.InOutState=0;//  进报警 
										                  Warn_Status[1]&=~0x10;
				                                     } 
									if((Warn_Status[1]&0x20)&&(0x00002000&HumanConfirmWarn.ConfirmWarnType)) // 进出路线报警
				                                     {
										                  InOut_Object.TYPE=0;//圆形区域
										                  InOut_Object.ID=0; //  ID
										                  InOut_Object.InOutState=0;//  进报警 
										                  Warn_Status[1]&=~0x20;  
				                                     } 
									 if((Warn_Status[1]&0x40)&&(0x00004000&HumanConfirmWarn.ConfirmWarnType))  // 路段行驶时间不足、过长
									 {
				                                                  Warn_Status[1]&=~0x40; 
									 }
									  //-----------------------------------------
									   if((Warn_Status[0]&0x08)&&(0x08000000&HumanConfirmWarn.ConfirmWarnType))  //车辆非法点火
									  {
                                                                              Warn_Status[0]&=~0x08; 
									  }
									   if((Warn_Status[0]&0x10)&&(0x10000000&HumanConfirmWarn.ConfirmWarnType))  //车辆非法位移
									  {
                                                                              Warn_Status[0]&=~0x10; 
									  } 
									      if((Warn_Status[0]&0x80)&&(0x80000000&HumanConfirmWarn.ConfirmWarnType))  //非法开门报警(终端未设置区域时，不判断非法开门)
                                                                {              
                                                                        Warn_Status[0]&=~0x80; 
									  }
									  //------------------------------------  
						  	}

                             		   //------------   ACK   Flag -----------------
						  	 SD_ACKflag.f_CentreCMDack_0001H=1;
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;	
							    //---------  报警确认后发送，立即发送定位包				
                             PositionSD_Enable();
							    Current_UDP_sd=1;	
						  break;					
                     case   0x8702:// BD-8.47-  上报驾驶员身份信息请求
                                             SD_ACKflag.f_DriverInfoSD_0702H=1; // 消息体为空
					         break;
		       case  0x8805:   //BD--8.55    单条存储多媒体数据检索上传命令	---- 补充协议要求

	                                    reg_u32=(UDP_HEX_Rx[13]<<24)+(UDP_HEX_Rx[14]<<16)+(UDP_HEX_Rx[15]<<8)+UDP_HEX_Rx[16];
						  rt_kprintf("\r\n单条存储多媒体数据检索上传 MeidiaID=%d 删除标志: %d ",reg_u32,UDP_HEX_Rx[17]);

                                           Camera_Number=1; 
                                           Photo_send_start(Camera_Number);  //在不是多路拍照的情况下拍完就可以上传了
							  //------------------------------
						 // if(SD_ACKflag.f_CentreCMDack_0001H==0)
	 					 {
	 						 SD_ACKflag.f_CentreCMDack_0001H=1; 
	 						 Ack_Resualt=0;
	 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
	 					 }
		                   break;
		    default:
				      break;  	    
	    } 

		//-----------------  memset  ------------------------------------- 
		//memset(UDP_HEX_Rx, 0, sizeof(UDP_HEX_Rx));	
		//UDP_hexRx_len= 0; 
        return;  

}


void Time2BCD(u8 *dest)
 {
    if(UDP_dataPacket_flag==0x02)
   {
		 
		   dest[0]=((Temp_Gps_Gprs.Date[0]/10)<<4)+(Temp_Gps_Gprs.Date[0]%10);  
		   dest[1]=((Temp_Gps_Gprs.Date[1]/10)<<4)+(Temp_Gps_Gprs.Date[1]%10);//Temp_Gps_Gprs.Date[1];
		   dest[2]=((Temp_Gps_Gprs.Date[2]/10)<<4)+(Temp_Gps_Gprs.Date[2]%10);//Temp_Gps_Gprs.Date[2]; 
		   
		   dest[3]=((Temp_Gps_Gprs.Time[0]/10)<<4)+(Temp_Gps_Gprs.Time[0]%10);//Temp_Gps_Gprs.Time[0]; 
		   dest[4]=((Temp_Gps_Gprs.Time[1]/10)<<4)+(Temp_Gps_Gprs.Time[1]%10);//Temp_Gps_Gprs.Time[1]; 
		   dest[5]=((Temp_Gps_Gprs.Time[2]/10)<<4)+(Temp_Gps_Gprs.Time[2]%10);//Temp_Gps_Gprs.Time[2];   
	   
   }
   else
   {
		dest[0]=((time_now.year/10)<<4)+(time_now.year%10);  	   	
		dest[1]=((time_now.month/10)<<4)+(time_now.month%10); 
		dest[2]=((time_now.day/10)<<4)+(time_now.day%10);
		dest[3]=((time_now.hour/10)<<4)+(time_now.hour%10);
		dest[4]=((time_now.min/10)<<4)+(time_now.min%10);
		dest[5]=((time_now.sec/10)<<4)+(time_now.sec%10);     
	}

 }

void AvrgSpd_MintProcess(u8 hour,u8 min, u8 sec)  
{
	   //------- 系统启动时处理   若 标志位为0 且年月日都为 0，表面是系统刚刚启动，这时获取当前时间把当前时间给BAK------
	if((0==Avrgspd_Mint.saveFlag)&&(Avrgspd_Mint.datetime_Bak[0]==0)&&(Avrgspd_Mint.datetime_Bak[1]==0)&&(Avrgspd_Mint.datetime_Bak[2]==0))
		{
		Time2BCD(Avrgspd_Mint.datetime);  
		memcpy(Avrgspd_Mint.datetime_Bak,Avrgspd_Mint.datetime,6);//将当前时间给BAK
		avgspd_Mint_Wr=Temp_Gps_Gprs.Time[1];//time_now.min;
		//rt_kprintf("\r\n-------------()avgspd_Mint_Wr=%d",avgspd_Mint_Wr);
		}	
	else
		{     // 若不是系统启动开始   
		if(min==0) //  把秒数写为非0 ，以便留出时间去存储上1小时的数据 
			{
			if(sec==5)  //存储上一小时每分钟的平均速度 ==2是因为要保证第59分钟速度已经被存储到相应的寄存器中
				{
				memcpy(Avrgspd_Mint.datetime_Bak,Avrgspd_Mint.datetime,6);//将当前时间给BAK
				Avrgspd_Mint.datetime_Bak[4]=0;// 分钟为0
				Avrgspd_Mint.datetime_Bak[5]=0;// 秒也为0 
				Avrgspd_Mint.saveFlag=1;//使能存储      到NandFlag  标志位
				Time2BCD(Avrgspd_Mint.datetime);//获取新的时间
				//rt_kprintf("\r\n存储前一小时平均速度,min=%d",min);
				} 
			if(sec==8)    //存储完后  清除时间下标  
				avgspd_Mint_Wr=0;
			}
		}
	
	if(sec==0)  // 秒为0时存储上1分钟的数据
		{
		//rt_kprintf("\r\n下一分钟开始,PerMinSpdTotal=%d,AspdCounter=%d",PerMinSpdTotal,AspdCounter);
		if(AspdCounter)
			{			
			Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=PerMinSpdTotal/AspdCounter;//第几分钟的平均速度			
			//---rt_kprintf("\r\n--------------stuff spd=%d PerMinSpdTotal=%d,AspdCounter=%d",Avrgspd_Mint.avgrspd[avgspd_Mint_Wr], PerMinSpdTotal,AspdCounter);  
			//=============================================================
			//为了好测试暂时把1分钟内速度总和当作平均速度来统计
			//Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=PerMinSpdTotal;
			//=============================================================
			}
		else
			{
			Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]=0; 
			//rt_kprintf("\r\n-------------(速度无效)");
			}
		//rt_kprintf("\r\n--------------%d分,平均速度=%d \r\n", avgspd_Mint_Wr,Avrgspd_Mint.avgrspd[avgspd_Mint_Wr]);  
		//avgspd_Mint_Wr++;//=(Avrgspd_Mint.datetime[4]>>4)*10+(0x0f&Avrgspd_Mint.datetime[4]);  
		
		PerMinSpdTotal=0;  // clear   
		AspdCounter=0;	   // clear  
		
		//rt_kprintf("\r\n清0，速度总和=%d,次数=%d\r\n",PerMinSpdTotal,AspdCounter);
		
