nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		}
	else
		{ 
		if((UDP_dataPacket_flag==0x02)||((JT808Conf_struct.DF_K_adjustState==1)&&(JT808Conf_struct.Speed_GetType==1)))
			{
			avgspd_Mint_Wr=Temp_Gps_Gprs.Time[1];;//++;//=time_now.min+1;
			
			AspdCounter++;
			PerMinSpdTotal+=Spd_Using/10;   // 只要求精确到 km/h   所以要除 10 
		   // PerMinSpdTotal+=(Spd_Using+Spd_add_debug)/10;   // 只要求精确到 km/h   所以要除 10 	  
			  
			//if(AspdCounter%10==0)
				//rt_kprintf("\r\nAspdCounter=%d,Spd_Using=%d,PerMinSpdTotal=%d \r\n",AspdCounter,Spd_Using/10,PerMinSpdTotal);  
		
			} 
		}  
}

//==================================================================================================
// 第四部分 :   以下是行车记录仪相关协议 即 附录A   
//==================================================================================================

//  1.  上载数据命令字相关  

//------------------------------------------------------------------
void  Process_GPRSIN_DeviceData(u8 *instr, u16  infolen)
{
   u8  fcs=0;
   u16 i=0;



   //   caculate  and   check fcs
   for(i=0;i<infolen-1;i++)
   	  fcs^=instr[i];
   
   if(fcs!=instr[infolen-1])
   	  return;
   //  classify  cmd             
   switch(instr[2])   // AAH 75H CMD
   	{
   	  //  上行
      case 0x00:  // 采集行车记录仪执行标准版本号
                 Adata_ACKflag.A_Flag__Up_Ver_00H=0xff;
				 break;
	  case 0x01:  // 采集当前驾驶人信息
	             Adata_ACKflag.A_Flag_Up_DrvInfo_01H=instr[2];
				 break;
	  case 0x02:  // 采集记录仪的实时时钟
	             Adata_ACKflag.A_Flag_Up_RTC_02H=instr[2];
				 break;
	  case 0x03:  // 采集行驶里程
	             Adata_ACKflag.A_Flag_Up_Dist_03H=instr[2];
				 break;
	  case 0x04:  // 采集记录仪速度脉冲系数
	             Adata_ACKflag.A_Flag_Up_PLUS_04H=instr[2];
				 break;
	  case 0x06:  // 采集车辆信息
	             Adata_ACKflag.A_Flag_Up_VechInfo_06H=instr[2];
				 break;
	  case 0x08:  // 采集记录仪状态信号配置信息
	             Adata_ACKflag.A_Flag_Up_SetInfo_08H=instr[2];
				 break;
	  case 0x16:  // 采集记录仪唯一编号
	             Adata_ACKflag.A_Flag_Up_DevID_16H=instr[2];
				 break;
	  case 0x09:  // 采集指定的每秒钟平均速度记录            
	             Adata_ACKflag.A_Flag_Up_AvrgSec_09H=instr[2];  // 有起始结束时间
	  	         break;
	  case 0x05: // 采集指定的每分钟平均速度记录
	             Adata_ACKflag.A_Flag_Up_AvrgMin_05H=instr[2]; // 有起始结束时间
	             break;
	  case 0x13: // 采集指定的位置信息记录
	             Adata_ACKflag.A_Flag_Up_Posit_13H=instr[2];
				 break;
	  case 0x07: // 采集事故疑点记录
	             Adata_ACKflag.A_Flag_Up_Doubt_07H=instr[2];  // 有起始结束时间
	             break;
	  case 0x11: // 采集指定的疲劳驾驶记录
	             Adata_ACKflag.A_Flag_Up_Tired_11H=instr[2]; // 有起始结束时间
				 break;
	  case 0x10: // 采集指定的登录退出记录
	             Adata_ACKflag.A_Flag_Up_LogIn_10H=instr[2]; // 有起始结束时间
	             break;
	  case 0x14: // 采集指定的记录仪外部供电记录
	            Adata_ACKflag.A_Flag_Up_Powercut_14H=instr[2]; // 有起始结束时间
				break;
	  case 0x15: // 采集指定的记录仪参数修改记录
	            Adata_ACKflag.A_Flag_Up_SetMdfy_15H=instr[2];
				break;
	  //  下行
	  case 0x82: // 设置车辆信息                 
				    memset(Vechicle_Info.Vech_VIN,0,sizeof(Vechicle_Info.Vech_VIN));
				    memset(Vechicle_Info.Vech_Num,0,sizeof(Vechicle_Info.Vech_Num));
				    memset(Vechicle_Info.Vech_Type,0,sizeof(Vechicle_Info.Vech_Type)); 	
                 
					 //-----------------------------------------------------------------------
					 memcpy(Vechicle_Info.Vech_VIN,instr,17);
					 memcpy(Vechicle_Info.Vech_Num,instr+17,12);
					 memcpy(Vechicle_Info.Vech_Type,instr+29,12); 
					 
			
				 	DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));      
					WatchDog_Feed();
					DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
					WatchDog_Feed();
				    DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 

                 Adata_ACKflag.A_Flag_Dn_DrvInfo_82H=instr[2];
				    
					Settingchg_Status=0x82;//设置车辆信息 					
					NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
	  case 0x83:  // 设置初次安装日期
                             memcpy(JT808Conf_struct.FirstSetupDate,instr,6); 
				  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                 Adata_ACKflag.A_Flag_Dn_SetupDate_83H=instr[2];
				 Settingchg_Status=0x83;//设置车辆信息 				 
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
				 break;
	  case 0x84:  // 设置状态量信息	
	             Settingchg_Status=0x84;//设置车辆信息 	             
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
	             break;
	  case 0xc2: // 设置记录仪时钟
                 Adata_ACKflag.A_Flag_Dn_RTC_C2H=instr[2];
				 Settingchg_Status=0xc2;//设置车辆信息 				 
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
				 break;
	  case 0xc3: // 设置记录仪速度脉冲系数                 
				  JT808Conf_struct.Vech_Character_Value=(u32)(instr[0]<<24)+(u32)(instr[1]<<16)+(u32)(instr[2]<<8)+(u32)(instr[3]); // 特征系数	速度脉冲系数
				  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		         Adata_ACKflag.A_Flag_Dn_Plus_C3H=instr[2];   
				 Settingchg_Status=0xc3;//设置车辆信息  				 
				 NandsaveFlg.Setting_SaveFlag=1;  //存储参数修改记录
				 break;
	  default:

		         break;
				 
				 	


   	}
}

#if 0

u8 RecordSerial_output_Str(const char *fmt,...) 
{
    u8 regstr[100],fcs=0;
	u16 reglen=0,i=0;
	
	va_list args;
	va_start(args, fmt);
	  memset(regstr,0,sizeof(regstr));  
	regstr[0]=0x55; // 协议头    
    regstr[1]=0x7A;
	regstr[2]=0xFE; // 命令字 ，用预留命令字表示调试输出	
	//  3,4 为长度字节最后填写
	regstr[5]=0x00; // 备用字  0x00

	reglen= vsprintf((char*)regstr+6, fmt, args);
	va_end(args); 
	regstr[3]=(u8)(reglen>>8);  // 填写长度  ，长度为信息内容的长度 
	regstr[4]=(u8)reglen;   
	
	reglen+=6;
	fcs=0;	
	for(i=0;i<reglen;i++)
		fcs^=regstr[i];
	regstr[reglen]=fcs;
	reglen++; 
	for(i=0;i<reglen;i++)
	     rt_kprintf("%c",regstr[i]);  
	
	return 1;
}

#endif

void SpeedWarnJudge(void)  //  速度报警判断 
{
  					 //--------  速度报警  -------	 
					 if(  JT808Conf_struct.Speed_warn_MAX >0 )   //> 0 
					 {
			            
						 //----- GPS  即时速度	0.1 km/h  ---------
							 if  ( Spd_Using>( JT808Conf_struct.Speed_warn_MAX*10) )							 	
							// if( DebugSpd > ( JT808Conf_struct.Speed_warn_MAX*10) ) 
							 {
											 speed_Exd.dur_seconds++;
											 if ( speed_Exd.dur_seconds >JT808Conf_struct.Spd_Exd_LimitSeconds)   
											 {
													 speed_Exd.dur_seconds = 0;  
													 if ( speed_Exd.speed_flag!= 1 )
													 {				   
														 speed_Exd.speed_flag = 1;			 
														 //PositionsSD_Enable();	  //  回报GPS 信息	 

														 StatusReg_SPD_WARN(); //  超速报警状态
														 rt_kprintf("\r\n  超速报警\r\n"); 
													 } 
													 //---------------------------------------------
													 Time2BCD(speed_Exd.ex_startTime); //记录超速报警起始时间
													 if(speed_Exd.current_maxSpd<Spd_Using) //找最大速度
														  speed_Exd.current_maxSpd=Spd_Using;
													 speed_Exd.excd_status=1;
													 speed_Exd.dur_seconds++;		
			 
												   //---------------------------------------------- 
											 }
											 
