nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
											 if(speed_Exd.excd_status==1) // 使能flag 后开始计时 
											  {
												 speed_Exd.dur_seconds++; 
												 if(speed_Exd.current_maxSpd<Spd_Using) //找最大速度
														  speed_Exd.current_maxSpd=Spd_Using;
											   } 
									 
							 }
							 else
							 { 
							              StatusReg_SPD_NORMAL(); //  清除速度报警状态寄存器  
										  
										  if(speed_Exd.excd_status!=2)
										  {
										    StatusReg_SPD_NORMAL(); //  清除速度报警状态寄存器
											speed_Exd.dur_seconds = 0;
											speed_Exd.speed_flag = 0; 	
										  } 											   
											//----------------------------------------------
											if(speed_Exd.excd_status==1)  
		                                    {	
											    Time2BCD(speed_Exd.ex_endTime); //记录超速报警结束时间 
												speed_Exd.excd_status=2;
							 	            }
											else
											if(speed_Exd.excd_status==0)
												Spd_ExpInit();
											//---------------------------------------------- 
							 }
					  }//------- 速度报警 over	 ---


}


u16  Protocol_808_Encode(u8 *Dest,u8 *Src, u16 srclen)
{
  u16  lencnt=0,destcnt=0;

  for(lencnt=0;lencnt<srclen;lencnt++)
  {
     if(Src[lencnt]==0x7e)  // 7e 转义
     {
       Dest[destcnt++]=0x7d;
	   Dest[destcnt++]=0x02;
     }
     else
	 if(Src[lencnt]==0x7d) //  7d  转义 	
	 {
       Dest[destcnt++]=0x7d;
	   Dest[destcnt++]=0x01; 
	 }
	 else
        Dest[destcnt++]=Src[lencnt]; // 原始信息
  }

  return destcnt; //返回转义后的长度

}
//-------------------------------------------------------------------------------
void Protocol_808_Decode(void)  // 解析指定buffer :  UDP_HEX_Rx  
{
	//-----------------------------------
	  u16 i=0;

    // 1.  clear  write_counter
	  UDP_DecodeHex_Len=0;//clear DecodeLen

	// 2   decode process   
	for(i=0;i<UDP_hexRx_len;i++)
	 {
		if((UDP_HEX_Rx[i]==0x7d)&&(UDP_HEX_Rx[i+1]==0x02))
		{
		   UDP_HEX_Rx[UDP_DecodeHex_Len]=0x7e;
		   i++;
		}
		else
		if((UDP_HEX_Rx[i]==0x7d)&&(UDP_HEX_Rx[i+1]==0x01))
		{
		   UDP_HEX_Rx[UDP_DecodeHex_Len]=0x7d;
		   i++;
		}
		else  
		{
		  UDP_HEX_Rx[UDP_DecodeHex_Len]=UDP_HEX_Rx[i];   
		}
	    UDP_DecodeHex_Len++;
	 }	
    //  3.  The  End
}
//---------  拐点补传测试程序  ---------------------------
//#if 0
/*
void Inflexion_Process(void)
{            //
  u16  once_delta=0;


	Inflexion_Current=GPS_direction;  //  update new
   //----------------------------------------------------------------------- 
    if(Inflexion_Current>Inflexion_Bak)   // 初步判断大小  
    	{  // 增大
            if((Inflexion_Current-Inflexion_Bak)>300)  // 判断是否倒置减小
			{   //  如果差值大于300 ，说明是小于
			     once_delta=Inflexion_Bak+360-Inflexion_Current;  //判断差值绝对值
			     InflexDelta_Accumulate+=once_delta;
				 if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度  拐点补传角度不大于180 要求连续3s  所以每秒不大于60
				 {
					    if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==2))  //判断之前是否一直是小于
					    	{
		                        Inflexion_chgcnter++;
								if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
									{     //要求至少持续3s	累计拐角补传角度不得大于180
                                           InflexLarge_or_Small=0;
										   Inflexion_chgcnter=0;
										   InflexDelta_Accumulate=0;
										   PositionSD_Enable=1; // 发送拐点标志位
										   rt_kprintf("\r\n 拐点上报 --1\r\n");
									}
								else
								  InflexLarge_or_Small=2; // 这次是小于
					    	}
						else
							{
							   InflexLarge_or_Small=2;  // 这是第一次小于 
							   Inflexion_chgcnter=1;
							   InflexDelta_Accumulate=once_delta;
							}
				 }
				 else
				 {    //  小于 15 就算等于
				   InflexLarge_or_Small=0;
				   Inflexion_chgcnter=0;
				   InflexDelta_Accumulate=0;
				 }
				 	
            } 
			else		// current真真正正的比Bak 大
			{  
			   once_delta=Inflexion_Current-Inflexion_Bak;  //判断差值绝对值
			   InflexDelta_Accumulate+=once_delta;
			   if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度  拐点补传角度不大于180 要求连续3s  所以每秒不大于60
			   {
	               if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==1)) //判断之前是否一直大于
				   {
				       Inflexion_chgcnter++;					   
					   if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
						   {	 //要求至少持续3s	累计拐角补传角度不得大于180
								  InflexLarge_or_Small=0;
								  Inflexion_chgcnter=0;
								  InflexDelta_Accumulate=0;
								  PositionSD_Enable(); // 发送拐点标志位
								  rt_kprintf("\r\n 拐点上报 --2\r\n");
						   }
					   else
					     InflexLarge_or_Small=1; // 这次是大于
	               }	
				   else
				   	{  
                       InflexLarge_or_Small=1;  // 这是第一次大于
					   Inflexion_chgcnter=1;
					   InflexDelta_Accumulate=once_delta; 
				   	}
			   }
			    else
				 {     // 小于15度就算等于
				   InflexLarge_or_Small=0;
				   Inflexion_chgcnter=0;
				   InflexDelta_Accumulate=0;
				 }

			}  
    	}
	else
	 if(Inflexion_Current<Inflexion_Bak)	
	 	{  // 减小
               if((Inflexion_Bak-Inflexion_Current)>300)  // 判断是否倒置增大
               { //  如果差值大于300 ，说明是大于
                  once_delta=Inflexion_Current+360-Inflexion_Bak;  //判断差值绝对值
			      InflexDelta_Accumulate+=once_delta;
				  if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度	拐点补传角度不大于180 要求连续3s  所以每秒不大于60
                  {   // 最小变化率 不小于 15
                     if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==1))  //判断之前是否一直是大于
					    	{
		                        Inflexion_chgcnter++;
								if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
									{     //要求至少持续3s	累计拐角补传角度不得大于180
                                           InflexLarge_or_Small=0;
										   Inflexion_chgcnter=0;
										   InflexDelta_Accumulate=0;
										   PositionSD_Enable(); // 发送拐点标志位
										   rt_kprintf("\r\n 拐点上报 --3\r\n");
									}
								else
								  InflexLarge_or_Small=1; // 这次是大于
					    	}
						else
							{
							   InflexLarge_or_Small=1;  // 这是第一次大于 
							   Inflexion_chgcnter=1;
							   InflexDelta_Accumulate=once_delta;
							}

