nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                  }
				  else
				  {    //  小于 15 就算等于
				   InflexLarge_or_Small=0;
				   Inflexion_chgcnter=0;
				   InflexDelta_Accumulate=0;
				  }
			  }//---------------------------
			   else 	   // current 真真正正的比Bak 小
			   {
				  once_delta=Inflexion_Bak-Inflexion_Current;  //判断差值绝对值
				  InflexDelta_Accumulate+=once_delta;
				  if((once_delta>=15)&&(once_delta<=60)) // 角度最小变化率不得小于15度	拐点补传角度不大于180 要求连续3s  所以每秒不大于60
				  {
					  if((Inflexion_chgcnter>0)&&(InflexLarge_or_Small==2)) //判断之前是否一直小于
					  {
						  Inflexion_chgcnter++; 					  
						  if((InflexDelta_Accumulate>=3)&&(InflexDelta_Accumulate>JT808Conf_struct.DURATION.SD_Delta_maxAngle)&&(InflexDelta_Accumulate<=180))
							  { 	//要求至少持续3s	累计拐角补传角度不得大于180
									 InflexLarge_or_Small=0;
									 Inflexion_chgcnter=0;
									 InflexDelta_Accumulate=0;
									 PositionSD_Enable(); // 发送拐点标志位
									 rt_kprintf("\r\n 拐点上报 --4\r\n"); 
							  }
						  else
						   InflexLarge_or_Small=2; // 这次是小于
					  }    
					  else
					   {  
						  InflexLarge_or_Small=2;  // 这是第一次小于
						  Inflexion_chgcnter=1;
						  InflexDelta_Accumulate=once_delta; 
					   }
				  }
				   else
					{	  // 小于15度就算等于
					  InflexLarge_or_Small=0;
					  Inflexion_chgcnter=0;
					  InflexDelta_Accumulate=0;
					}
			   
			   }
			  	
	

	 	}
	else
		{
		  InflexLarge_or_Small=0;
		  Inflexion_chgcnter=0;
		  InflexDelta_Accumulate=0;
		}  

    //--------------------------------------------------------
    Inflexion_Bak=Inflexion_Current; //  throw  old	 to  Bak

}*/
//#endif 

void  Sleep_Mode_ConfigEnter(void)
{
   if(SleepState==0)
		{
		   	  SleepCounter++;
			  if(SleepCounter>15)   // 防抖处理
			 {
			      SleepCounter=0; 
			   	   SleepState=1;		
				   if(JT808Conf_struct.RT_LOCK.Lock_state!=1)
				   Current_SD_Duration=JT808Conf_struct.DURATION.Sleep_Dur; // 5分钟 

				   //JT808Conf_struct.DURATION.Heart_SDCnter=25; 
				   //JT808Conf_struct.DURATION.Heart_Dur=320; 
				  /*   天地通要求休眠不重新计时  ，不  
				    memcpy(BakTime,CurrentTime,3); // update  //gps开始计时 
				    systemTick_trigGPS_counter=0; // 系统定时 清除
				  */  
				   if(DataLink_Status())
	                                PositionSD_Enable();  //  在线就发送    河北天地通要求数据完整 
				    rt_kprintf("\r\n 进入休眠状态! \r\n");          
			 }  
		 }
}

void  Sleep_Mode_ConfigExit(void)
{
    if(SleepState==1)
		   	{
		   	   SleepState=0;
			   rt_kprintf("\r\n 车台唤醒! \r\n");      
		   	}
   if(JT808Conf_struct.RT_LOCK.Lock_state!=1)
       Current_SD_Duration=JT808Conf_struct.DURATION.Default_Dur; 
   JT808Conf_struct.DURATION.Heart_Dur=300;  
   SleepState=0;
   SleepCounter=0;
}

#if 0
u16 WaveFile_EncodeHeader(u32 inFilesize ,u8* DestStr)
{
   u32 Filesize=0,i=0;     // Header Len  =44Bytes  

    
	//  1. RIFF
    memcpy(DestStr,"RIFF",4); 
	i+=4;
	//  2. Wave 文件 大小  小端模式 
	Filesize=0x24+(inFilesize<<3); // 乘以16 加 36 wave 文件大小 
	rt_kprintf("\r\n .wav 文件大小: %d Rawdata: %d \r\n ",Filesize,(inFilesize<<3)); 
	DestStr[i++]=Filesize; // LL
	DestStr[i++]=(Filesize>>8);//LH
	DestStr[i++]=(Filesize>>16);//HL
	DestStr[i++]=(Filesize>>24);//HH
	//  3. WAVE string	
    memcpy(DestStr+i,"WAVE",4);
	i+=4;
	//  4. fmt string	
    memcpy(DestStr+i,"fmt ",4);
	i+=4;
    //  5. PCM Code    
	DestStr[i++]=0x10; // LL
	DestStr[i++]=0x00;//LH
	DestStr[i++]=0x00;//HL
	DestStr[i++]=0x00;//HH   
	//  6. Audio Format  PCM=1	
	DestStr[i++]=0x01; // L
	DestStr[i++]=0x00;//H
	//  7. NumChannels  通道数
	DestStr[i++]=0x01; // L
	DestStr[i++]=0x00;//H
	//  8. SampleRate     8000<=>0x00001F40    16000<=>0x00003E80      
	DestStr[i++]=0x40;//0x40; // LL
	DestStr[i++]=0x1F;//0x1F;//LH
	DestStr[i++]=0x00;//HL
	DestStr[i++]=0x00;//HH    
    //  9.ByteRate       == SampleRate * NumChannels * BitsPerSample/8  ==8000x1x8/8 
	DestStr[i++]=0x40;//0x40; // LL
	DestStr[i++]=0x1F;//0x1F;//LH
	DestStr[i++]=0x00;//HL
	DestStr[i++]=0x00;//HH   

	// 10.BlockAlign   	== NumChannels * BitsPerSample/8
	DestStr[i++]=0x01;//0x02;//0x01; // L 
	DestStr[i++]=0x00;//H
	// 11.BitsPerSample
	DestStr[i++]=0x08;//0x10;//0x08; // L
	DestStr[i++]=0x00;//H
    // 12.data string	
    memcpy(DestStr+i,"data",4);
	i+=4;
	// 13 .datasize
	Filesize=(inFilesize<<3); // 乘以16 加 36 wave 文件大小 
	DestStr[i++]=Filesize; // LL
	DestStr[i++]=(Filesize>>8);//LH
	DestStr[i++]=(Filesize>>16);//HL
	DestStr[i++]=(Filesize>>24);//HH

    return i;
}
#endif

//-----------  starttime[6]
u8 CurrentTime_Judge( u8*startTime ,u8* endTime)
{
   u32 daycaculate_current=0,daycaculate_start=0,daycaculate_end=0;
   u32 secondcaculate_current=0,secondcaculate_start=0,secondcaculate_end=0;
  

   daycaculate_start=((startTime[0]>>4)*10+(startTime[0]&0x0f))*365+((startTime[1]>>4)*10+(startTime[1]&0x0f))*30+((startTime[2]>>4)*10+(startTime[2]&0x0f));
   secondcaculate_start=((startTime[3]>>4)*10+(startTime[3]&0x0f))*60+((startTime[4]>>4)*10+(startTime[4]&0x0f))*60+((startTime[5]>>4)*10+(startTime[5]&0x0f)); 

   
   daycaculate_end=((endTime[0]>>4)*10+(endTime[0]&0x0f))*365+((endTime[1]>>4)*10+(endTime[1]&0x0f))*30+((endTime[2]>>4)*10+(endTime[2]&0x0f));
   secondcaculate_end=((endTime[3]>>4)*10+(endTime[3]&0x0f))*60+((endTime[4]>>4)*10+(endTime[4]&0x0f))*60+((endTime[5]>>4)*10+(endTime[5]&0x0f)); 

   daycaculate_current=(time_now.year)*365+time_now.month*30+time_now.day;
   secondcaculate_current=time_now.hour*60+time_now.min*60+time_now.sec;

   if((daycaculate_current>daycaculate_start)&&(daycaculate_current<daycaculate_end))
   {
        return  true;
   }
   else
   if((secondcaculate_current>=secondcaculate_start)&&(secondcaculate_current<=secondcaculate_end))
   	{     
        return true;
   	}
   else   
   	    return false;

   

}

void CycleRail_Judge(u8* LatiStr,u8* LongiStr) 
{
   /*
       纬度没有差值    1纬度  111km
       40度纬度上 1经度为  85.3km   (北京地区)
   */
   u8 i=0;
   u32 Latitude=0,Longitude=0;
   u32 DeltaLatiDis=0,DeltaLongiDis=0,CacuDist=0;
   u8  InOutState=0;   //   0 表示 in   1  表示Out

   //  1. get value
      Latitude=(LatiStr[0]<<24)+(LatiStr[1]<<16)+(LatiStr[2]<<8)+LatiStr[3];
      Longitude=(LongiStr[0]<<24)+(LongiStr[1]<<16)+(LongiStr[2]<<8)+LongiStr[3]; 


 
  for(i=0;i<8;i++)
  {
         InOutState=0; 
		 memset((u8*)&Rail_Cycle,0,sizeof(Rail_Cycle));
		//Api_RecordNum_Read(Rail_cycle,i+1, (u8*)&Rail_Cycle,sizeof(Rail_Cycle)); 	 
		memcpy((u8*)&Rail_Cycle,(u8*)&Rail_Cycle_multi[i],sizeof(Rail_Cycle));
		// rt_kprintf("\r\n\r\n 圆形围栏 有效状态:%d  TYPE: %d    atrri=%d  lati: %d  longiti:%d  radicus:%d  maxspd: %d  keepdur:%d \r\n",Rail_Cycle.Effective_flag,Rail_Cycle.Area_ID,Rail_Cycle.Area_attribute,Rail_Cycle.Center_Latitude,Rail_Cycle.Center_Longitude,Rail_Cycle.Radius,Rail_Cycle.MaxSpd,Rail_Cycle.KeepDur);  
         

      if(Rail_Cycle.Effective_flag==1) 
      {
         
