nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			 DeltaLatiDis=abs(Latitude-Rail_Cycle.Center_Latitude)/9; //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
             
			 DeltaLongiDis=abs(Longitude-Rail_Cycle.Center_Longitude)*853/10000; // a/1000000*85300=a 853/10000 m 	  
			 
			 CacuDist=sqrt((DeltaLatiDis*DeltaLatiDis)+(DeltaLongiDis*DeltaLongiDis));  
             
			 rt_kprintf("\r\n  TemperLati  %d  TemperLongi	%d	  Centerlati %d  center longi %d\r\n",Latitude,Longitude,Rail_Cycle.Center_Latitude,Rail_Cycle.Center_Longitude); 
			 rt_kprintf("\r\n  he=%d heng=%d   shu=%d   juli=%d\r\n",abs(Longitude-Rail_Cycle.Center_Longitude),DeltaLongiDis,DeltaLatiDis,CacuDist);   
			 
		   if(DeltaLatiDis>Rail_Cycle.Radius ) 
		   {  // 如果纬度距离大于 半径肯定出
		     InOutState=1;
		   }	 
		    else
		   {
			   DeltaLongiDis=abs(Longitude-Rail_Cycle.Center_Longitude)*853/10000; // a/1000000*85300=a 853/10000 m		
			   if(DeltaLongiDis>Rail_Cycle.Radius )	 
			   	{  // 如果经度距离大于半径肯定出
                   InOutState=1;
			   	}
			   else  //  计算两点见距离
			    CacuDist=sqrt((DeltaLatiDis*DeltaLatiDis)+(DeltaLongiDis*DeltaLongiDis));
		    } 


		     // 1. 判断属性
		     if(Rail_Cycle.Area_attribute &0x0001) //Bit 0 根据时间
		     {
                if(CurrentTime_Judge(Rail_Cycle.StartTimeBCD,Rail_Cycle.EndTimeBCD)==false)
				{
				  rt_kprintf("\r\n 时段没在区间内 \r\n");
				  return;
                }  
			   //continue;
		     }
			 if(Rail_Cycle.Area_attribute &0x0002) //Bit 1 限速
			 {
                if(Spd_Using>Rail_Cycle.MaxSpd) 
                	{
                          StatusReg_SPD_WARN(); //  超速报警状态
						  rt_kprintf("\r\n  设定围栏超速报警\r\n"); 
                	}
				else
					 StatusReg_SPD_NORMAL();
	           //continue;
			 }
	         if(Rail_Cycle.Area_attribute &0x0004) //Bit 2 进区域报警给驾驶员
	         {


	           //continue;
	         }
			 if(Rail_Cycle.Area_attribute &0x0008) //Bit 3 进区域报警给平台 
			 {
               if((InOutState==0)&&(CacuDist<Rail_Cycle.Radius )&&(Rail_Cycle.MaxSpd>(Speed_gps/10)))
               {
                  Warn_Status[1]|=0x10;// 进出区域报警
                  InOut_Object.TYPE=1;//圆形区域
                  InOut_Object.ID=i; //  ID
                  InOut_Object.InOutState=0;//  进报警	
                  rt_kprintf("\r\n -----圆形电子围栏--入报警");   
			      break;
               }			 
	           //continue;
			 }
			  if(Rail_Cycle.Area_attribute &0x0010) //Bit 4 出区域报警给司机
			 {
	           ;   
	           //continue;
			 }
			 if((Rail_Cycle.Area_attribute &0x0020)&&(Rail_Cycle.MaxSpd>(Speed_gps/10))) //Bit 5 出区域报警给平台 
			 {
			   if((InOutState==1)||(CacuDist>Rail_Cycle.Radius )) 
			   	{
			   	  Warn_Status[1]|=0x10;// 进出区域报警
                  InOut_Object.TYPE=1;//圆形区域
                  InOut_Object.ID=i; //  ID
                  InOut_Object.InOutState=1;//  出报警 
                  rt_kprintf("\r\n -----圆形电子围栏--出报警");        
			      break;
			   	}
						 
	           //continue;
			 } 
      	}

  }



}

void RectangleRail_Judge(u8* LatiStr,u8* LongiStr)
{  
	u8 i=0;
	u32 Latitude=0,Longitude=0;
//	u32 DeltaLatiDis=0,DeltaLongiDis=0,CacuDist=0;
	u8	InOutState=1;	//	 0 表示 in	 1	表示Out
	
  
  //  1. get value
	 Latitude=(LatiStr[0]<<24)+(LatiStr[1]<<16)+(LatiStr[2]<<8)+LatiStr[3];
	 Longitude=(LongiStr[0]<<24)+(LongiStr[1]<<16)+(LongiStr[2]<<8)+LongiStr[3]; 

	 
	// rt_kprintf("\r\n  1---TemperLati  %d  TemperLongi	%d	 res %d\r\n",Latitude,Longitude,InOutState);  

	for(i=0;i<8;i++)
	{
	    InOutState=1;
		// Api_RecordNum_Read(Rail_rect,i+1, (u8*)&Rail_Rectangle, sizeof(Rail_Rectangle)); 
		 memcpy((u8*)&Rail_Rectangle,(u8*)&Rail_Rectangle_multi[i],sizeof(Rail_Rectangle));		
        
		if(Rail_Rectangle.Effective_flag==1) 
		{
		 
		//  rt_kprintf("\r\n\r\n 判断矩形形围栏 有效:%d ID: %d  atrri=%X  leftlati: %d  leftlongiti:%d    rightLati:%d   rightLongitu: %d	\r\n",Rail_Rectangle.Effective_flag,i+1,Rail_Rectangle.Area_attribute,Rail_Rectangle.LeftUp_Latitude,Rail_Rectangle.LeftUp_Longitude,Rail_Rectangle.RightDown_Latitude,Rail_Rectangle.RightDown_Longitude);	
            if((Latitude>Rail_Rectangle.RightDown_Latitude)&&(Latitude<Rail_Rectangle.LeftUp_Latitude)&&(Longitude>Rail_Rectangle.LeftUp_Longitude)&&(Longitude<Rail_Rectangle.RightDown_Longitude))
		       InOutState=0;
            
			//rt_kprintf("\r\n  TemperLati  %d  TemperLongi  %d   res %d\r\n",Latitude,Longitude,InOutState); 
		     
			// 1. 判断属性
			if(Rail_Rectangle.Area_attribute &0x0001) //Bit 0 根据时间
			{
			
			  //continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0002) //Bit 1 限速
			{
			
			  //continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0004) //Bit 2 进区域报警给驾驶员
			{
			
			
			  //continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0008) //Bit 3 进区域报警给平台 
			{
			  if(InOutState==0)
			  {
				 Warn_Status[1]|=0x10;// 进出区域报警
				 InOut_Object.TYPE=2;//矩形区域
				 InOut_Object.ID=i; //	ID
				 InOut_Object.InOutState=0;//  进报警		
				 rt_kprintf("\r\n -----矩形电子围栏--入报警"); 
				 break;
			  } 			
			  //continue;
			}
			 if(Rail_Rectangle.Area_attribute &0x0010) //Bit 4 出区域报警给司机
			{
			
			
			 // continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0020) //Bit 5 出区域报警给平台 
			{
			  if(InOutState==1)
			   {
				 Warn_Status[1]|=0x10;// 进出区域报警
				 InOut_Object.TYPE=2;//矩形区域
				 InOut_Object.ID=i; //	ID
				 InOut_Object.InOutState=1;//  出报警		
				 rt_kprintf("\r\n -----矩形电子围栏--出报警"); 
				 break;
			   }
						
			 // continue;  
			} 

 
		}
		
	} 




}

void RouteRail_Judge(u8* LatiStr,u8* LongiStr)  
{
   /*
       纬度没有差值    1纬度  111km
       40度纬度上 1经度为  85.3km   (北京地区)
   */
     u8 i=0;
      u8 route_cout=0, seg_count=0,seg_num=0; 
      u32 Latitude=0,Longitude=0;
    // u32 DeltaLatiDis=0,DeltaLongiDis=0,CacuDist=0;
    // u8  InOutState=0;   //   0 表示 in   1  表示Out
     u32  Route_Status=0;   // 每个bit 表示 一个路线 偏航状态默认为0
     u32  Segment_Status=0;  //  当前线路中，对应端的偏航情况， 默认为0
     u32  Distance=0;
//     u8    InAreaJudge=0; //  判断是否在判断区域 bit 0 经度范围 bit  1 纬度范围
     u32  Distance_Array[6]; //存储当条线路的最小距离，默认是个大数值

       //  1. get value
	 Latitude=(LatiStr[0]<<24)+(LatiStr[1]<<16)+(LatiStr[2]<<8)+LatiStr[3];
	 Longitude=(LongiStr[0]<<24)+(LongiStr[1]<<16)+(LongiStr[2]<<8)+LongiStr[3]; 

	 // rt_kprintf("\r\n 当前---->  Latitude:   %d     Longitude: %d\r\n",Latitude,Longitude); 

      //  2.  Judge 
      for(route_cout=0;route_cout<Route_Mum;route_cout++)      // 读取路线
     { 
                 
