nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
             //  2.1   将当前点带入， 过 P1(0,y1)   的 直线方程(4)  求出结果
                                  Line4_Resualt=(x2*x0)-(y1*y0)+(y1*y1);
	                            FLine4_Resualt2=fx2*fx0-fy1*fy0+fy1*fy1;
	   //     rt_kprintf("\r\n Line4=x2*x0-y1*y0+y1*y1=(%d)*(%d)-(%d)*(%d)+(%d)*(%d)=%ld     x2*x0=%d    y1*y0=%d   y1*y1=%d  \r\n",x2,x0,y1,y0,y1,y1,Line4_Resualt,x2*x0,y1*y0,y1*y1); 
          //     rt_kprintf("\r\n FLine4=fx2*fx0-fy1*fy0+fy1*fy1=(%f)*(%f)-(%f)*(%f)+(%f)*(%f)=%f      fx2*fx0=%f    fy1*fy0=%f   fy1*fy1=%f  \r\n",fx2,fx0,fy1,fy0,fy1,fy1,FLine4_Resualt2,fx2*fx0,fy1*fy0,fy1*fy1); 
  
	      //   2.2   将当前点带入， 过P2(x2,0) 的 直线方程(5)  求出结果 
                                  Line5_Resualt=(x2*x0)-y1*y0-x2*x2;
		                    FLine5_Resualt2=fx2*fx0-fy1*fy0-fx2*fx2;    
		//rt_kprintf("\r\n Line5=x2*x0-y1*y0-x2*x2=(%d)*(%d)-(%d)*(%d)-(%d)*(%d)=%ld     Se : %ld   \r\n",x2,x0,y1,y0,x2,x2,Line5_Resualt,Line5_Resualt2); 
          //    rt_kprintf("\r\n FLine5=fx2*fx0-fy1*fy0-fx2*fx2=(%f)*(%f)-(%f)*(%f)-(%f)*(%f)=%f      fx2*fx0=%f    fy1*fy0=%f   fx2*fx2=%f  \r\n",fx2,fx0,fy1,fy0,fx2,fx2,FLine5_Resualt2,fx2*fx0,fy1*fy0,fx2*fx2);   
 	      // rt_kprintf("\r\n  Line4_Resualt=%d     Line5_Resualt=%d  \r\n",Line4_Resualt,Line5_Resualt);    

	     if(fy1>=0)      //  直线(4) 在上发
	  	{
               
			//   2.3   判断区域    (4) <=  0    且  (5)  >=0     // 判断条件取反
			     if((FLine4_Resualt2>0) ||(FLine5_Resualt2<0))
				 	 return   ROUTE_DIS_Default;      //  不满足条件返回最大数值
	  	}
	     else
	     	{      //  直线(5)

                   	//   2.4   判断区域     (4) >=  0    且  (5)  <=0     // 判断条件取反 
			     if((FLine4_Resualt2<0) ||(FLine5_Resualt2>0)) 
				 	 return   ROUTE_DIS_Default;      //  不满足条件返回最大数值 

	     	}	

              rt_kprintf("\r\n In judge area \r\n");  
		//rt_kprintf("\r\n   Current== Latitude:   %d     Longitude: %d     Point1== Latitude:   %d     Longitude: %d     Point2== Latitude:   %d     Longitude: %d\r\n",Cur_Lat,Cur_Longi,P1_Lat,P1_Longi,P2_Lat,P2_Longi);   

        //  3. 将差值差算成实际距离
             #if 0
		    x2=x2*0.0853; // a/1000000*85300=a 853/10000 m =a x 0.0853
                 y1=y1/9; //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
                 x0=x0*0.0853;     
		   y0=y0/9; //  a/1000000*111000=a/9.009	    
	      #else
		   fx2=fx2*0.0853; // a/1000000*85300=a 853/10000 m =a x 0.0853
                 fy1=fy1/9; //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
                 fx0=fx0*0.0853;     
		   fy0=fy0/9; //  a/1000000*111000=a/9.009	      
             #endif

	 //  4. 计算距离 
	       //Rabs=0-y1*x0-x2*y0+y1*x2;  
              // rt_kprintf("\r\n Test -y1*x0=%d -y0*x2=%d  y1*x2=%d   Rabs=%d  \r\n",0-y1*x0,0-y0*x2,0-y1*x2,Rabs);          
	  #if 0
	       Rabs=abs(-y1*x0-x2*y0+y1*x2);   
	       Rsqrt=sqrt(y1*y1+x2*x2); 
	        // distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2); 
	       distance=Rabs/Rsqrt;
	  // rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);        
        #else
             	fRabs=abs(-fy1*fx0-fx2*fy0+fy1*fx2);   
	       fRsqrt=sqrt(fy1*fy1+fx2*fx2); 
	        // distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2); 
	       distance=(long) ((fRabs/fRsqrt)*1000);
	       // rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);      
	  #endif
	  
	     
     return   distance;
}

/*
void  ISP_DF_Status(void)
{
  
   BD_ISP.ISP_status_Read=0;  // 上电读取 DF 状态
   memset(ISP_buffer,0,sizeof(ISP_buffer));
   SST25V_BufferRead(ISP_buffer,ISP_StartArea,256);      
   if(ISP_buffer[32]==ISP_B

}
*/

 unsigned short int File_CRC_Get(void)  
{
 
 u8   buffer_temp[514]; 
 unsigned short int i=0;
 u16  packet_num=0,leftvalue=0;  // 512    per packet
 u32  File_size=0; 

 DF_LOCK=1;
   memset(buffer_temp,0,sizeof(buffer_temp));   

   //  获取  文件头信息
   SST25V_BufferRead( buffer_temp,ISP_StartArea,  256 );     
   File_size=(buffer_temp[114]<<24)+(buffer_temp[115]<<16)+(buffer_temp[116]<<8)+buffer_temp[117];
   
   leftvalue=File_size%512;
   rt_kprintf("\r\n 文件大小: %d Bytes  leftvalue=%d \r\n",File_size,leftvalue);  			
   FileTCB_CRC16=(buffer_temp[134]<<8)+buffer_temp[135];
   rt_kprintf("\r\n Read CRC16: 0x%X Bytes\r\n",FileTCB_CRC16);  

  // OutPrint_HEX("1stpacket",buffer_temp,256);  
   
    if(leftvalue)   // 除以 512
          packet_num=(File_size>>9)+1; 
	else 
          packet_num=(File_size>>9);

	
   for(i=0;i<packet_num;i++)
	{
		if(i==0)   //第一包
			{
			Last_crc=0;   // clear first  
			crc_fcs=0; 
			SST25V_BufferRead(buffer_temp,ISP_StartArea+256,512);   // 0x001000+256=0x001100   ISP_StartArea+256
			delay_ms(50);
			WatchDog_Feed();		 	
			Last_crc=CRC16_1(buffer_temp,512,0xffff);
			//rt_kprintf("\r\n                  i=%d,Last_crc=0x%X",i+1,Last_crc);  
			
			//rt_kprintf("\r\n //----------   %d     packet    len=%d  ",i+1,512); 
			//OutPrint_HEX("1stpacket",buffer_temp,512);  
			}
		else 
		if(i==(packet_num-1))  //最后一包  
			{
             SST25V_BufferRead(buffer_temp,ISP_StartArea+256+i*512,leftvalue);    
			 delay_ms(50);
			 WatchDog_Feed();			 
			// rt_kprintf("\r\n //----------   %d     packet    len=%d  ",i+1,leftvalue); 
			// OutPrint_HEX("endstpacket",buffer_temp,leftvalue);  
			 crc_fcs=CRC16_1(buffer_temp,leftvalue,Last_crc);
			 rt_kprintf("\r\n                  i=%d,Last_crc=0x%X ReadCrc=0x%X ",i+1,crc_fcs,FileTCB_CRC16);   
			} 
		else  
			{             // 中间的包
			  SST25V_BufferRead(buffer_temp,ISP_StartArea+256+i*512,512);    
			  delay_ms(50); 
			  WatchDog_Feed();			  
			 // rt_kprintf("\r\n //----------   %d	 packet    len=%d  ",i+1,512); 			  
			 // OutPrint_HEX("midstpacket",buffer_temp,512);     
			  Last_crc=CRC16_1(buffer_temp,512,Last_crc);  			  
			 // rt_kprintf("\r\n                 i=%d,Last_crc=0x%X",i+1,Last_crc);    
			}
	   }

      DF_LOCK=0; 
      rt_kprintf("\r\n  校验结果 0x%X \r\n",crc_fcs);  

	  if(FileTCB_CRC16==crc_fcs)
	  	{
	  	    SST25V_BufferRead( buffer_temp,0x001000,100 );
		    buffer_temp[32] = ISP_BYTE_CrcPass;    //-----   文件校验通过 
		    SST25V_BufferWrite( buffer_temp,0x001000,100);  
	  	    rt_kprintf("\r\n  校验正确! \r\n",crc_fcs);
		   return true;
	  	}
	  else
	  	{
           rt_kprintf("\r\n  校验失败! \r\n",crc_fcs);
		   return false;
	  	} 
}
//FINSH_FUNCTION_EXPORT(File_CRC_Get, File_CRC_Get);      

//-----------------------------------------------------------------------------------
void Save_AvrgSpdPerMin(void)  
{ /*
     Note: 存储单位小时每分钟平均速度 
  */
  u8   content[70];
  u8   saveLen=0,FCS=0,i;   
    
	 saveLen=0; 
	 memset(content,0,70);
	 memcpy(content+saveLen,Avrgspd_Mint.datetime_Bak,5);    //用BAKtime
	 saveLen+=5;
	 memcpy(content+saveLen,Avrgspd_Mint.avgrspd,60);    //用BAKtime
	 saveLen+=60;  
  //---------------------------------------------------------------------------------------
  FCS = 0;
  for ( i = 0; i < 69; i++ ) 
  {
	 FCS ^=content[i];    
  } 			 //求上边数据的异或和   
  content[69] = FCS;	 // 第8字节	       
  //----------------------------------------------------------------------------------------  
  Api_DFdirectory_Write(spdpermin, content, 70); 
  //-----------------------------------------------------------------
  memset(Avrgspd_Mint.avgrspd,0,60); // 存储后清除记录     
   if(DispContent)
        rt_kprintf("\r\n   存储单位小时每分钟平均速度   Save Time %X-%X-%X %x:%x     \r\n",\
  	Avrgspd_Mint.datetime_Bak[0],Avrgspd_Mint.datetime_Bak[1],\
  	Avrgspd_Mint.datetime_Bak[2],Avrgspd_Mint.datetime_Bak[3],Avrgspd_Mint.datetime_Bak[4]);   
  
