nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}

  void Spd_Exp_Wr(void)
  {	
     u8  content[40];
     u8  wr_add=0,i=0,FCS=0; 	 

	 memset(content,0,sizeof(content));
	 
	memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriveName,18);
	wr_add+=18;
	memcpy(content+wr_add,speed_Exd.ex_startTime,6);
	wr_add+=6;
	memcpy(content+wr_add,speed_Exd.ex_endTime,6);  
	wr_add+=6; 
	content[wr_add++]=speed_Exd.current_maxSpd/10; 

       FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(spd_warn, (u8 *)content, 32); 
	  //----------- debug -----------------------
	  rt_kprintf("\r\n 超速报警  %X-%X-%X %X:%X:%X,MaxSpd=%d\r\n",speed_Exd.ex_endTime[0],speed_Exd.ex_endTime[1],speed_Exd.ex_endTime[2],speed_Exd.ex_endTime[3],speed_Exd.ex_endTime[4],speed_Exd.ex_endTime[5],speed_Exd.current_maxSpd); 
     //--------- clear status ----------------------------
     Spd_ExpInit(); 

  }

void Save_TiredDrive_Record(void) 
{
  u8   content[40];
  u8   wr_add=0,FCS=0,i; 

        wr_add=0; 
	 memset(content,0,70);

	  Time2BCD(TiredConf_struct.Tired_drive.end_time); 
	 
      memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriveName,18);
	  wr_add+=18;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.start_time,6);
	  wr_add+=6;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.end_time,6);
	  wr_add+=6; 

	      FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(tired_warn, (u8 *)content, 32); 
       //-----  clear status ---------------  
	  TIRED_Drive_Init();      
	  Status_TiredwhRst=0;
	 // DF_WriteFlashSector(DF_TiredStartTime_Page,0,(u8*)&Status_TiredwhRst,1); //清除O后要写入		
	   TIRED_Drive_Init(); //	休息了 
	   Warn_Status[3]&=~0x04;  //BIT(2)	疲劳驾驶  

}

//E:\work_xj\F4_BD\北斗行车记录仪过检(新协议)\2-21 RT-Thread_NewBoard-LCD2-Jiance\bsp\stm32f407vgt6_RecDrv\app_712\lcd\Menu_0_3_Sim.c
void CAN_struct_init(void)
{
      //-------  protocol variables
     CAN_trans.can1_sample_dur=0;  // can1 采集间隔  ms
     CAN_trans.can1_trans_dur=0;  // can1  上报间隔 s
     CAN_trans.can1_enable_get=0; // 500ms 

     CAN_trans.can2_sample_dur=0;  // can2 采集间隔  ms
     CAN_trans.can2_trans_dur=0;  // can2  上报间隔 s      
     
   //   u8      canid_1[8];// 原始设置
     CAN_trans.canid_1_Filter_ID=0;  // 接收判断用
      //u8      canid_1_Rxbuf[400]; // 接收buffer
     CAN_trans.canid_1_RxWr=0; // 写buffer下标
     CAN_trans.canid_1_SdWr=0;
      CAN_trans.canid_1_ext_state=0; // 扩展帧状态
     CAN_trans.canid_1_sample_dur=10;  // 改ID 的采集间隔
     CAN_trans.canid_ID_enableGet=0;   

      //------- system variables  
      CAN_trans.canid_timer=0;  //定时器
      CAN_trans.canid_0705_sdFlag=0;// 发送标志位	   

}

void  CAN_send_timer(void)
{
   u16 i=0,datanum=0;;
       if(CAN_trans.can1_trans_dur>0) 
      {  
            CAN_trans.canid_timer++;
	    // if( CAN_trans.canid_timer>=CAN_trans.can1_trans_dur)		
	      if( CAN_trans.canid_timer>=4)      	        
	      {	  
                   CAN_trans.canid_timer=0; 
		     //------  判断有没有数据项
		     if(CAN_trans.canid_1_RxWr)
		     	{
		     	      datanum=(CAN_trans.canid_1_RxWr>>3); 
		     	      memcpy(CAN_trans.canid_1_Sdbuf,CAN_trans.canid_1_Rxbuf,CAN_trans.canid_1_RxWr);
			      CAN_trans.canid_1_SdWr=CAN_trans.canid_1_RxWr;	
			      for(i=0;i<datanum;i++)
				       CAN_trans.canid_1_ID_SdBUF[i]=CAN_trans.canid_1_ID_RxBUF[i];  
				  
			      CAN_trans.canid_1_RxWr=0; // clear
		             CAN_trans.canid_0705_sdFlag=1;
		     	}
			else
			     rt_kprintf("\r\n rx=%d  dur=%ds   CAN send trigger ,no data \r\n",CAN_trans.canid_1_RxWr,CAN_trans.can1_trans_dur);   	

	     	}	 

       }
	else
       {
                  CAN_trans.canid_0705_sdFlag=0;
		    CAN_trans.canid_timer=0;
	}
}

/*
void  vdrflag_enable(u8 invalue)
{
      switch(invalue)
      	{
              case 8:  VdrData.H_08_saveFlag=1;
			           break;
			  case 9: VdrData.H_09_saveFlag=1;
			           break;
			  case 10:  VdrData.H_10_saveFlag=1;
			           break;
			  case 11: VdrData.H_11_saveFlag=1;
			           break; 	       
			  case 12:	VdrData.H_12_saveFlag=1;
					  break;
			  case 13: VdrData.H_13_saveFlag=1;
					  break;
			  case 14:	VdrData.H_14_saveFlag=1;
					  break;
			  case 15: VdrData.H_15_saveFlag=1;
					  break;		
      	}



}
//FINSH_FUNCTION_EXPORT(vdrflag_enable, vdrflag_enable );     
*/


void  JT808_Related_Save_Process(void)
{
       if(DF_LOCK)
	   	 return ;

	  if(Dev_Voice.CMD_Type!='1')  // 录音时不做以下处理  
      {           
        // 1. VDR  08H  Data  Save          
         if(VdrData.H_08_saveFlag==1)
         {   
             WatchDog_Feed(); 
             //OutPrint_HEX("08H save",VdrData.H_08_BAK,126); 		
             rt_kprintf("\r\n 08H save  %d \r\n",Vdr_Wr_Rd_Offset.V_08H_Write);
             vdr_creat_08h(Vdr_Wr_Rd_Offset.V_08H_Write,VdrData.H_08_BAK,126); 		  
			 Vdr_Wr_Rd_Offset.V_08H_Write++; //  写完之后累加，就不用遍历了
             VdrData.H_08_saveFlag=0;  
			 return;
         }
	    // 2.  VDR  09H  Data  Save 
	     if(VdrData.H_09_saveFlag==1)
         {    
             WatchDog_Feed(); 
            // OutPrint_HEX("09H save",VdrData.H_09,666);  
             rt_kprintf("\r\n 09H save  %d\r\n",Vdr_Wr_Rd_Offset.V_09H_Write);
             vdr_creat_09h(Vdr_Wr_Rd_Offset.V_09H_Write,VdrData.H_09,666); 	
			 Vdr_Wr_Rd_Offset.V_09H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_09_saveFlag=0;    
			 return;
         }
       //  3. VDR  10H  Data  Save
         if(VdrData.H_10_saveFlag==1)
         {   
             WatchDog_Feed(); 
            // OutPrint_HEX("10H save",VdrData.H_10,234);   
             rt_kprintf("\r\n 10H save  %d\r\n",Vdr_Wr_Rd_Offset.V_10H_Write); 
             vdr_creat_10h(Vdr_Wr_Rd_Offset.V_10H_Write,VdrData.H_10,234); 	
			 Vdr_Wr_Rd_Offset.V_10H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_10_saveFlag=0;
			 return;
         }
      //  4.  VDR  11H  Data  Save
          if(VdrData.H_11_saveFlag==1)
         {   
             WatchDog_Feed(); 
            // OutPrint_HEX("11H save",VdrData.H_11,50);   
             rt_kprintf("\r\n 11H save   %d \r\n",Vdr_Wr_Rd_Offset.V_11H_Write);
             vdr_creat_11h(Vdr_Wr_Rd_Offset.V_11H_Write,VdrData.H_11,50); 	
			 Vdr_Wr_Rd_Offset.V_11H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_11_saveFlag=0;
			 return;
         } 
	  //  5.  VDR  12H  Data  Save
          if(VdrData.H_12_saveFlag==1)
         {   
             WatchDog_Feed(); 
             //OutPrint_HEX("12H save",VdrData.H_12,25);  
             rt_kprintf("\r\n 12H save  %d \r\n",Vdr_Wr_Rd_Offset.V_12H_Write);
             vdr_creat_12h(Vdr_Wr_Rd_Offset.V_12H_Write,VdrData.H_12,25); 	
			 Vdr_Wr_Rd_Offset.V_12H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_12_saveFlag=0;
			 
			 rt_kprintf("\r\n 写IC 卡  记录  \r\n");  
			 return;
         }  	 
      //  6.  VDR  13H  Data  Save
          if(VdrData.H_13_saveFlag==1)
         {  
             WatchDog_Feed(); 
            // OutPrint_HEX("13H save",VdrData.H_13,7);  
             rt_kprintf("\r\n 13H save %d \r\n",Vdr_Wr_Rd_Offset.V_13H_Write);
             vdr_creat_13h(Vdr_Wr_Rd_Offset.V_13H_Write,VdrData.H_13,7); 	
			 Vdr_Wr_Rd_Offset.V_13H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_13_saveFlag=0;
			 return;
         } 
      //  7.  VDR  14H  Data  Save
          if(VdrData.H_14_saveFlag==1)
         {    
              WatchDog_Feed(); 
              //OutPrint_HEX("14H save",VdrData.H_14,7);  
             rt_kprintf("\r\n 14H save  %d\r\n",Vdr_Wr_Rd_Offset.V_14H_Write);    
             vdr_creat_14h(Vdr_Wr_Rd_Offset.V_14H_Write,VdrData.H_14,7); 	
			 Vdr_Wr_Rd_Offset.V_14H_Write++; // //  写完之后累加，就不用遍历了 
             VdrData.H_14_saveFlag=0;
			 return; 
         } 		  
 
		 
		//---------------------------------------
	    //  存储每分钟速度信息  
		if(1==Avrgspd_Mint.saveFlag) 
		{
			Save_AvrgSpdPerMin();
			Avrgspd_Mint.saveFlag=0; 
			return;
		}					  	  

		//-----------------  存储疲劳驾驶记录 ---------------			
		if( TiredConf_struct.Tired_drive.Tireddrv_status==2)   
		{
	        Save_TiredDrive_Record();
			return;	 
		}			
		//-----------------  超速报警 ----------------------
		if(speed_Exd.excd_status==2)
		{
		   Spd_Exp_Wr();   
		   return; 
		}   

