nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
     }           
	//	 定时存储里程
	if((Vehicle_RunStatus==0x01)&&(DistanceWT_Flag==1))   
	{   //  如果车辆在行驶过程中，每255 秒存储一次里程数据    
	      //rt_kprintf("\r\n distance --------\r\n");        
		  DistanceWT_Flag=0;// clear
		  DF_Write_RecordAdd(Distance_m_u32,DayStartDistance_32,TYPE_DayDistancAdd);
		  JT808Conf_struct.DayStartDistance_32=DayStartDistance_32; 
		  JT808Conf_struct.Distance_m_u32=Distance_m_u32;		
		  return;		
	} 
			
	 //--------------------------------------------------------------

}


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void Tired_Check( void )
{
	if( DispContent == 2 )
	{
		rt_kprintf( "\r\n				速度: %d Km/h    Debugspd=%d KM/h \r\n", Spd_Using/10, DebugSpd / 10 );
	}
	if( Spd_Using > 60 )                                                                                                        // Spd_Using 单位为0.1 km/h  速度大于6 km/h  认为是行驶
	// if(DebugSpd>60)
	{
		//-------------疲劳驾驶相关 -----------------------
		TiredConf_struct.Tired_drive.ACC_ONstate_counter++;                                                                     // ACC 累计工作时间
		if( DispContent == 5 )
		{
			rt_kprintf( "\r\n  ACC ON = %d", TiredConf_struct.Tired_drive.ACC_ONstate_counter );
		}
		if( TiredConf_struct.Tired_drive.ACC_ONstate_counter > 3 )                                                              //ACC 开 485 外设开电，防抖处理
		{
			Power_485CH1_ON;                                                                                                    // 第一路485的电        上电工作
		}

		TiredConf_struct.Tired_drive.ACC_Offstate_counter = 0;                                                                  // clear
		//------ 停车超时相关  -----------
		TiredConf_struct.TiredDoor.Parking_currentcnt	= 0;                                                                    // Clear  停车 计数器清 0
		Warn_Status[1]									&= ~0x08;                                                               // 停车超时清除
		//---------------------------------
		if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec- 300 ) )   //提前5分钟蜂鸣器提示注意疲劳驾驶 14100
		{
			TiredConf_struct.Tired_drive.Tgvoice_play = 1;
			TTS_play( "您还有5分钟就疲劳驾驶，请注意行车安全" );
		}

		Status_TiredwhRst = 1;                                                                                                  // 没疲劳时为1
		if( TiredConf_struct.Tired_drive.ACC_ONstate_counter >= ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec) )        //14400 // 连续驾驶超过4小时算疲劳驾驶
		{
			TiredConf_struct.Tired_drive.Tgvoice_play = 0;

			Status_TiredwhRst								= 2;                                                                // 疲劳了就为2了
			TiredConf_struct.Tired_drive.Tireddrv_status	= 1;                                                                // 记录疲劳驾驶的状态
			if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec) )    //14400
			{
				//Tired_drive.Tgvoice_play=1;  // 开始播放疲劳驾驶语音提示
				// Tired_drive.voicePly_counter++;
				Time2BCD( TiredConf_struct.Tired_drive.start_time );
				rt_kprintf( "\r\n   疲劳驾驶触发了! \r\n" );
				TTS_play( "您已经疲劳驾驶，请注意休息" );
				//tts_bro_tired_flag	= 1;
				Warn_Status[3]		|= 0x04; //BIT(2)  疲劳驾驶 
				//---- 触发即时上报数据-------
				PositionSD_Enable( );
				Current_UDP_sd = 1;
				//-------------------------------------
				Rstart_time = 1;
			}
			//--------- 蜂鸣器提示相关	关闭蜂鸣器 记录下疲劳驾驶  ------------
			Warn_Status[3]								|= 0x04;                                                                    //BIT(2)  疲劳驾驶
			TiredConf_struct.Tired_drive.Tgvoice_play	= 0;
		}
		TiredConf_struct.Tired_drive.Flag = 1;
	}else
	{
		//------------ 疲劳驾驶相关  ----------------------
		if( TiredConf_struct.Tired_drive.Flag == 1 )                                                                                //只有从ACCon切换过来时才做以下处理，如果长期关着，没有必要了
		{
			//-- ACC 没有休息前还算AccON 的状态  ---------------
			TiredConf_struct.Tired_drive.ACC_ONstate_counter++;                                                                     // ACC 累计工作时间

			if( DispContent == 5 )
			{
				rt_kprintf( "\r\n	ACC ON 2 = %d, Spd_Using = %d", TiredConf_struct.Tired_drive.ACC_ONstate_counter, Spd_Using );
			}
			if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec - 300 ) )   //提前5分钟蜂鸣器提示注意疲劳驾驶 14100
			{
				TiredConf_struct.Tired_drive.Tgvoice_play = 1;
				TTS_play( "您还有5分钟就疲劳驾驶，请注意行车安全" ); 
			}

			if( TiredConf_struct.Tired_drive.ACC_ONstate_counter >= ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec ) )        //14400 // 连续驾驶超过4小时算疲劳驾驶
			{
				Status_TiredwhRst								= 2;                                                                // 疲劳了就为2了
				TiredConf_struct.Tired_drive.Tireddrv_status	= 1;                                                                // 记录疲劳驾驶的状态
				if( TiredConf_struct.Tired_drive.ACC_ONstate_counter == ( TiredConf_struct.TiredDoor.Door_DrvKeepingSec  ) )    //14400
				{
					Time2BCD( TiredConf_struct.Tired_drive.start_time );
					rt_kprintf( "\r\n	 速度小，但未满足休息门限时间 疲劳驾驶触发了! \r\n");
					TTS_play( "您已经疲劳驾驶，请注意休息" );
					//tts_bro_tired_flag	= 1;
					Warn_Status[3]		|= 0x04;                                                                                    //BIT(2)  疲劳驾驶
					//---- 触发即时上报数据-------
					PositionSD_Enable( );
					Current_UDP_sd = 1;
					//-------------------------------------
					Rstart_time = 1;
				}
				Warn_Status[3] |= 0x04;                                                                                             //BIT(2)  疲劳驾驶
			}
			//------------------------------------------------------------------------------
			TiredConf_struct.Tired_drive.ACC_Offstate_counter++;
			if( DispContent == 5 )
			{
				rt_kprintf( "\r\n  ACC OFF = %d, Spd_Using = %d", TiredConf_struct.Tired_drive.ACC_Offstate_counter, Spd_Using );
			}
			if( TiredConf_struct.Tired_drive.ACC_Offstate_counter >= TiredConf_struct.TiredDoor.Door_MinSleepSec )  //1200	// ACC 关20分钟视为休息
			{
				if( TiredConf_struct.Tired_drive.ACC_Offstate_counter == TiredConf_struct.TiredDoor.Door_MinSleepSec )
				{
					TiredConf_struct.Tired_drive.ACC_Offstate_counter	= 0;
					TiredConf_struct.Tired_drive.ACC_ONstate_counter	= 0;
					Warn_Status[3]										&= ~0x04;                    //BIT(2)	疲劳驾驶
				    /*	
				       if( tts_bro_tired_flag == 1 )
					{
						TTS_play( "您的疲劳驾驶报警已经解除" );
						tts_bro_tired_flag = 0;
					}*/
					// Status_TiredwhRst=0;
					// DF_WriteFlashSector(DF_TiredStartTime_Page,0,(u8*)&Status_TiredwhRst,1); //清除O后要写入
					//---- 触发即时上报数据-------
					PositionSD_Enable( );
					Current_UDP_sd = 1;
					//-------------------------------------	                          rt_kprintf("\r\n   ACC  休息了 \r\n");
					if( Rstart_time == 1 )
					{
						TiredConf_struct.Tired_drive.Flag = 0; ///////
						//Tired_drive.ACC_ONstate_counter=0;

						Rstart_time										= 0;
						TiredConf_struct.Tired_drive.Tireddrv_status	= 2;
						//rt_kprintf("\r\n疲劳结束时间写入");
					}
				}
			}
		}

		//----------  超长停车相关 ------------------------------------------------------
	#if 0	
		if( Spd_Using < 3 )                                                                                         //(Spd_Using==0)  // 停车超时从速度为0时开始
		//if(DebugSpd<3)
		{
			TiredConf_struct.TiredDoor.Parking_currentcnt++;
			//if(DispContent==2)
			//  printf("\r\n @#@\r\n");
			if( TiredConf_struct.TiredDoor.Parking_currentcnt >= TiredConf_struct.TiredDoor.Door_MaxParkingSec )    //TiredDoor.Door_MaxParkingSec)
			{                                                                                                       //  停车大于门限值，就算停车了
				Warn_Status[1] |= 0x08;                                                                             // 停车超时触发
				if( TiredConf_struct.TiredDoor.Parking_currentcnt == TiredConf_struct.TiredDoor.Door_MaxParkingSec )
				{
					//---- 触发即时上报数据-------
					PositionSD_Enable( );
					Current_UDP_sd = 1;
					//-------------------------------------
					TTS_play( " 超时停车触发" );
					rt_kprintf( "\r\n 超时停车触发! \r\n" );
				}
			}
		}else
		{
			TiredConf_struct.TiredDoor.Parking_currentcnt = 0;
		}
	#endif	
		//--------------------------------------------------------------------------------
	}
}



