nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
/*
    打印输出 HEX 信息，Descrip : 描述信息 ，instr :打印信息， inlen: 打印长度
*/
void OutPrint_HEX(u8 * Descrip, u8 *instr, u16 inlen )
{
    u32  i=0;
     rt_kprintf("\r\n %s:",Descrip);
     for( i=0;i<inlen;i++)
          rt_kprintf("%2X ",instr[i]); 
     rt_kprintf("\r\n");
}

/*
void gpsspd(u8 *strin)   //  GPS 用假速度
{
   sscanf(strin, "%d", (u32*)&Spd_add_debug);
   rt_kprintf("\r\n set gpsspd= %d s\r\n",Spd_add_debug);  
}
FINSH_FUNCTION_EXPORT(gpsspd, gpsspd);    

void normalspd(void)    // 恢复 GPS 用真速度
{
    Spd_add_debug=0;
    rt_kprintf("\r\n recover normal spd\r\n");   
}
FINSH_FUNCTION_EXPORT(normalspd, normalspd);     
*/
void  dur(u8 *content)
{
  sscanf(content, "%d", (u32*)&Current_SD_Duration);
  rt_kprintf("\r\n 手动设置上报时间间隔 %d s \r\n",Current_SD_Duration); 
  
       JT808Conf_struct.DURATION.Default_Dur=Current_SD_Duration;
        Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));

}
FINSH_FUNCTION_EXPORT(dur, dur);  



void handsms(u8 *instr)
{    
    memset(SMS_Service.SMS_sd_Content,0,sizeof(SMS_Service.SMS_sd_Content)); 
    memcpy(SMS_Service.SMS_sd_Content,instr,strlen((const char*)instr));  
    SMS_Service.SMS_sendFlag=1;	
	SMS_Service.SMS_come=1;
    rt_kprintf("手动发送:  %s",SMS_Service.SMS_sd_Content);    
}
//FINSH_FUNCTION_EXPORT(handsms, handsms);  


void driver_name(u8 *instr)
{   
    memset(JT808Conf_struct.Driver_Info.DriveName,0,sizeof(JT808Conf_struct.Driver_Info.DriveName)); 
	memcpy(JT808Conf_struct.Driver_Info.DriveName,instr,strlen((const char*)instr)); 
    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));		
}
FINSH_FUNCTION_EXPORT(driver_name, set_driver_name );   

void adjust_ok(int in)
{
    if(in>1)
  	 return;
   if(in==1)
    {
       JT808Conf_struct.DF_K_adjustState=1;
        ModuleStatus|=Status_Pcheck;
   	}
   else
   {
      JT808Conf_struct.DF_K_adjustState=0;   
       ModuleStatus&=~Status_Pcheck; 
   }
   rt_kprintf("adjust_ok(%d)\r\n",in); 
   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));	   
}
FINSH_FUNCTION_EXPORT(adjust_ok, set_adjust_ok  1:ok 0: notok); 

void spd_type(int  in)
{
  if(in>1)
  	 return;
  
  if(in==0)
  	{
  	  JT808Conf_struct.Speed_GetType=0;
      JT808Conf_struct.DF_K_adjustState=0; 
	  ModuleStatus&=~Status_Pcheck; 
	  
	  rt_kprintf("spd_type: gps_speed get\r\n"); 
  	}
  else
  if(in==1)	
  	{
       JT808Conf_struct.Speed_GetType=1;
       JT808Conf_struct.DF_K_adjustState=0;
	   ModuleStatus&=~Status_Pcheck; 
	   
	   rt_kprintf("spd_type: sensor_speed get\r\n"); 
  	}  
  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));	  

}
FINSH_FUNCTION_EXPORT(spd_type, spd_type  gps->0  sensor->1); 

void  plus_num(u32 value)
{
  JT808Conf_struct.Vech_Character_Value=value;
  
  rt_kprintf("plus_num(%d)\r\n",value);    
  Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));	  
   
}
FINSH_FUNCTION_EXPORT(plus_num, set_plus_num); 


void chepai(u8 *instr)
{    
    memset(Vechicle_Info.Vech_Num,0,sizeof(Vechicle_Info.Vech_Num));
    memcpy(Vechicle_Info.Vech_Num,instr,8); 
   DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));    
   WatchDog_Feed();
   DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
   WatchDog_Feed();
   DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
}
FINSH_FUNCTION_EXPORT(chepai, set_chepai);   

void  vin_set(u8 *instr)
{
	 //车辆VIN
	memset(Vechicle_Info.Vech_VIN,0,sizeof(Vechicle_Info.Vech_VIN));
	memcpy(Vechicle_Info.Vech_VIN,instr,strlen((const char*)instr)); 
	DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));	
	WatchDog_Feed();
	DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
	WatchDog_Feed();
	DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 

       rt_kprintf("\r\n 手动设置vin:%s \r\n",instr); 

}
FINSH_FUNCTION_EXPORT(vin_set, vin_set );    

void  current(void)
{
    PositionSD_Enable();
    Current_UDP_sd=1;
}
FINSH_FUNCTION_EXPORT(current, current );    


void  link_mode(u8 *instr)
{
   if(instr[0]=='1')
   {
      Vechicle_Info.Link_Frist_Mode=1;
	   rt_kprintf("\r\n Mainlink:%s \r\n",instr);   
   }	  
   else
   if(instr[0]=='0')
   {
   	   Vechicle_Info.Link_Frist_Mode=0;
       rt_kprintf("\r\n DNSR :%s \r\n",instr);  
   }	
  
  DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));
  WatchDog_Feed();
  DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
  
  WatchDog_Feed();
  DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 

}
FINSH_FUNCTION_EXPORT(link_mode, link_mode );    

void  redial(void)
{
      DataLink_EndFlag=1; //AT_End();   
        rt_kprintf("\r\n Redial\r\n");      
}
FINSH_FUNCTION_EXPORT(redial, redial); 

void  port_main(u8 *instr)
{
   		   sscanf(instr, "%d", (u32*)&RemotePort_main);  
		   rt_kprintf("\r\n设置主端口=%d!",RemotePort_main);
		   SysConf_struct.Port_main=RemotePort_main;
		   Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
		   
		   DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
			DataLink_EndFlag=1; //AT_End();  

}
FINSH_FUNCTION_EXPORT(port_main, port_main); 

void  port_aux(u8 *instr)
{
   		   sscanf(instr, "%d", (u32*)&RemotePort_aux);  
		   rt_kprintf("\r\n设置辅助端口=%d!",RemotePort_aux);
		   SysConf_struct.Port_Aux=RemotePort_aux;
		   Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
		   
		   DataLink_AuxSocket_set(RemoteIP_main,RemotePort_aux,1);
		//	DataLink_EndFlag=1; //AT_End();  

}
//FINSH_FUNCTION_EXPORT(port_aux, port_aux); 


void dnsr_main(u8*instr)
{
    u16  len=0;

	len=strlen((const char*)instr);

	if(len!=0)
   {
        memset(DomainNameStr,0,sizeof(DomainNameStr));					  
		memset(SysConf_struct.DNSR,0,sizeof(DomainNameStr));  
		memcpy(DomainNameStr,(char*)instr,len);
		memcpy(SysConf_struct.DNSR,(char*)instr,len);
		Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
		//----- 传给 GSM 模块------
		DataLink_DNSR_Set(SysConf_struct.DNSR,1); 
         //--------    清除鉴权码 -------------------
	     idip("clear");		
	}					 

