nathanlnw/tw705_TJ_combine/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}
FINSH_FUNCTION_EXPORT(dnsr_main, dnsr_main);  

void dnsr_aux(u8*instr)
{
    u16  len=0;

	len=strlen((const char*)instr);

	if(len!=0)
   {
        memset(DomainNameStr_aux,0,sizeof(DomainNameStr_aux));					  
		memset(SysConf_struct.DNSR_Aux,0,sizeof(DomainNameStr_aux));  
		memcpy(DomainNameStr_aux,(char*)instr,len);
		memcpy(SysConf_struct.DNSR_Aux,(char*)instr,len);
		Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
		//----- 传给 GSM 模块------
		DataLink_DNSR2_Set(SysConf_struct.DNSR_Aux,1);  
         //--------    清除鉴权码 -------------------
	  //   idip("clear");		
	}					 

}
//FINSH_FUNCTION_EXPORT(dnsr_aux, dnsr_aux);  

void password(u8 in)
{
  
   Login_Menu_Flag=in;    // clear  first flag 	 Login_Menu_Flag=0;     //  输入界面为0   
   DF_WriteFlashSector(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 
   rt_kprintf("\r\n  password=%d \r\n",Login_Menu_Flag);  
}
FINSH_FUNCTION_EXPORT(password, password);   


void  print_power(u8*instr)
{
     if(instr[0]=='0')
    {   
          Print_power_Q5_enable=0;
	  lcd_update_all();
	  //rt_kprintf("\r\n  printer poweroff\r\n");
    }

   if(instr[0]=='1')
    {    
         Print_power_Q5_enable=1;
          lcd_update_all(); 
	  // rt_kprintf("\r\n printer poweron\r\n"); 
  } 
}
//FINSH_FUNCTION_EXPORT(print_power, print_power[1|0]);       

void buzzer_onoff(u8 in) 
{
   
   GPIO_InitTypeDef GPIO_InitStructure;
   
     if(0==in)
    {  
      #if 0
      if(Module_3020C==GPS_MODULE_TYPE)
      {
         Buzzer_on_Q7_enable=0;
	     lcd_update_all();
      }
	  if(Module_3017A==GPS_MODULE_TYPE)
	  	{
			GPIO_ResetBits(Buzzer_IO_Group,Buzzer_Group_Num); 
	  	}
	  // rt_kprintf("\r\n  buzzer off\r\n");}
	  #endif
     GPIO_StructInit(&GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5; 			//指定复用引脚
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;		//模式为输入
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//频率为快速
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;		//下拉以便节省电能
	GPIO_Init(GPIOA, &GPIO_InitStructure);  
	  
    }
	  
   if(1==in)
    {
      #if 0
      if(Module_3020C==GPS_MODULE_TYPE)
      {
        Buzzer_on_Q7_enable=1;
		lcd_update_all();
      }
	  if(Module_3017A==GPS_MODULE_TYPE)
	  {
           	    GPIO_SetBits(Buzzer_IO_Group,Buzzer_Group_Num);	
	  }
	//	rt_kprintf("\r\n buzzer  on\r\n");

     #endif
	  //-----------------  hardware  0x101    5   Beep -----------------
	/*仅设置结构体中的部分成员：这种情况下，用户应当首先调用函数PPP_SturcInit(..)
	来初始化变量PPP_InitStructure，然后再修改其中需要修改的成员。这样可以保证其他
	成员的值（多为缺省值）被正确填入。
	 */
	
	GPIO_StructInit(&GPIO_InitStructure);
	
	/*配置GPIOA_Pin_5，作为TIM2_Channel1 PWM输出*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5; 			//指定复用引脚
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;		//模式必须为复用！
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//频率为快速
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;		//上拉与否对PWM产生无影响
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	//GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM2); //复用GPIOA_Pin1为TIM2_Ch2
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_TIM2); //复用GPIOA_Pin5为TIM2_Ch1, 
	} 


}
FINSH_FUNCTION_EXPORT(buzzer_onoff, buzzer_onoff[1|0]);    

/*
void jiaspd(u16 in)
{
    Speed_jiade=in;
	rt_kprintf("\r\n jia spd =%d\r\n",Speed_jiade); 
}
FINSH_FUNCTION_EXPORT(jiaspd, jiaspd);     


void bcd(void)
{
   u8 in[6];

	memset(in,0,6); 
    Time2BCD(in); 
	rt_kprintf("\r\n setset %x-%x-%x %x:%x:%x \r\n",in[0],in[1],in[2],in[3],in[4],in[5]);    
}
FINSH_FUNCTION_EXPORT(bcd, bcd);         
*/

void provinceid(u8 *strin)
{
  sscanf(strin, "%d", (u32*)&Vechicle_Info.Dev_ProvinceID);
  
  DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));
  WatchDog_Feed();
  DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
  
  WatchDog_Feed();
  DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
 // rt_kprintf("\r\n 车辆所在省域ID: %d \r\n",Vechicle_Info.Dev_ProvinceID); 
}
//FINSH_FUNCTION_EXPORT(provinceid, provinceid);    

void cityid(u8 *strin) 
{
   sscanf(strin, "%d", (u32*)&Vechicle_Info.Dev_CityID);  
   DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));
   WatchDog_Feed();
   DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
   
   WatchDog_Feed();
   DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
  /// rt_kprintf("\r\n 车辆所在市域ID: %d \r\n",Vechicle_Info.Dev_CityID);   
}
//FINSH_FUNCTION_EXPORT(cityid, cityid);     

void ata_enable(u8 value)
{
  //rt_kprintf("\r\n  ata_enable=%d \r\n",value); 

  JT808Conf_struct.Auto_ATA_flag=value;  
  Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
}
//FINSH_FUNCTION_EXPORT(ata_enable, ata_enable[1|0]);    


void  type_vech(u8 type)   
{
  Vechicle_Info.Vech_Type_Mark=type;   

  if(type==1)
  	{
  	  rt_kprintf("\r\n  车辆类型设置为:  两客一危\r\n");
	  memset(Vechicle_Info.Vech_Type,0,sizeof(Vechicle_Info.Vech_Type));
	  memcpy(Vechicle_Info.Vech_Type,"客车",4);	

  	}
  else
  if(type==2)
     {
         rt_kprintf("\r\n  车辆类型设置为:  货运\r\n");
         memset(Vechicle_Info.Vech_Type,0,sizeof(Vechicle_Info.Vech_Type));
	     memcpy(Vechicle_Info.Vech_Type,"货车",4);	 
  	}	 
  	  
	
  DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));
  WatchDog_Feed();
  DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
  
  WatchDog_Feed();
  DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 

}
FINSH_FUNCTION_EXPORT(type_vech, type_vech[1|0]);      


// C.  Module
